[Killed] BlockStatement
Algebra.js:314:27
          * @param {Number} n
          * @returns {Frac}
          */
-        sub: function (n) {
-            var sum = new Frac(0), l = this.coeffs.length;
-            for(var i = 0; i < l; i++) {
-                var t = this.coeffs[i];
-                if(!t.equals(0))
-                    sum = sum.add(t.multiply(new Frac(Math.pow(n, i))));
-            }
-            return sum;
-        },
+        sub: function (n) {},
         /**
          * Returns a clone of the polynomial
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-13*x-x^2+2*x^3-6)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:316:28
          */
         sub: function (n) {
             var sum = new Frac(0), l = this.coeffs.length;
-            for(var i = 0; i < l; i++) {
+            for(var i = 0; false; i++) {
                 var t = this.coeffs[i];
                 if(!t.equals(0))
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:316:40
          */
         sub: function (n) {
             var sum = new Frac(0), l = this.coeffs.length;
-            for(var i = 0; i < l; i++) {
-                var t = this.coeffs[i];
-                if(!t.equals(0))
-                    sum = sum.add(t.multiply(new Frac(Math.pow(n, i))));
-            }
+            for(var i = 0; i < l; i++) {}
             return sum;
         },
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BooleanLiteral
Algebra.js:318:20
             var sum = new Frac(0), l = this.coeffs.length;
             for(var i = 0; i < l; i++) {
                 var t = this.coeffs[i];
-                if(!t.equals(0))
+                if(t.equals(0))
                     sum = sum.add(t.multiply(new Frac(Math.pow(n, i))));
             }
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:318:20
             var sum = new Frac(0), l = this.coeffs.length;
             for(var i = 0; i < l; i++) {
                 var t = this.coeffs[i];
-                if(!t.equals(0))
+                if(false)
                     sum = sum.add(t.multiply(new Frac(Math.pow(n, i))));
             }
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:327:28
          * Returns a clone of the polynomial
          * @returns {Polynomial}
          */
-        clone: function () {
-            var p = new Polynomial();
-            p.coeffs = this.coeffs;
-            p.variable = this.variable;
-            return p;
-        },
+        clone: function () {},
         /**
          * Gets the degree of the polynomial
killedBy: Algebra should perform gcd operations correctly
statusReason: ParseError: Cannot read property 'divide' of undefined: 1

[Killed] BlockStatement
Algebra.js:337:26
          * Gets the degree of the polynomial
          * @returns {Number}
          */
-        deg: function () {
-            this.trim();
-            return this.coeffs.length - 1;
-        },
+        deg: function () {},
         /**
          * Returns a lead coefficient
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-13*x-x^2+2*x^3-6)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Survived] MethodExpression
Algebra.js:338:13
          * @returns {Number}
          */
         deg: function () {
-            this.trim();
+            this;
             return this.coeffs.length - 1;
         },

[Killed] ArithmeticOperator
Algebra.js:339:20
          */
         deg: function () {
             this.trim();
-            return this.coeffs.length - 1;
+            return this.coeffs.length + 1;
         },
         /**
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-13*x-x^2+2*x^3-6)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:345:25
          * Returns a lead coefficient
          * @returns {Frac}
          */
-        lc: function () {
-            return this.coeffs[this.deg()].clone();
-        },
+        lc: function () {},
         /**
          * Converts polynomial into a monic polynomial
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-13*x-x^2+2*x^3-6)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[NoCoverage] BlockStatement
Algebra.js:352:28
          * Converts polynomial into a monic polynomial
          * @returns {Polynomial}
          */
-        monic: function () {
-            var lc = this.lc(), l = this.coeffs.length;
-            for(var i = 0; i < l; i++)
-                this.coeffs[i] = this.coeffs[i].divide(lc);
-            return this;
-        },
+        monic: function () {},
         /**
          * Returns the GCD of two polynomials

[NoCoverage] UpdateOperator
Algebra.js:354:35
          */
         monic: function () {
             var lc = this.lc(), l = this.coeffs.length;
-            for(var i = 0; i < l; i++)
+            for(var i = 0; i < l; i--)
                 this.coeffs[i] = this.coeffs[i].divide(lc);
             return this;

[NoCoverage] ConditionalExpression
Algebra.js:354:28
          */
         monic: function () {
             var lc = this.lc(), l = this.coeffs.length;
-            for(var i = 0; i < l; i++)
+            for(var i = 0; false; i++)
                 this.coeffs[i] = this.coeffs[i].divide(lc);
             return this;

[Survived] ArithmeticOperator
Algebra.js:365:23
          */
         gcd: function (poly) {
             //get the maximum power of each
-            var mp1 = this.coeffs.length - 1,
+            var mp1 = this.coeffs.length + 1,
                     mp2 = poly.coeffs.length - 1,
                     T;

[Killed] ArithmeticOperator
Algebra.js:366:27
         gcd: function (poly) {
             //get the maximum power of each
             var mp1 = this.coeffs.length - 1,
-                    mp2 = poly.coeffs.length - 1,
+                    mp2 = poly.coeffs.length + 1,
                     T;
             //swap so we always have the greater power first
killedBy: Algebra should perform gcd operations correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Killed] ConditionalExpression
Algebra.js:369:16
                     mp2 = poly.coeffs.length - 1,
                     T;
             //swap so we always have the greater power first
-            if(mp1 < mp2) {
+            if(true) {
                 return poly.gcd(this);
             }
killedBy: Algebra should perform gcd operations correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Survived] ConditionalExpression
Algebra.js:369:16
                     mp2 = poly.coeffs.length - 1,
                     T;
             //swap so we always have the greater power first
-            if(mp1 < mp2) {
+            if(false) {
                 return poly.gcd(this);
             }

[Killed] BooleanLiteral
Algebra.js:374:19
             }
             var a = this;
 
-            while(!poly.isZero()) {
+            while(poly.isZero()) {
                 var t = poly.clone();
                 a = a.clone();
killedBy: Algebra should perform gcd operations correctly
statusReason: Expected '27*x^3+27*x^4+28*x+28*x^2+5*x^5+5*x^6' to equal '5*x^3+7*x'.

[Killed] ConditionalExpression
Algebra.js:374:19
             }
             var a = this;
 
-            while(!poly.isZero()) {
+            while(false) {
                 var t = poly.clone();
                 a = a.clone();
killedBy: Algebra should perform gcd operations correctly
statusReason: Expected '27*x^3+27*x^4+28*x+28*x^2+5*x^5+5*x^6' to equal '5*x^3+7*x'.

[Killed] BlockStatement
Algebra.js:383:32
             }
 
             var gcd = core.Math2.QGCD.apply(null, a.coeffs);
-            if(!gcd.equals(1)) {
-                var l = a.coeffs.length;
-                for(var i = 0; i < l; i++) {
-                    a.coeffs[i] = a.coeffs[i].divide(gcd);
-                }
-            }
+            if(!gcd.equals(1)) {}
             return a;
         },
killedBy: Algebra should perform gcd operations correctly
statusReason: Expected '12*x+21' to equal '4*x+7'.

[Killed] ConditionalExpression
Algebra.js:383:16
             }
 
             var gcd = core.Math2.QGCD.apply(null, a.coeffs);
-            if(!gcd.equals(1)) {
+            if(false) {
                 var l = a.coeffs.length;
                 for(var i = 0; i < l; i++) {
killedBy: Algebra should perform gcd operations correctly
statusReason: Expected '12*x+21' to equal '4*x+7'.

[Killed] ConditionalExpression
Algebra.js:385:32
             var gcd = core.Math2.QGCD.apply(null, a.coeffs);
             if(!gcd.equals(1)) {
                 var l = a.coeffs.length;
-                for(var i = 0; i < l; i++) {
+                for(var i = 0; false; i++) {
                     a.coeffs[i] = a.coeffs[i].divide(gcd);
                 }
killedBy: Algebra should perform gcd operations correctly
statusReason: Expected '12*x+21' to equal '4*x+7'.

[Killed] UpdateOperator
Algebra.js:385:39
             var gcd = core.Math2.QGCD.apply(null, a.coeffs);
             if(!gcd.equals(1)) {
                 var l = a.coeffs.length;
-                for(var i = 0; i < l; i++) {
+                for(var i = 0; i < l; i--) {
                     a.coeffs[i] = a.coeffs[i].divide(gcd);
                 }
killedBy: Algebra should perform gcd operations correctly
statusReason: ParseError: Cannot read property 'divide' of undefined: 1

[Killed] BlockStatement
Algebra.js:395:27
          * Differentiates the polynomial
          * @returns {Polynomial}
          */
-        diff: function () {
-            var new_array = [], l = this.coeffs.length;
-            for(var i = 1; i < l; i++)
-                new_array.push(this.coeffs[i].multiply(new Frac(i)));
-            this.coeffs = new_array;
-            return this;
-        },
+        diff: function () {},
         /**
          * Integrates the polynomial
killedBy: Algebra should use simple factor result
statusReason: Expected '1/4+x+x^2' to be '(1/4)*(1+2*x)^2'.

[Killed] UpdateOperator
Algebra.js:397:35
          */
         diff: function () {
             var new_array = [], l = this.coeffs.length;
-            for(var i = 1; i < l; i++)
+            for(var i = 1; i < l; i--)
                 new_array.push(this.coeffs[i].multiply(new Frac(i)));
             this.coeffs = new_array;
killedBy: Algebra should use simple factor result
statusReason: Expected '1/4+x+x^2' to be '(1/4)*(1+2*x)^2'.

[Timeout] ConditionalExpression
Algebra.js:397:28
          */
         diff: function () {
             var new_array = [], l = this.coeffs.length;
-            for(var i = 1; i < l; i++)
+            for(var i = 1; false; i++)
                 new_array.push(this.coeffs[i].multiply(new Frac(i)));
             this.coeffs = new_array;

[NoCoverage] BlockStatement
Algebra.js:406:32
          * Integrates the polynomial
          * @returns {Polynomial} 
          */
-        integrate: function () {
-            var new_array = [0], l = this.coeffs.length;
-            for(var i = 0; i < l; i++) {
-                var c = new Frac(i + 1);
-                new_array[c] = this.coeffs[i].divide(c);
-            }
-            this.coeffs = new_array;
-            return this;
-        },
+        integrate: function () {},
         /**
          * Returns the Greatest common factor of the polynomial

[NoCoverage] ArrayDeclaration
Algebra.js:407:29
          * @returns {Polynomial} 
          */
         integrate: function () {
-            var new_array = [0], l = this.coeffs.length;
+            var new_array = [], l = this.coeffs.length;
             for(var i = 0; i < l; i++) {
                 var c = new Frac(i + 1);

[NoCoverage] BlockStatement
Algebra.js:408:40
          */
         integrate: function () {
             var new_array = [0], l = this.coeffs.length;
-            for(var i = 0; i < l; i++) {
-                var c = new Frac(i + 1);
-                new_array[c] = this.coeffs[i].divide(c);
-            }
+            for(var i = 0; i < l; i++) {}
             this.coeffs = new_array;
             return this;

[NoCoverage] UpdateOperator
Algebra.js:408:35
          */
         integrate: function () {
             var new_array = [0], l = this.coeffs.length;
-            for(var i = 0; i < l; i++) {
+            for(var i = 0; i < l; i--) {
                 var c = new Frac(i + 1);
                 new_array[c] = this.coeffs[i].divide(c);

[NoCoverage] ArithmeticOperator
Algebra.js:409:34
         integrate: function () {
             var new_array = [0], l = this.coeffs.length;
             for(var i = 0; i < l; i++) {
-                var c = new Frac(i + 1);
+                var c = new Frac(i - 1);
                 new_array[c] = this.coeffs[i].divide(c);
             }

[NoCoverage] BlockStatement
Algebra.js:420:38
          * @param {bool} toPolynomial - true if a polynomial is wanted
          * @returns {Frac|Polynomial}
          */
-        gcf: function (toPolynomial) {
-            //get the first nozero coefficient and returns its power
-            var fnz = function (a) {
-                for(var i = 0; i < a.length; i++)
-                    if(!a[i].equals(0))
-                        return i;
-            },
-                    ca = [];
-            for(var i = 0; i < this.coeffs.length; i++) {
-                var c = this.coeffs[i];
-                if(!c.equals(0) && ca.indexOf(c) === -1)
-                    ca.push(c);
-            }
-            var p = [core.Math2.QGCD.apply(undefined, ca), fnz(this.coeffs)].toDecimal();
-
-            if(toPolynomial) {
-                var parr = [];
-                parr[p[1] - 1] = p[0];
-                p = Polynomial.fromArray(parr, this.variable).fill();
-            }
-
-            return p;
-        },
+        gcf: function (toPolynomial) {},
         /**
          * Raises a polynomial P to a power p -> P^p. e.g. (x+1)^2

[NoCoverage] BlockStatement
Algebra.js:422:36
          */
         gcf: function (toPolynomial) {
             //get the first nozero coefficient and returns its power
-            var fnz = function (a) {
-                for(var i = 0; i < a.length; i++)
-                    if(!a[i].equals(0))
-                        return i;
-            },
+            var fnz = function (a) {},
                     ca = [];
             for(var i = 0; i < this.coeffs.length; i++) {

[NoCoverage] UpdateOperator
Algebra.js:423:46
         gcf: function (toPolynomial) {
             //get the first nozero coefficient and returns its power
             var fnz = function (a) {
-                for(var i = 0; i < a.length; i++)
+                for(var i = 0; i < a.length; i--)
                     if(!a[i].equals(0))
                         return i;

[NoCoverage] ConditionalExpression
Algebra.js:423:32
         gcf: function (toPolynomial) {
             //get the first nozero coefficient and returns its power
             var fnz = function (a) {
-                for(var i = 0; i < a.length; i++)
+                for(var i = 0; false; i++)
                     if(!a[i].equals(0))
                         return i;

[NoCoverage] ConditionalExpression
Algebra.js:424:24
             //get the first nozero coefficient and returns its power
             var fnz = function (a) {
                 for(var i = 0; i < a.length; i++)
-                    if(!a[i].equals(0))
+                    if(true)
                         return i;
             },

[NoCoverage] ConditionalExpression
Algebra.js:424:24
             //get the first nozero coefficient and returns its power
             var fnz = function (a) {
                 for(var i = 0; i < a.length; i++)
-                    if(!a[i].equals(0))
+                    if(false)
                         return i;
             },

[NoCoverage] BlockStatement
Algebra.js:428:57
                         return i;
             },
                     ca = [];
-            for(var i = 0; i < this.coeffs.length; i++) {
-                var c = this.coeffs[i];
-                if(!c.equals(0) && ca.indexOf(c) === -1)
-                    ca.push(c);
-            }
+            for(var i = 0; i < this.coeffs.length; i++) {}
             var p = [core.Math2.QGCD.apply(undefined, ca), fnz(this.coeffs)].toDecimal();
 

[NoCoverage] UpdateOperator
Algebra.js:428:52
                         return i;
             },
                     ca = [];
-            for(var i = 0; i < this.coeffs.length; i++) {
+            for(var i = 0; i < this.coeffs.length; i--) {
                 var c = this.coeffs[i];
                 if(!c.equals(0) && ca.indexOf(c) === -1)

[NoCoverage] LogicalOperator
Algebra.js:430:20
                     ca = [];
             for(var i = 0; i < this.coeffs.length; i++) {
                 var c = this.coeffs[i];
-                if(!c.equals(0) && ca.indexOf(c) === -1)
+                if(!c.equals(0) || ca.indexOf(c) === -1)
                     ca.push(c);
             }

[NoCoverage] ConditionalExpression
Algebra.js:430:20
                     ca = [];
             for(var i = 0; i < this.coeffs.length; i++) {
                 var c = this.coeffs[i];
-                if(!c.equals(0) && ca.indexOf(c) === -1)
+                if(true)
                     ca.push(c);
             }

[NoCoverage] ArrayDeclaration
Algebra.js:433:21
                 if(!c.equals(0) && ca.indexOf(c) === -1)
                     ca.push(c);
             }
-            var p = [core.Math2.QGCD.apply(undefined, ca), fnz(this.coeffs)].toDecimal();
+            var p = [].toDecimal();
 
             if(toPolynomial) {

[NoCoverage] ConditionalExpression
Algebra.js:435:16
             }
             var p = [core.Math2.QGCD.apply(undefined, ca), fnz(this.coeffs)].toDecimal();
 
-            if(toPolynomial) {
+            if(false) {
                 var parr = [];
                 parr[p[1] - 1] = p[0];

[NoCoverage] BlockStatement
Algebra.js:435:30
             }
             var p = [core.Math2.QGCD.apply(undefined, ca), fnz(this.coeffs)].toDecimal();
 
-            if(toPolynomial) {
-                var parr = [];
-                parr[p[1] - 1] = p[0];
-                p = Polynomial.fromArray(parr, this.variable).fill();
-            }
+            if(toPolynomial) {}
 
             return p;

[NoCoverage] ArithmeticOperator
Algebra.js:437:22
 
             if(toPolynomial) {
                 var parr = [];
-                parr[p[1] - 1] = p[0];
+                parr[p[1] + 1] = p[0];
                 p = Polynomial.fromArray(parr, this.variable).fill();
             }

[NoCoverage] BlockStatement
Algebra.js:447:35
          * Raises a polynomial P to a power p -> P^p. e.g. (x+1)^2
          * @param {bool} incl_img - Include imaginary numbers 
          */
-        quad: function (incl_img) {
-            var roots = [];
-            if(this.coeffs.length > 3)
-                throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
-            if(this.coeffs.length === 0)
-                throw new Error('Polynomial array has no terms');
-            var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
-            var dsc = b * b - 4 * a * c;
-            if(dsc < 0 && !incl_img)
-                return roots;
-            else {
-                roots[0] = (-b + Math.sqrt(dsc)) / (2 * a);
-                roots[1] = (-b - Math.sqrt(dsc)) / (2 * a);
-            }
-            return roots;
-        },
+        quad: function (incl_img) {},
         /**
          * Makes polynomial square free

[NoCoverage] ConditionalExpression
Algebra.js:449:16
          */
         quad: function (incl_img) {
             var roots = [];
-            if(this.coeffs.length > 3)
+            if(false)
                 throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
             if(this.coeffs.length === 0)

[NoCoverage] ConditionalExpression
Algebra.js:449:16
          */
         quad: function (incl_img) {
             var roots = [];
-            if(this.coeffs.length > 3)
+            if(true)
                 throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
             if(this.coeffs.length === 0)

[NoCoverage] ArithmeticOperator
Algebra.js:450:75
         quad: function (incl_img) {
             var roots = [];
             if(this.coeffs.length > 3)
-                throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
+                throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length + 1));
             if(this.coeffs.length === 0)
                 throw new Error('Polynomial array has no terms');

[NoCoverage] ConditionalExpression
Algebra.js:451:16
             var roots = [];
             if(this.coeffs.length > 3)
                 throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
-            if(this.coeffs.length === 0)
+            if(false)
                 throw new Error('Polynomial array has no terms');
             var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];

[NoCoverage] ConditionalExpression
Algebra.js:451:16
             var roots = [];
             if(this.coeffs.length > 3)
                 throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
-            if(this.coeffs.length === 0)
+            if(true)
                 throw new Error('Polynomial array has no terms');
             var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];

[NoCoverage] ConditionalExpression
Algebra.js:453:46
                 throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
             if(this.coeffs.length === 0)
                 throw new Error('Polynomial array has no terms');
-            var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
+            var a = this.coeffs[2] || 0, b = false, c = this.coeffs[0];
             var dsc = b * b - 4 * a * c;
             if(dsc < 0 && !incl_img)

[NoCoverage] LogicalOperator
Algebra.js:453:21
                 throw new Error('Cannot calculate quadratic order of ' + (this.coeffs.length - 1));
             if(this.coeffs.length === 0)
                 throw new Error('Polynomial array has no terms');
-            var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
+            var a = this.coeffs[2] && 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
             var dsc = b * b - 4 * a * c;
             if(dsc < 0 && !incl_img)

[NoCoverage] ArithmeticOperator
Algebra.js:454:23
             if(this.coeffs.length === 0)
                 throw new Error('Polynomial array has no terms');
             var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
-            var dsc = b * b - 4 * a * c;
+            var dsc = b * b + 4 * a * c;
             if(dsc < 0 && !incl_img)
                 return roots;

[NoCoverage] ArithmeticOperator
Algebra.js:454:31
             if(this.coeffs.length === 0)
                 throw new Error('Polynomial array has no terms');
             var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
-            var dsc = b * b - 4 * a * c;
+            var dsc = b * b - 4 / a * c;
             if(dsc < 0 && !incl_img)
                 return roots;

[NoCoverage] LogicalOperator
Algebra.js:455:16
                 throw new Error('Polynomial array has no terms');
             var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
             var dsc = b * b - 4 * a * c;
-            if(dsc < 0 && !incl_img)
+            if(dsc < 0 || !incl_img)
                 return roots;
             else {

[NoCoverage] BooleanLiteral
Algebra.js:455:27
                 throw new Error('Polynomial array has no terms');
             var a = this.coeffs[2] || 0, b = this.coeffs[1] || 0, c = this.coeffs[0];
             var dsc = b * b - 4 * a * c;
-            if(dsc < 0 && !incl_img)
+            if(dsc < 0 && incl_img)
                 return roots;
             else {

[NoCoverage] BlockStatement
Algebra.js:457:18
             var dsc = b * b - 4 * a * c;
             if(dsc < 0 && !incl_img)
                 return roots;
-            else {
-                roots[0] = (-b + Math.sqrt(dsc)) / (2 * a);
-                roots[1] = (-b - Math.sqrt(dsc)) / (2 * a);
-            }
+            else {}
             return roots;
         },

[NoCoverage] ArithmeticOperator
Algebra.js:458:28
             if(dsc < 0 && !incl_img)
                 return roots;
             else {
-                roots[0] = (-b + Math.sqrt(dsc)) / (2 * a);
+                roots[0] = (-b + Math.sqrt(dsc)) * (2 * a);
                 roots[1] = (-b - Math.sqrt(dsc)) / (2 * a);
             }

[NoCoverage] UnaryOperator
Algebra.js:458:29
             if(dsc < 0 && !incl_img)
                 return roots;
             else {
-                roots[0] = (-b + Math.sqrt(dsc)) / (2 * a);
+                roots[0] = (+b + Math.sqrt(dsc)) / (2 * a);
                 roots[1] = (-b - Math.sqrt(dsc)) / (2 * a);
             }

[NoCoverage] ArithmeticOperator
Algebra.js:459:53
                 return roots;
             else {
                 roots[0] = (-b + Math.sqrt(dsc)) / (2 * a);
-                roots[1] = (-b - Math.sqrt(dsc)) / (2 * a);
+                roots[1] = (-b - Math.sqrt(dsc)) / (2 / a);
             }
             return roots;

[NoCoverage] ArithmeticOperator
Algebra.js:459:29
                 return roots;
             else {
                 roots[0] = (-b + Math.sqrt(dsc)) / (2 * a);
-                roots[1] = (-b - Math.sqrt(dsc)) / (2 * a);
+                roots[1] = (-b + Math.sqrt(dsc)) / (2 * a);
             }
             return roots;

[Killed] ConditionalExpression
Algebra.js:475:19
                     c = a.clone().gcd(b),
                     w = a.divide(c)[0];
             var output = Polynomial.fromArray([new Frac(1)], a.variable);
-            while(!c.equalsNumber(1)) {
+            while(false) {
                 var y = w.gcd(c);
                 var z = w.divide(y)[0];
killedBy: Algebra should factor correctly
statusReason: Expected '10*(-1+x)*(1+x)*(112*x^6+15120*x^4+1764*x^5+217728*x^2+3*x^7+326592*x+75600*x^3+186624)' to equal '10*(-1+x)*(1+x)*(3*x+4)*(6+x)^6'.

[Timeout] BooleanLiteral
Algebra.js:475:19
                     c = a.clone().gcd(b),
                     w = a.divide(c)[0];
             var output = Polynomial.fromArray([new Frac(1)], a.variable);
-            while(!c.equalsNumber(1)) {
+            while(c.equalsNumber(1)) {
                 var y = w.gcd(c);
                 var z = w.divide(y)[0];

[Killed] BlockStatement
Algebra.js:480:49
                 var z = w.divide(y)[0];
                 //one of the factors may have shown up since it's square but smaller than the 
                 //one where finding
-                if(!z.equalsNumber(1) && i > 1) {
-                    var t = z.clone();
-                    for(var j = 1; j < i; j++)
-                        t.multiply(z.clone());
-                    z = t;
-                }
+                if(!z.equalsNumber(1) && i > 1) {}
                 output = output.multiply(z);
                 i++;
killedBy: Algebra should simplify correctly
statusReason: Expected '-(-35*K+4*K^2+112)*(-80+17*K)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] BooleanLiteral
Algebra.js:480:20
                 var z = w.divide(y)[0];
                 //one of the factors may have shown up since it's square but smaller than the 
                 //one where finding
-                if(!z.equalsNumber(1) && i > 1) {
+                if(z.equalsNumber(1) && i > 1) {
                     var t = z.clone();
                     for(var j = 1; j < i; j++)
killedBy: Algebra should simplify correctly
statusReason: Expected '-(-35*K+4*K^2+112)*(-80+17*K)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] ConditionalExpression
Algebra.js:482:36
                 //one where finding
                 if(!z.equalsNumber(1) && i > 1) {
                     var t = z.clone();
-                    for(var j = 1; j < i; j++)
+                    for(var j = 1; false; j++)
                         t.multiply(z.clone());
                     z = t;
killedBy: Algebra should simplify correctly
statusReason: Expected '-(-35*K+4*K^2+112)*(-80+17*K)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Timeout] UpdateOperator
Algebra.js:482:43
                 //one where finding
                 if(!z.equalsNumber(1) && i > 1) {
                     var t = z.clone();
-                    for(var j = 1; j < i; j++)
+                    for(var j = 1; j < i; j--)
                         t.multiply(z.clone());
                     z = t;

[Killed] UpdateOperator
Algebra.js:487:17
                     z = t;
                 }
                 output = output.multiply(z);
-                i++;
+                i--;
                 w = y;
                 c = c.divide(y)[0];
killedBy: Algebra should use simple factor result
statusReason: Expected '1/4' to be '(1/4)*(1+2*x)^2'.

[Killed] ArrayDeclaration
Algebra.js:492:20
                 c = c.divide(y)[0];
             }
 
-            return [output, w, i];
+            return [];
         },
         /**
killedBy: Algebra should use simple factor result
statusReason: Expected '1/4+x+x^2' to be '(1/4)*(1+2*x)^2'.
