[Killed] BlockStatement
Extra.js:35:54
     core.Settings.Laplace_integration_depth = 40;
 
 
-    Symbol.prototype.findFunction = function (fname) {
-        //this is what we're looking for
-        if(this.group === FN && this.fname === fname)
-            return this.clone();
-        var found;
-        if(this.symbols)
-            for(var x in this.symbols) {
-                found = this.symbols[x].findFunction(fname);
-                if(found)
-                    break;
-            }
-
-        return found;
-    };
+    Symbol.prototype.findFunction = function (fname) {};
 
     var __ = core.Extra = {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/4)*cos((158114965/141422324)*t)' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] ConditionalExpression
Extra.js:37:12
 
     Symbol.prototype.findFunction = function (fname) {
         //this is what we're looking for
-        if(this.group === FN && this.fname === fname)
+        if(true)
             return this.clone();
         var found;
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/4)*cos((158114965/141422324)*t)' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] ConditionalExpression
Extra.js:37:12
 
     Symbol.prototype.findFunction = function (fname) {
         //this is what we're looking for
-        if(this.group === FN && this.fname === fname)
+        if(true && this.fname === fname)
             return this.clone();
         var found;
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/4)*cos((158114965/141422324)*t)' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[NoCoverage] ConditionalExpression
Extra.js:40:12
         if(this.group === FN && this.fname === fname)
             return this.clone();
         var found;
-        if(this.symbols)
+        if(true)
             for(var x in this.symbols) {
                 found = this.symbols[x].findFunction(fname);

[NoCoverage] ConditionalExpression
Extra.js:40:12
         if(this.group === FN && this.fname === fname)
             return this.clone();
         var found;
-        if(this.symbols)
+        if(false)
             for(var x in this.symbols) {
                 found = this.symbols[x].findFunction(fname);

[NoCoverage] BlockStatement
Extra.js:41:40
             return this.clone();
         var found;
         if(this.symbols)
-            for(var x in this.symbols) {
-                found = this.symbols[x].findFunction(fname);
-                if(found)
-                    break;
-            }
+            for(var x in this.symbols) {}
 
         return found;

[NoCoverage] ConditionalExpression
Extra.js:43:20
         if(this.symbols)
             for(var x in this.symbols) {
                 found = this.symbols[x].findFunction(fname);
-                if(found)
+                if(false)
                     break;
             }

[NoCoverage] ConditionalExpression
Extra.js:43:20
         if(this.symbols)
             for(var x in this.symbols) {
                 found = this.symbols[x].findFunction(fname);
-                if(found)
+                if(true)
                     break;
             }

[Killed] BooleanLiteral
Extra.js:61:52
 
                 t = t.toString();
                 //First try a lookup for a speed boost
-                symbol = Symbol.unwrapSQRT(symbol, true);
+                symbol = Symbol.unwrapSQRT(symbol, false);
                 var retval,
                         coeff = symbol.stripVar(t),
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(33316161/18796631)*s^(-3/2)' to equal 's^(-3/2)*sqrt(pi)'.

[Killed] ConditionalExpression
Extra.js:68:20
 
                 symbol = _.divide(symbol, coeff.clone());
 
-                if(symbol.isConstant() || !symbol.contains(t, true)) {
+                if(false) {
                     retval = _.parse(format('({0})/({1})', symbol, s));
                 }
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(33316161/18796631)*s^(-3/2)' to equal 's^(-3/2)*sqrt(pi)'.

[Killed] BlockStatement
Extra.js:68:70
 
                 symbol = _.divide(symbol, coeff.clone());
 
-                if(symbol.isConstant() || !symbol.contains(t, true)) {
-                    retval = _.parse(format('({0})/({1})', symbol, s));
-                }
+                if(symbol.isConstant() || !symbol.contains(t, true)) {}
                 else if(g === S && core.Utils.isInt(symbol.power)) {
                     var n = String(symbol.power);
killedBy: Extra Calculus should transform Laplace correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] ConditionalExpression
Extra.js:71:25
                 if(symbol.isConstant() || !symbol.contains(t, true)) {
                     retval = _.parse(format('({0})/({1})', symbol, s));
                 }
-                else if(g === S && core.Utils.isInt(symbol.power)) {
+                else if(false) {
                     var n = String(symbol.power);
                     retval = _.parse(format('factorial({0})/({1})^({0}+1)', n, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(33316161/18796631)*s^(-3/2)' to equal 's^(-3/2)*sqrt(pi)'.

[Killed] LogicalOperator
Extra.js:71:25
                 if(symbol.isConstant() || !symbol.contains(t, true)) {
                     retval = _.parse(format('({0})/({1})', symbol, s));
                 }
-                else if(g === S && core.Utils.isInt(symbol.power)) {
+                else if(g === S || core.Utils.isInt(symbol.power)) {
                     var n = String(symbol.power);
                     retval = _.parse(format('factorial({0})/({1})^({0}+1)', n, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected 's^(-2)' to equal '(a^2+s^2)^(-1)*s'.

[NoCoverage] StringLiteral
Extra.js:73:45
                 }
                 else if(g === S && core.Utils.isInt(symbol.power)) {
                     var n = String(symbol.power);
-                    retval = _.parse(format('factorial({0})/({1})^({0}+1)', n, s));
+                    retval = _.parse(format("", n, s));
                 }
                 else if(symbol.group === S && symbol.power.equals(1 / 2)) {

[Killed] LogicalOperator
Extra.js:75:25
                     var n = String(symbol.power);
                     retval = _.parse(format('factorial({0})/({1})^({0}+1)', n, s));
                 }
-                else if(symbol.group === S && symbol.power.equals(1 / 2)) {
+                else if(symbol.group === S || symbol.power.equals(1 / 2)) {
                     retval = _.parse(format('sqrt(pi)/(2*({0})^(3/2))', s));
                 }
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(1/2)*a*s^(-3/2)*sqrt(pi)' to equal 'a*s^(-2)'.

[Killed] ArithmeticOperator
Extra.js:75:67
                     var n = String(symbol.power);
                     retval = _.parse(format('factorial({0})/({1})^({0}+1)', n, s));
                 }
-                else if(symbol.group === S && symbol.power.equals(1 / 2)) {
+                else if(symbol.group === S && symbol.power.equals(1 * 2)) {
                     retval = _.parse(format('sqrt(pi)/(2*({0})^(3/2))', s));
                 }
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(1/2)*a*s^(-3/2)*sqrt(pi)' to equal '2*a*s^(-3)'.

[Killed] BlockStatement
Extra.js:78:47
                 else if(symbol.group === S && symbol.power.equals(1 / 2)) {
                     retval = _.parse(format('sqrt(pi)/(2*({0})^(3/2))', s));
                 }
-                else if(symbol.isComposite()) {
-                    retval = new Symbol(0);
-                    symbol.each(function (x) {
-                        retval = _.add(retval, __.LaPlace.transform(x, t, s));
-                    }, true);
-                }
+                else if(symbol.isComposite()) {}
                 else if(symbol.isE() && (symbol.power.group === S || symbol.power.group === CB)) {
                     var a = symbol.power.stripVar(t);
killedBy: Extra Calculus should transform Laplace correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] ConditionalExpression
Extra.js:78:25
                 else if(symbol.group === S && symbol.power.equals(1 / 2)) {
                     retval = _.parse(format('sqrt(pi)/(2*({0})^(3/2))', s));
                 }
-                else if(symbol.isComposite()) {
+                else if(true) {
                     retval = new Symbol(0);
                     symbol.each(function (x) {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected 'a*factorial(1)*s^(-2)' to equal 'a*s^(-2)'.

[Killed] BlockStatement
Extra.js:80:46
                 }
                 else if(symbol.isComposite()) {
                     retval = new Symbol(0);
-                    symbol.each(function (x) {
-                        retval = _.add(retval, __.LaPlace.transform(x, t, s));
-                    }, true);
+                    symbol.each(function (x) {}, true);
                 }
                 else if(symbol.isE() && (symbol.power.group === S || symbol.power.group === CB)) {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '0' to equal '((a^2+s^2)^(-1)*a-((1+a^2*s^(-2))^(-2)*s^(-2)-(1+a^2*s^(-2))^(-2)*a^2*s^(-4))*a)*x'.

[Survived] BooleanLiteral
Extra.js:82:24
                     retval = new Symbol(0);
                     symbol.each(function (x) {
                         retval = _.add(retval, __.LaPlace.transform(x, t, s));
-                    }, true);
+                    }, false);
                 }
                 else if(symbol.isE() && (symbol.power.group === S || symbol.power.group === CB)) {

[Killed] LogicalOperator
Extra.js:84:42
                         retval = _.add(retval, __.LaPlace.transform(x, t, s));
                     }, true);
                 }
-                else if(symbol.isE() && (symbol.power.group === S || symbol.power.group === CB)) {
+                else if(symbol.isE() && (symbol.power.group === S && symbol.power.group === CB)) {
                     var a = symbol.power.stripVar(t);
                     retval = _.parse(format('1/(({1})-({0}))', a, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '-(-s+a)^(-1)*x' to equal '(-a+s)^(-1)*x'.

[Killed] ConditionalExpression
Extra.js:84:25
                         retval = _.add(retval, __.LaPlace.transform(x, t, s));
                     }, true);
                 }
-                else if(symbol.isE() && (symbol.power.group === S || symbol.power.group === CB)) {
+                else if(true) {
                     var a = symbol.power.stripVar(t);
                     retval = _.parse(format('1/(({1})-({0}))', a, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: ParseError: symbol.power.stripVar is not a function: 1

[Killed] StringLiteral
Extra.js:86:45
                 }
                 else if(symbol.isE() && (symbol.power.group === S || symbol.power.group === CB)) {
                     var a = symbol.power.stripVar(t);
-                    retval = _.parse(format('1/(({1})-({0}))', a, s));
+                    retval = _.parse(format("", a, s));
                 }
                 else {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '0' to equal '(-a+s)^(-1)*x'.

[Killed] StringLiteral
Extra.js:89:39
                     retval = _.parse(format('1/(({1})-({0}))', a, s));
                 }
                 else {
-                    var fns = ['sin', 'cos', 'sinh', 'cosh'];
+                    var fns = ['sin', "", 'sinh', 'cosh'];
                     //support for symbols in fns with arguments in the form a*t or n*t where a = symbolic and n = Number
                     if(symbol.group === FN && fns.indexOf(symbol.fname) !== -1 && (symbol.args[0].group === S || symbol.args[0].group === CB)) {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(1+a^2*s^(-2))^(-1)*s^(-1)' to equal '(a^2+s^2)^(-1)*s'.

[Killed] ArrayDeclaration
Extra.js:89:31
                     retval = _.parse(format('1/(({1})-({0}))', a, s));
                 }
                 else {
-                    var fns = ['sin', 'cos', 'sinh', 'cosh'];
+                    var fns = [];
                     //support for symbols in fns with arguments in the form a*t or n*t where a = symbolic and n = Number
                     if(symbol.group === FN && fns.indexOf(symbol.fname) !== -1 && (symbol.args[0].group === S || symbol.args[0].group === CB)) {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(1+a^2*s^(-2))^(-1)*s^(-1)' to equal '(a^2+s^2)^(-1)*s'.

[Killed] ConditionalExpression
Extra.js:91:84
                 else {
                     var fns = ['sin', 'cos', 'sinh', 'cosh'];
                     //support for symbols in fns with arguments in the form a*t or n*t where a = symbolic and n = Number
-                    if(symbol.group === FN && fns.indexOf(symbol.fname) !== -1 && (symbol.args[0].group === S || symbol.args[0].group === CB)) {
+                    if(symbol.group === FN && fns.indexOf(symbol.fname) !== -1 && (true)) {
                         var a = symbol.args[0].stripVar(t);
 
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(b^2+s^2)^(-1)*b' to equal '(1+a^2*s^(-2))^(-1)*a*cos(b)*s^(-2)+(1+a^2*s^(-2))^(-1)*s^(-1)*sin(b)'.

[Killed] ConditionalExpression
Extra.js:91:24
                 else {
                     var fns = ['sin', 'cos', 'sinh', 'cosh'];
                     //support for symbols in fns with arguments in the form a*t or n*t where a = symbolic and n = Number
-                    if(symbol.group === FN && fns.indexOf(symbol.fname) !== -1 && (symbol.args[0].group === S || symbol.args[0].group === CB)) {
+                    if(false) {
                         var a = symbol.args[0].stripVar(t);
 
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(1+a^2*s^(-2))^(-1)*s^(-1)' to equal '(a^2+s^2)^(-1)*s'.

[Killed] ConditionalExpression
Extra.js:95:29
                         var a = symbol.args[0].stripVar(t);
 
                         switch(symbol.fname) {
-                            case 'sin':
-                                retval = _.parse(format('({0})/(({1})^2+({0})^2)', a, s));
-                                break;
+                            case 'sin':
                             case 'cos':
                                 retval = _.parse(format('({1})/(({1})^2+({0})^2)', a, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '((a^2+s^2)^(-1)*s-((1+a^2*s^(-2))^(-2)*s^(-2)-(1+a^2*s^(-2))^(-2)*a^2*s^(-4))*a)*x' to equal '((a^2+s^2)^(-1)*a-((1+a^2*s^(-2))^(-2)*s^(-2)-(1+a^2*s^(-2))^(-2)*a^2*s^(-4))*a)*x'.

[Killed] StringLiteral
Extra.js:95:34
                         var a = symbol.args[0].stripVar(t);
 
                         switch(symbol.fname) {
-                            case 'sin':
+                            case "":
                                 retval = _.parse(format('({0})/(({1})^2+({0})^2)', a, s));
                                 break;
killedBy: Extra Calculus should transform Laplace correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] StringLiteral
Extra.js:96:57
 
                         switch(symbol.fname) {
                             case 'sin':
-                                retval = _.parse(format('({0})/(({1})^2+({0})^2)', a, s));
+                                retval = _.parse(format("", a, s));
                                 break;
                             case 'cos':
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '-((1+a^2*s^(-2))^(-2)*s^(-2)-(1+a^2*s^(-2))^(-2)*a^2*s^(-4))*a*x' to equal '((a^2+s^2)^(-1)*a-((1+a^2*s^(-2))^(-2)*s^(-2)-(1+a^2*s^(-2))^(-2)*a^2*s^(-4))*a)*x'.

[Killed] ConditionalExpression
Extra.js:98:29
                             case 'sin':
                                 retval = _.parse(format('({0})/(({1})^2+({0})^2)', a, s));
                                 break;
-                            case 'cos':
-                                retval = _.parse(format('({1})/(({1})^2+({0})^2)', a, s));
-                                break;
+                            case 'cos':
                             case 'sinh':
                                 retval = _.parse(format('({0})/(({1})^2-({0})^2)', a, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(-a^2+s^2)^(-1)*a' to equal '(a^2+s^2)^(-1)*s'.

[Killed] StringLiteral
Extra.js:99:57
                                 retval = _.parse(format('({0})/(({1})^2+({0})^2)', a, s));
                                 break;
                             case 'cos':
-                                retval = _.parse(format('({1})/(({1})^2+({0})^2)', a, s));
+                                retval = _.parse(format("", a, s));
                                 break;
                             case 'sinh':
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '0' to equal '(a^2+s^2)^(-1)*s'.

[Killed] ConditionalExpression
Extra.js:101:29
                             case 'cos':
                                 retval = _.parse(format('({1})/(({1})^2+({0})^2)', a, s));
                                 break;
-                            case 'sinh':
-                                retval = _.parse(format('({0})/(({1})^2-({0})^2)', a, s));
-                                break;
+                            case 'sinh':
                             case 'cosh':
                                 retval = _.parse(format('({1})/(({1})^2-({0})^2)', a, s));
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(-a^2+s^2)^(-1)*s' to equal '(-a^2+s^2)^(-1)*a'.

[Killed] StringLiteral
Extra.js:102:57
                                 retval = _.parse(format('({1})/(({1})^2+({0})^2)', a, s));
                                 break;
                             case 'sinh':
-                                retval = _.parse(format('({0})/(({1})^2-({0})^2)', a, s));
+                                retval = _.parse(format("", a, s));
                                 break;
                             case 'cosh':
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '0' to equal '(-a^2+s^2)^(-1)*a'.

[NoCoverage] ConditionalExpression
Extra.js:104:29
                             case 'sinh':
                                 retval = _.parse(format('({0})/(({1})^2-({0})^2)', a, s));
                                 break;
-                            case 'cosh':
-                                retval = _.parse(format('({1})/(({1})^2-({0})^2)', a, s));
-                                break;
+                            case 'cosh':
                         }
 

[Survived] ConditionalExpression
Extra.js:113:46
                     else {
                         //Try to integrate for a solution
                         //we need at least the Laplace integration depth
-                        var depth_is_lower = core.Settings.integration_depth < core.Settings.Laplace_integration_depth;
+                        var depth_is_lower = true;
 
                         if(depth_is_lower) {

[Survived] ConditionalExpression
Extra.js:113:46
                     else {
                         //Try to integrate for a solution
                         //we need at least the Laplace integration depth
-                        var depth_is_lower = core.Settings.integration_depth < core.Settings.Laplace_integration_depth;
+                        var depth_is_lower = false;
 
                         if(depth_is_lower) {

[Survived] ConditionalExpression
Extra.js:115:28
                         //we need at least the Laplace integration depth
                         var depth_is_lower = core.Settings.integration_depth < core.Settings.Laplace_integration_depth;
 
-                        if(depth_is_lower) {
+                        if(true) {
                             var integration_depth = core.Settings.integration_depth; //save the depth
                             core.Settings.integration_depth = core.Settings.Laplace_integration_depth; //transforms need a little more room

[Survived] BlockStatement
Extra.js:115:44
                         //we need at least the Laplace integration depth
                         var depth_is_lower = core.Settings.integration_depth < core.Settings.Laplace_integration_depth;
 
-                        if(depth_is_lower) {
-                            var integration_depth = core.Settings.integration_depth; //save the depth
-                            core.Settings.integration_depth = core.Settings.Laplace_integration_depth; //transforms need a little more room
-                        }
+                        if(depth_is_lower) {}
 
                         core.Utils.block('PARSE2NUMBER', function () {

[Killed] BlockStatement
Extra.js:120:70
                             core.Settings.integration_depth = core.Settings.Laplace_integration_depth; //transforms need a little more room
                         }
 
-                        core.Utils.block('PARSE2NUMBER', function () {
-                            var u = t;
-                            var sym = symbol.sub(t, u);
-                            var integration_expr = _.parse('e^(-' + s + '*' + u + ')*' + sym);
-                            retval = core.Calculus.integrate(integration_expr, u);
-                            if(retval.hasIntegral())
-                                return _.symfunction('laplace', arguments);
-//                                _.error('Unable to compute transform');
-                            retval = retval.sub(t, 0);
-                            retval = _.expand(_.multiply(retval, new Symbol(-1)));
-                            retval = retval.sub(u, t);
-                        }, false);
+                        core.Utils.block('PARSE2NUMBER', function () {}, false);
 
                         retval = core.Utils.block('PARSE2NUMBER', function () {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected 'a*undefined' to equal 'a*s^(-2)'.

[Survived] StringLiteral
Extra.js:120:42
                             core.Settings.integration_depth = core.Settings.Laplace_integration_depth; //transforms need a little more room
                         }
 
-                        core.Utils.block('PARSE2NUMBER', function () {
+                        core.Utils.block("", function () {
                             var u = t;
                             var sym = symbol.sub(t, u);

[Killed] ConditionalExpression
Extra.js:125:32
                             var sym = symbol.sub(t, u);
                             var integration_expr = _.parse('e^(-' + s + '*' + u + ')*' + sym);
                             retval = core.Calculus.integrate(integration_expr, u);
-                            if(retval.hasIntegral())
+                            if(true)
                                 return _.symfunction('laplace', arguments);
 //                                _.error('Unable to compute transform');
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(-119696244^(s*t)*325368125^(-s*t)*s^(-1)*t-119696244^(s*t)*325368125^(-s*t)*s^(-2))*a' to equal 'a*s^(-2)'.

[Survived] ConditionalExpression
Extra.js:125:32
                             var sym = symbol.sub(t, u);
                             var integration_expr = _.parse('e^(-' + s + '*' + u + ')*' + sym);
                             retval = core.Calculus.integrate(integration_expr, u);
-                            if(retval.hasIntegral())
+                            if(false)
                                 return _.symfunction('laplace', arguments);
 //                                _.error('Unable to compute transform');

[Killed] UnaryOperator
Extra.js:129:77
                                 return _.symfunction('laplace', arguments);
 //                                _.error('Unable to compute transform');
                             retval = retval.sub(t, 0);
-                            retval = _.expand(_.multiply(retval, new Symbol(-1)));
+                            retval = _.expand(_.multiply(retval, new Symbol(+1)));
                             retval = retval.sub(u, t);
                         }, false);
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '-a*s^(-2)' to equal 'a*s^(-2)'.

[Killed] BooleanLiteral
Extra.js:131:28
                             retval = retval.sub(t, 0);
                             retval = _.expand(_.multiply(retval, new Symbol(-1)));
                             retval = retval.sub(u, t);
-                        }, false);
+                        }, true);
 
                         retval = core.Utils.block('PARSE2NUMBER', function () {
killedBy: Extra Calculus should transform Laplace correctly
statusReason: Expected '(460962090826/460962090827)*a' to equal 'a*s^(-2)'.

[Killed] BlockStatement
Extra.js:133:79
                             retval = retval.sub(u, t);
                         }, false);
 
-                        retval = core.Utils.block('PARSE2NUMBER', function () {
-                            return _.parse(retval);
-                        }, true);
+                        retval = core.Utils.block('PARSE2NUMBER', function () {}, true);
 
                         if(depth_is_lower)//put the integration depth as it was
killedBy: Extra Calculus should transform Laplace correctly
statusReason: ParseError: Unexpected token!: 1

[Survived] BooleanLiteral
Extra.js:135:28
 
                         retval = core.Utils.block('PARSE2NUMBER', function () {
                             return _.parse(retval);
-                        }, true);
+                        }, false);
 
                         if(depth_is_lower)//put the integration depth as it was

[Survived] ConditionalExpression
Extra.js:137:28
                             return _.parse(retval);
                         }, true);
 
-                        if(depth_is_lower)//put the integration depth as it was
+                        if(false)//put the integration depth as it was
                             core.Settings.integration_depth = integration_depth;
                     }

[Survived] ConditionalExpression
Extra.js:137:28
                             return _.parse(retval);
                         }, true);
 
-                        if(depth_is_lower)//put the integration depth as it was
+                        if(true)//put the integration depth as it was
                             core.Settings.integration_depth = integration_depth;
                     }

[Killed] BlockStatement
Extra.js:149:45
                 var input_symbol = symbol.clone();
                 return core.Utils.block('POSITIVE_MULTIPLIERS', function () {
                     //expand and get partial fractions
-                    if(symbol.group === CB) {
-                        symbol = core.Algebra.PartFrac.partfrac(_.expand(symbol), s_);
-                    }
+                    if(symbol.group === CB) {}
 
                     if(symbol.group === S || symbol.group === CB || symbol.isComposite()) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(((1+s)*(2+s)*(3+s))^(-1),s,t)' to equal '(1/2)*e^(-3*t)+(1/2)*e^(-t)-e^(-2*t)'.

[Killed] ConditionalExpression
Extra.js:149:24
                 var input_symbol = symbol.clone();
                 return core.Utils.block('POSITIVE_MULTIPLIERS', function () {
                     //expand and get partial fractions
-                    if(symbol.group === CB) {
+                    if(true) {
                         symbol = core.Algebra.PartFrac.partfrac(_.expand(symbol), s_);
                     }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(ilt(3/4,u,t)+ilt(u^2,u,t))*e^((-1/2)*t)' to equal '2*e^((-1/2)*t)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] LogicalOperator
Extra.js:153:24
                         symbol = core.Algebra.PartFrac.partfrac(_.expand(symbol), s_);
                     }
 
-                    if(symbol.group === S || symbol.group === CB || symbol.isComposite()) {
+                    if((symbol.group === S || symbol.group === CB) && symbol.isComposite()) {
                         var finalize = function () {
                             //put back the numerator
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(a*b^(-1)*x^(-1),x,t)' to equal 'a*b^(-1)'.

[Killed] LogicalOperator
Extra.js:153:24
                         symbol = core.Algebra.PartFrac.partfrac(_.expand(symbol), s_);
                     }
 
-                    if(symbol.group === S || symbol.group === CB || symbol.isComposite()) {
+                    if(symbol.group === S && symbol.group === CB || symbol.isComposite()) {
                         var finalize = function () {
                             //put back the numerator
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(a*b^(-1)*x^(-1),x,t)' to equal 'a*b^(-1)'.
