[Killed] BlockStatement
Extra.js:154:52
                     }
 
                     if(symbol.group === S || symbol.group === CB || symbol.isComposite()) {
-                        var finalize = function () {
-                            //put back the numerator
-                            retval = _.multiply(retval, num);
-                            retval.multiplier = retval.multiplier.multiply(symbol.multiplier);
-                            //put back a
-                            retval = _.divide(retval, f.a);
-                        };
+                        var finalize = function () {};
                         var num, den, s, retval, f, p, m, den_p, fe;
                         //remove the multiplier
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '1' to equal 'a*b^(-1)'.

[Killed] BlockStatement
Extra.js:173:46
                         //num = core.Algebra.Factor.factor(symbol.getNum());
                         //den = core.Algebra.Factor.factor(symbol.getDenom().invert(null, true));
 
-                        if(den.group === CP) {
-                            den_p = den.power.clone();
-                            den.toLinear();
-                        }
+                        if(den.group === CP) {}
                         else {
                             den_p = new core.Frac(1);
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Cannot read property 'equals' of undefined: 1

[Killed] ConditionalExpression
Extra.js:173:28
                         //num = core.Algebra.Factor.factor(symbol.getNum());
                         //den = core.Algebra.Factor.factor(symbol.getDenom().invert(null, true));
 
-                        if(den.group === CP) {
+                        if(true) {
                             den_p = den.power.clone();
                             den.toLinear();
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(5/3)*sqrt(pi)' to equal '(10/3)*sqrt(t)'.

[Killed] BlockStatement
Extra.js:177:30
                             den_p = den.power.clone();
                             den.toLinear();
                         }
-                        else {
-                            den_p = new core.Frac(1);
-                        }
+                        else {}
 
                         //convert s to a string
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Cannot read property 'equals' of undefined: 1

[Killed] BooleanLiteral
Extra.js:184:61
                         //convert s to a string
                         s = s_.toString();
                         //split up the denominator if in the form ax+b
-                        f = core.Utils.decompose_fn(den, s, true);
+                        f = core.Utils.decompose_fn(den, s, false);
                         //move the multiplier to the numerator
                         fe = core.Utils.decompose_fn(_.expand(num.clone()), s, true);
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Cannot read property 'value' of undefined: 1

[Survived] BooleanLiteral
Extra.js:186:80
                         //split up the denominator if in the form ax+b
                         f = core.Utils.decompose_fn(den, s, true);
                         //move the multiplier to the numerator
-                        fe = core.Utils.decompose_fn(_.expand(num.clone()), s, true);
+                        fe = core.Utils.decompose_fn(_.expand(num.clone()), s, false);
                         num.multiplier = num.multiplier.multiply(m);
                         //store the parts in variables for easy recognition 

[Killed] ConditionalExpression
Extra.js:190:28
                         num.multiplier = num.multiplier.multiply(m);
                         //store the parts in variables for easy recognition 
                         //check if in the form t^n where n = integer
-                        if((den.group === S || den.group === CB) && f.x.value === s && f.b.equals(0) && core.Utils.isInt(f.x.power)) {
+                        if(true) {
                             var fact, p;
                             p = f.x.power - 1;
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/4)*s*t' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] ConditionalExpression
Extra.js:190:28
                         num.multiplier = num.multiplier.multiply(m);
                         //store the parts in variables for easy recognition 
                         //check if in the form t^n where n = integer
-                        if((den.group === S || den.group === CB) && f.x.value === s && f.b.equals(0) && core.Utils.isInt(f.x.power)) {
+                        if(true && core.Utils.isInt(f.x.power)) {
                             var fact, p;
                             p = f.x.power - 1;
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/4)*s*t' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] ArithmeticOperator
Extra.js:192:33
                         //check if in the form t^n where n = integer
                         if((den.group === S || den.group === CB) && f.x.value === s && f.b.equals(0) && core.Utils.isInt(f.x.power)) {
                             var fact, p;
-                            p = f.x.power - 1;
+                            p = f.x.power + 1;
                             fact = core.Math2.factorial(p);
                             //  n!/s^(n-1)
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(1/2)*a*b^(-1)*t^2' to equal 'a*b^(-1)'.

[Killed] ConditionalExpression
Extra.js:199:33
                             //wrap it up
                             finalize();
                         }
-                        else if(den.group === CP && den_p.equals(1)) {
+                        else if(true) {
                             if(f.x.group === core.groups.PL && core.Algebra.degree(den).equals(2)) {
                                 // Possibly in the form 1/(s^2+2*s+1)
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt((5/3)*s^(-3/2)*sqrt(pi),s,t)' to equal '(10/3)*sqrt(t)'.

[Killed] ConditionalExpression
Extra.js:199:33
                             //wrap it up
                             finalize();
                         }
-                        else if(den.group === CP && den_p.equals(1)) {
+                        else if(true && den_p.equals(1)) {
                             if(f.x.group === core.groups.PL && core.Algebra.degree(den).equals(2)) {
                                 // Possibly in the form 1/(s^2+2*s+1)
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt((5/3)*s^(-3/2)*sqrt(pi),s,t)' to equal '(10/3)*sqrt(t)'.

[Killed] ConditionalExpression
Extra.js:200:32
                             finalize();
                         }
                         else if(den.group === CP && den_p.equals(1)) {
-                            if(f.x.group === core.groups.PL && core.Algebra.degree(den).equals(2)) {
+                            if(false) {
                                 // Possibly in the form 1/(s^2+2*s+1)
                                 // Try factoring to get it in a more familiar form{
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'e^(-t)' to equal '2*e^((-1/2)*t)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] BlockStatement
Extra.js:200:100
                             finalize();
                         }
                         else if(den.group === CP && den_p.equals(1)) {
-                            if(f.x.group === core.groups.PL && core.Algebra.degree(den).equals(2)) {
-                                // Possibly in the form 1/(s^2+2*s+1)
-                                // Try factoring to get it in a more familiar form{
-                                // Apply inverse of F(s-a)
-                                var completed = core.Algebra.sqComplete(den, s);
-                                var u = core.Utils.getU(den);
-                                // Get a for the function above
-                                var a = core.Utils.decompose_fn(completed.a, s, true).b;
-                                var tf = __.LaPlace.inverse(_.parse(`1/((${u})^2+(${completed.c}))`), u, t);
-                                retval = _.multiply(tf, _.parse(`(${m})*e^(-(${a})*(${t}))`));
-                            }
+                            if(f.x.group === core.groups.PL && core.Algebra.degree(den).equals(2)) {}
                             else {
                                 // a/(b*s-c) -> ae^(-bt)
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt((1+s+s^2)^(-1),s,t)' to equal '2*e^((-1/2)*t)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] BooleanLiteral
Extra.js:207:81
                                 var completed = core.Algebra.sqComplete(den, s);
                                 var u = core.Utils.getU(den);
                                 // Get a for the function above
-                                var a = core.Utils.decompose_fn(completed.a, s, true).b;
+                                var a = core.Utils.decompose_fn(completed.a, s, false).b;
                                 var tf = __.LaPlace.inverse(_.parse(`1/((${u})^2+(${completed.c}))`), u, t);
                                 retval = _.multiply(tf, _.parse(`(${m})*e^(-(${a})*(${t}))`));
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '2*e^(-t*undefined)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)' to equal '2*e^((-1/2)*t)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] StringLiteral
Extra.js:208:69
                                 var u = core.Utils.getU(den);
                                 // Get a for the function above
                                 var a = core.Utils.decompose_fn(completed.a, s, true).b;
-                                var tf = __.LaPlace.inverse(_.parse(`1/((${u})^2+(${completed.c}))`), u, t);
+                                var tf = __.LaPlace.inverse(_.parse(``), u, t);
                                 retval = _.multiply(tf, _.parse(`(${m})*e^(-(${a})*(${t}))`));
                             }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'e^((-1/2)*t)*ilt(0,u3,t)' to equal '2*e^((-1/2)*t)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] StringLiteral
Extra.js:209:65
                                 // Get a for the function above
                                 var a = core.Utils.decompose_fn(completed.a, s, true).b;
                                 var tf = __.LaPlace.inverse(_.parse(`1/((${u})^2+(${completed.c}))`), u, t);
-                                retval = _.multiply(tf, _.parse(`(${m})*e^(-(${a})*(${t}))`));
+                                retval = _.multiply(tf, _.parse(``));
                             }
                             else {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '0' to equal '2*e^((-1/2)*t)*sin((1/2)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] LogicalOperator
Extra.js:213:36
                             }
                             else {
                                 // a/(b*s-c) -> ae^(-bt)
-                                if(f.x.isLinear() && !num.contains(s)) {
+                                if(f.x.isLinear() || !num.contains(s)) {
                                     t = _.divide(t, f.a.clone());
 
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(2/9)*e^((-1/9)*t)' to equal '2*sin((1/3)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] ConditionalExpression
Extra.js:213:36
                             }
                             else {
                                 // a/(b*s-c) -> ae^(-bt)
-                                if(f.x.isLinear() && !num.contains(s)) {
+                                if(true) {
                                     t = _.divide(t, f.a.clone());
 
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/16)*e^((-5/16)*t)*s' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] ArithmeticOperator
Extra.js:217:45
                                     t = _.divide(t, f.a.clone());
 
                                     // Don't add factorial of one or zero
-                                    var p = den_p - 1;
+                                    var p = den_p + 1;
                                     var fact = p === 0 || p === 1 ? '1' : `(${den_p}-1)!`
                                     retval = _.parse(format('(({0})^({3}-1)*e^(-(({2})*({0}))/({1})))/(({4})*({1})^({3}))', t, f.a, f.b, den_p, fact));
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(1/2)*e^(-3*t)*factorial(0)^(-1)+(1/2)*e^(-t)*factorial(0)^(-1)-e^(-2*t)*factorial(0)^(-1)' to equal '(1/2)*e^(-3*t)+(1/2)*e^(-t)-e^(-2*t)'.

[Killed] LogicalOperator
Extra.js:218:48
 
                                     // Don't add factorial of one or zero
                                     var p = den_p - 1;
-                                    var fact = p === 0 || p === 1 ? '1' : `(${den_p}-1)!`
+                                    var fact = p === 0 && p === 1 ? '1' : `(${den_p}-1)!`
                                     retval = _.parse(format('(({0})^({3}-1)*e^(-(({2})*({0}))/({1})))/(({4})*({1})^({3}))', t, f.a, f.b, den_p, fact));
                                     //wrap it up
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(1/2)*e^(-3*t)*factorial(0)^(-1)+(1/2)*e^(-t)*factorial(0)^(-1)-e^(-2*t)*factorial(0)^(-1)' to equal '(1/2)*e^(-3*t)+(1/2)*e^(-t)-e^(-2*t)'.

[Killed] ConditionalExpression
Extra.js:218:48
 
                                     // Don't add factorial of one or zero
                                     var p = den_p - 1;
-                                    var fact = p === 0 || p === 1 ? '1' : `(${den_p}-1)!`
+                                    var fact = false ? '1' : `(${den_p}-1)!`
                                     retval = _.parse(format('(({0})^({3}-1)*e^(-(({2})*({0}))/({1})))/(({4})*({1})^({3}))', t, f.a, f.b, den_p, fact));
                                     //wrap it up
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(1/2)*e^(-3*t)*factorial(0)^(-1)+(1/2)*e^(-t)*factorial(0)^(-1)-e^(-2*t)*factorial(0)^(-1)' to equal '(1/2)*e^(-3*t)+(1/2)*e^(-t)-e^(-2*t)'.

[Killed] StringLiteral
Extra.js:219:61
                                     // Don't add factorial of one or zero
                                     var p = den_p - 1;
                                     var fact = p === 0 || p === 1 ? '1' : `(${den_p}-1)!`
-                                    retval = _.parse(format('(({0})^({3}-1)*e^(-(({2})*({0}))/({1})))/(({4})*({1})^({3}))', t, f.a, f.b, den_p, fact));
+                                    retval = _.parse(format("", t, f.a, f.b, den_p, fact));
                                     //wrap it up
                                     finalize();
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '0' to equal '(1/2)*e^(-3*t)+(1/2)*e^(-t)-e^(-2*t)'.

[Killed] ConditionalExpression
Extra.js:224:40
                                     finalize();
                                 }
                                 else {
-                                    if(f.x.group === S && f.x.power.equals(2)) {
+                                    if(false) {
                                         if(!num.contains(s)) {
                                             retval = _.parse(format('(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/sqrt(({2})*({3}))', t, num, f.a, f.b));
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(3*(4*s^2+5)^(-1)*s,s,t)' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Survived] LogicalOperator
Extra.js:224:40
                                     finalize();
                                 }
                                 else {
-                                    if(f.x.group === S && f.x.power.equals(2)) {
+                                    if(f.x.group === S || f.x.power.equals(2)) {
                                         if(!num.contains(s)) {
                                             retval = _.parse(format('(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/sqrt(({2})*({3}))', t, num, f.a, f.b));

[Killed] BooleanLiteral
Extra.js:225:44
                                 }
                                 else {
                                     if(f.x.group === S && f.x.power.equals(2)) {
-                                        if(!num.contains(s)) {
+                                        if(num.contains(s)) {
                                             retval = _.parse(format('(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/sqrt(({2})*({3}))', t, num, f.a, f.b));
                                         }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/2)*s*sin((1/2)*sqrt(5)*t)*sqrt(5)^(-1)' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] ConditionalExpression
Extra.js:225:44
                                 }
                                 else {
                                     if(f.x.group === S && f.x.power.equals(2)) {
-                                        if(!num.contains(s)) {
+                                        if(false) {
                                             retval = _.parse(format('(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/sqrt(({2})*({3}))', t, num, f.a, f.b));
                                         }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(2*(1+3*s^2)^(-1),s,t)' to equal '2*sin((1/3)*sqrt(3)*t)*sqrt(3)^(-1)'.

[Killed] ConditionalExpression
Extra.js:231:48
                                         // a*s/(b*s^2+c^2)
                                         else {
                                             var a = new Symbol(1);
-                                            if(num.group === CB) {
+                                            if(true) {
                                                 var new_num = new Symbol(1);
                                                 num.each(function (x) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '5*cos(3*t)*sin(1)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Survived] ConditionalExpression
Extra.js:231:48
                                         // a*s/(b*s^2+c^2)
                                         else {
                                             var a = new Symbol(1);
-                                            if(num.group === CB) {
+                                            if(false) {
                                                 var new_num = new Symbol(1);
                                                 num.each(function (x) {

[NoCoverage] BlockStatement
Extra.js:233:71
                                             var a = new Symbol(1);
                                             if(num.group === CB) {
                                                 var new_num = new Symbol(1);
-                                                num.each(function (x) {
-                                                    if(x.contains(s))
-                                                        new_num = _.multiply(new_num, x);
-                                                    else
-                                                        a = _.multiply(a, x);
-                                                });
+                                                num.each(function (x) {});
                                                 num = new_num;
                                             }

[NoCoverage] ConditionalExpression
Extra.js:234:56
                                             if(num.group === CB) {
                                                 var new_num = new Symbol(1);
                                                 num.each(function (x) {
-                                                    if(x.contains(s))
+                                                    if(true)
                                                         new_num = _.multiply(new_num, x);
                                                     else

[NoCoverage] ConditionalExpression
Extra.js:234:56
                                             if(num.group === CB) {
                                                 var new_num = new Symbol(1);
                                                 num.each(function (x) {
-                                                    if(x.contains(s))
+                                                    if(false)
                                                         new_num = _.multiply(new_num, x);
                                                     else

[Killed] BooleanLiteral
Extra.js:243:86
                                             }
 
                                             //we need more information about the denominator to decide
-                                            var f2 = core.Utils.decompose_fn(num, s, true);
+                                            var f2 = core.Utils.decompose_fn(num, s, false);
                                             var fn1, fn2, a_has_sin, b_has_cos, a_has_cos, b_has_sin;
                                             fn1 = f2.a;
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Cannot read property 'containsFunction' of undefined: 1

[Killed] StringLiteral
Extra.js:249:78
                                             fn2 = f2.b;
                                             a_has_sin = fn1.containsFunction('sin');
                                             a_has_cos = fn1.containsFunction('cos');
-                                            b_has_cos = fn2.containsFunction('cos');
+                                            b_has_cos = fn2.containsFunction("");
                                             b_has_sin = fn2.containsFunction('sin');
                                             if(f2.x.value === s && f2.x.isLinear() && !((a_has_sin && b_has_cos) || (a_has_cos || b_has_sin))) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '5*cos(3*t)*sin(1)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Survived] StringLiteral
Extra.js:250:78
                                             a_has_sin = fn1.containsFunction('sin');
                                             a_has_cos = fn1.containsFunction('cos');
                                             b_has_cos = fn2.containsFunction('cos');
-                                            b_has_sin = fn2.containsFunction('sin');
+                                            b_has_sin = fn2.containsFunction("");
                                             if(f2.x.value === s && f2.x.isLinear() && !((a_has_sin && b_has_cos) || (a_has_cos || b_has_sin))) {
                                                 retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));

[Killed] LogicalOperator
Extra.js:251:48
                                             a_has_cos = fn1.containsFunction('cos');
                                             b_has_cos = fn2.containsFunction('cos');
                                             b_has_sin = fn2.containsFunction('sin');
-                                            if(f2.x.value === s && f2.x.isLinear() && !((a_has_sin && b_has_cos) || (a_has_cos || b_has_sin))) {
+                                            if(f2.x.value === s && f2.x.isLinear() || !(a_has_sin && b_has_cos || a_has_cos || b_has_sin)) {
                                                 retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));
                                             }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '5*cos(3*t)*sin(1)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] LogicalOperator
Extra.js:251:89
                                             a_has_cos = fn1.containsFunction('cos');
                                             b_has_cos = fn2.containsFunction('cos');
                                             b_has_sin = fn2.containsFunction('sin');
-                                            if(f2.x.value === s && f2.x.isLinear() && !((a_has_sin && b_has_cos) || (a_has_cos || b_has_sin))) {
+                                            if(f2.x.value === s && f2.x.isLinear() && !(a_has_sin && b_has_cos && (a_has_cos || b_has_sin))) {
                                                 retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));
                                             }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '5*cos(3*t)*sin(1)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] StringLiteral
Extra.js:252:73
                                             b_has_cos = fn2.containsFunction('cos');
                                             b_has_sin = fn2.containsFunction('sin');
                                             if(f2.x.value === s && f2.x.isLinear() && !((a_has_sin && b_has_cos) || (a_has_cos || b_has_sin))) {
-                                                retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));
+                                                retval = _.parse(format("", t, f2.a, f.a, f.b));
                                             }
                                             else {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '0' to equal '(3/4)*cos((1/2)*sqrt(5)*t)'.

[Killed] BlockStatement
Extra.js:254:50
                                             if(f2.x.value === s && f2.x.isLinear() && !((a_has_sin && b_has_cos) || (a_has_cos || b_has_sin))) {
                                                 retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));
                                             }
-                                            else {
-                                                if(a_has_sin && b_has_cos) {
-                                                    var sin, cos;
-                                                    sin = fn1.findFunction('sin');
-                                                    cos = fn2.findFunction('cos');
-                                                    //who has the s?
-                                                    if(sin.args[0].equals(cos.args[0]) && !sin.args[0].contains(s)) {
-                                                        var b, c, d, e;
-                                                        b = _.divide(fn2, cos.toUnitMultiplier()).toString();
-                                                        c = sin.args[0].toString();
-                                                        d = f.b;
-                                                        e = _.divide(fn1, sin.toUnitMultiplier());
-                                                        exp = '(({1})*({2})*cos({3})*sin(sqrt({4})*({0})))/sqrt({4})+({1})*sin({3})*({5})*cos(sqrt({4})*({0}))';
-                                                        retval = _.parse(format(exp, t, a, b, c, d, e));
-                                                    }
-                                                }
-                                            }
+                                            else {}
                                         }
                                     }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(3*cos(1)+s*sin(1))*(9+s^2)^(-1),s,t)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] ConditionalExpression
Extra.js:255:52
                                                 retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));
                                             }
                                             else {
-                                                if(a_has_sin && b_has_cos) {
+                                                if(false) {
                                                     var sin, cos;
                                                     sin = fn1.findFunction('sin');
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(3*cos(1)+s*sin(1))*(9+s^2)^(-1),s,t)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.
