[Killed] ConditionalExpression
Algebra.js:1363:28
 
                         j++;
                         // Stop iteration after 20 steps
-                        if(j > 20)
+                        if(true)
                             break;
                         if(j >= 2) {
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)*(1+x)*(-1+x)^7*(1+x)^5*(1+x^2)^4*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Survived] ConditionalExpression
Algebra.js:1363:28
 
                         j++;
                         // Stop iteration after 20 steps
-                        if(j > 20)
+                        if(false)
                             break;
                         if(j >= 2) {

[Survived] BlockStatement
Algebra.js:1365:36
                         // Stop iteration after 20 steps
                         if(j > 20)
                             break;
-                        if(j >= 2) {
-                            if((relstp <= 0.01) && (mp >= omp) && (!triedFlag)) {
-                                // A cluster appears to be stalling the convergence. Five fixed shift
-                                // steps are taken with a u, v close to the cluster.
-                                relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
-                                u -= u * relstp;
-                                v += v * relstp;
-
-                                QuadSD_ak1(NN, u, v, p, qp, sdPar);
-                                for(i = 0; i < 5; i++) {
-                                    tFlag = calcSC_ak1(DBL_EPSILON, N, sdPar.a, sdPar.b, calcPar, K, u, v, qk);
-                                    nextK_ak1(DBL_EPSILON, N, tFlag, sdPar.a, sdPar.b, calcPar, K, qk, qp);
-                                }
-
-                                triedFlag = 1;
-                                j = 0;
-
-                            }
-                        }
+                        if(j >= 2) {}
                         omp = mp;
 

[Survived] ConditionalExpression
Algebra.js:1365:28
                         // Stop iteration after 20 steps
                         if(j > 20)
                             break;
-                        if(j >= 2) {
+                        if(true) {
                             if((relstp <= 0.01) && (mp >= omp) && (!triedFlag)) {
                                 // A cluster appears to be stalling the convergence. Five fixed shift

[Killed] ConditionalExpression
Algebra.js:1366:53
                         if(j > 20)
                             break;
                         if(j >= 2) {
-                            if((relstp <= 0.01) && (mp >= omp) && (!triedFlag)) {
+                            if((relstp <= 0.01) && (true) && (!triedFlag)) {
                                 // A cluster appears to be stalling the convergence. Five fixed shift
                                 // steps are taken with a u, v close to the cluster.
killedBy: Algebra should factor correctly
statusReason: Expected '125+64*x^3' to equal '(-20*x+16*x^2+25)*(4*x+5)'.

[Killed] ConditionalExpression
Algebra.js:1366:32
                         if(j > 20)
                             break;
                         if(j >= 2) {
-                            if((relstp <= 0.01) && (mp >= omp) && (!triedFlag)) {
+                            if(true) {
                                 // A cluster appears to be stalling the convergence. Five fixed shift
                                 // steps are taken with a u, v close to the cluster.
killedBy: Algebra should factor correctly
statusReason: Expected '125+64*x^3' to equal '(-20*x+16*x^2+25)*(4*x+5)'.

[NoCoverage] ConditionalExpression
Algebra.js:1369:44
                             if((relstp <= 0.01) && (mp >= omp) && (!triedFlag)) {
                                 // A cluster appears to be stalling the convergence. Five fixed shift
                                 // steps are taken with a u, v close to the cluster.
-                                relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
+                                relstp = ((false) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
                                 u -= u * relstp;
                                 v += v * relstp;

[NoCoverage] ConditionalExpression
Algebra.js:1369:44
                             if((relstp <= 0.01) && (mp >= omp) && (!triedFlag)) {
                                 // A cluster appears to be stalling the convergence. Five fixed shift
                                 // steps are taken with a u, v close to the cluster.
-                                relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
+                                relstp = ((true) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
                                 u -= u * relstp;
                                 v += v * relstp;

[NoCoverage] ArithmeticOperator
Algebra.js:1370:38
                                 // A cluster appears to be stalling the convergence. Five fixed shift
                                 // steps are taken with a u, v close to the cluster.
                                 relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
-                                u -= u * relstp;
+                                u -= u / relstp;
                                 v += v * relstp;
 

[NoCoverage] AssignmentOperator
Algebra.js:1370:33
                                 // A cluster appears to be stalling the convergence. Five fixed shift
                                 // steps are taken with a u, v close to the cluster.
                                 relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
-                                u -= u * relstp;
+                                u += u * relstp;
                                 v += v * relstp;
 

[NoCoverage] AssignmentOperator
Algebra.js:1371:33
                                 // steps are taken with a u, v close to the cluster.
                                 relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
                                 u -= u * relstp;
-                                v += v * relstp;
+                                v -= v * relstp;
 
                                 QuadSD_ak1(NN, u, v, p, qp, sdPar);

[NoCoverage] ArithmeticOperator
Algebra.js:1371:38
                                 // steps are taken with a u, v close to the cluster.
                                 relstp = ((relstp < DBL_EPSILON) ? Math.sqrt(DBL_EPSILON) : Math.sqrt(relstp));
                                 u -= u * relstp;
-                                v += v * relstp;
+                                v += v / relstp;
 
                                 QuadSD_ak1(NN, u, v, p, qp, sdPar);

[NoCoverage] ConditionalExpression
Algebra.js:1374:44
                                 v += v * relstp;
 
                                 QuadSD_ak1(NN, u, v, p, qp, sdPar);
-                                for(i = 0; i < 5; i++) {
+                                for(i = 0; false; i++) {
                                     tFlag = calcSC_ak1(DBL_EPSILON, N, sdPar.a, sdPar.b, calcPar, K, u, v, qk);
                                     nextK_ak1(DBL_EPSILON, N, tFlag, sdPar.a, sdPar.b, calcPar, K, qk, qp);

[NoCoverage] UpdateOperator
Algebra.js:1374:51
                                 v += v * relstp;
 
                                 QuadSD_ak1(NN, u, v, p, qp, sdPar);
-                                for(i = 0; i < 5; i++) {
+                                for(i = 0; i < 5; i--) {
                                     tFlag = calcSC_ak1(DBL_EPSILON, N, sdPar.a, sdPar.b, calcPar, K, u, v, qk);
                                     nextK_ak1(DBL_EPSILON, N, tFlag, sdPar.a, sdPar.b, calcPar, K, qk, qp);

[Survived] ConditionalExpression
Algebra.js:1395:28
                         vi = sdPar.b;
 
                         // If vi is zero, the iteration is not converging
-                        if(vi != 0) {
+                        if(true) {
                             relstp = Math.abs((-v + vi) / vi);
                             u = ui;

[Timeout] BlockStatement
Algebra.js:1395:37
                         vi = sdPar.b;
 
                         // If vi is zero, the iteration is not converging
-                        if(vi != 0) {
-                            relstp = Math.abs((-v + vi) / vi);
-                            u = ui;
-                            v = vi;
-                        }
+                        if(vi != 0) {}
                     }
                     while(vi != 0);

[Survived] ArithmeticOperator
Algebra.js:1396:48
 
                         // If vi is zero, the iteration is not converging
                         if(vi != 0) {
-                            relstp = Math.abs((-v + vi) / vi);
+                            relstp = Math.abs((-v - vi) / vi);
                             u = ui;
                             v = vi;

[Survived] ArithmeticOperator
Algebra.js:1396:47
 
                         // If vi is zero, the iteration is not converging
                         if(vi != 0) {
-                            relstp = Math.abs((-v + vi) / vi);
+                            relstp = Math.abs((-v + vi) * vi);
                             u = ui;
                             v = vi;

[Killed] ConditionalExpression
Algebra.js:1401:27
                             v = vi;
                         }
                     }
-                    while(vi != 0);
+                    while(false);
                     return;
                 }
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)*(1+x)*(-1+x)^7*(1+x)^5*(1+x^2)^4*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ArithmeticOperator
Algebra.js:1412:50
                     // dumFlag	- flag to indicate a pair of zeros near real axis, returned to iFlag
 
                     var ee, kv, mp, ms, omp, pv, s, t,
-                            dumFlag, i, j, nm1 = N - 1;   // Integer variables
+                            dumFlag, i, j, nm1 = N + 1;   // Integer variables
 
                     iPar.NZ = j = dumFlag = 0;
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1422:36
 
                         // Evaluate p at s
                         qp[0] = pv;
-                        for(i = 1; i < NN; i++) {
+                        for(i = 1; false; i++) {
                             qp[i] = pv = pv * s + p[i];
                         }
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:1422:49
 
                         // Evaluate p at s
                         qp[0] = pv;
-                        for(i = 1; i < NN; i++) {
-                            qp[i] = pv = pv * s + p[i];
-                        }
+                        for(i = 1; i < NN; i++) {}
                         mp = Math.abs(pv);
 
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ArithmeticOperator
Algebra.js:1423:42
                         // Evaluate p at s
                         qp[0] = pv;
                         for(i = 1; i < NN; i++) {
-                            qp[i] = pv = pv * s + p[i];
+                            qp[i] = pv = pv * s - p[i];
                         }
                         mp = Math.abs(pv);
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ArithmeticOperator
Algebra.js:1423:42
                         // Evaluate p at s
                         qp[0] = pv;
                         for(i = 1; i < NN; i++) {
-                            qp[i] = pv = pv * s + p[i];
+                            qp[i] = pv = pv / s + p[i];
                         }
                         mp = Math.abs(pv);
killedBy: Algebra should correctly peform partial fraction decomposition
statusReason: Expected '-3*(-4*x^2-9*x+x^3+20)^(-1)*x-8*(-4*x^2-9*x+x^3+20)^(-1)+3*(-4*x^2-9*x+x^3+20)^(-1)*x^2' to equal '(-4+x+x^2)^(-1)*x+2*(-5+x)^(-1)'.

[Killed] ArithmeticOperator
Algebra.js:1429:30
 
                         // Compute a rigorous bound on the error in evaluating p
                         ms = Math.abs(s);
-                        ee = 0.5 * Math.abs(qp[0]);
+                        ee = 0.5 / Math.abs(qp[0]);
                         for(i = 1; i < NN; i++) {
                             ee = ee * ms + Math.abs(qp[i]);
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:1430:49
                         // Compute a rigorous bound on the error in evaluating p
                         ms = Math.abs(s);
                         ee = 0.5 * Math.abs(qp[0]);
-                        for(i = 1; i < NN; i++) {
-                            ee = ee * ms + Math.abs(qp[i]);
-                        }
+                        for(i = 1; i < NN; i++) {}
 
                         // Iteration has converged sufficiently if the polynomial value is less than
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,-2,3]' to equal '[-2,3,-1/2]'.

[Killed] ConditionalExpression
Algebra.js:1430:36
                         // Compute a rigorous bound on the error in evaluating p
                         ms = Math.abs(s);
                         ee = 0.5 * Math.abs(qp[0]);
-                        for(i = 1; i < NN; i++) {
+                        for(i = 1; false; i++) {
                             ee = ee * ms + Math.abs(qp[i]);
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,-2,3]' to equal '[-2,3,-1/2]'.

[Killed] ArithmeticOperator
Algebra.js:1431:34
                         ms = Math.abs(s);
                         ee = 0.5 * Math.abs(qp[0]);
                         for(i = 1; i < NN; i++) {
-                            ee = ee * ms + Math.abs(qp[i]);
+                            ee = ee / ms + Math.abs(qp[i]);
                         }
 
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3,3/4]' to equal '[3/4,-1/2,3]'.

[Killed] ArithmeticOperator
Algebra.js:1431:34
                         ms = Math.abs(s);
                         ee = 0.5 * Math.abs(qp[0]);
                         for(i = 1; i < NN; i++) {
-                            ee = ee * ms + Math.abs(qp[i]);
+                            ee = ee * ms - Math.abs(qp[i]);
                         }
 
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1436:28
 
                         // Iteration has converged sufficiently if the polynomial value is less than
                         // 20 times this bound
-                        if(mp <= 20.0 * DBL_EPSILON * (2.0 * ee - mp)) {
+                        if(true) {
                             iPar.NZ = 1;
                             iPar.szr = s;
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ArithmeticOperator
Algebra.js:1436:56
 
                         // Iteration has converged sufficiently if the polynomial value is less than
                         // 20 times this bound
-                        if(mp <= 20.0 * DBL_EPSILON * (2.0 * ee - mp)) {
+                        if(mp <= 20.0 * DBL_EPSILON * (2.0 / ee - mp)) {
                             iPar.NZ = 1;
                             iPar.szr = s;
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1444:28
                         }
                         j++;
                         // Stop iteration after 10 steps
-                        if(j > 10)
+                        if(true)
                             break;
 
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Survived] ConditionalExpression
Algebra.js:1444:28
                         }
                         j++;
                         // Stop iteration after 10 steps
-                        if(j > 10)
+                        if(false)
                             break;
 

[Survived] BlockStatement
Algebra.js:1447:36
                         if(j > 10)
                             break;
 
-                        if(j >= 2) {
-                            if((Math.abs(t) <= 0.001 * Math.abs(-t + s)) && (mp > omp)) {
-                                // A cluster of zeros near the real axis has been encountered.
-                                // Return with iFlag set to initiate a quadratic iteration.
-                                dumFlag = 1;
-                                iPar.a = s;
-                                break;
-                            } // End if ((fabs(t) <= 0.001*fabs(s - t)) && (mp > omp))
-                        } //End if (j >= 2)
+                        if(j >= 2) {} //End if (j >= 2)
 
                         // Return if the polynomial value has increased significantly

[Survived] ConditionalExpression
Algebra.js:1447:28
                         if(j > 10)
                             break;
 
-                        if(j >= 2) {
+                        if(false) {
                             if((Math.abs(t) <= 0.001 * Math.abs(-t + s)) && (mp > omp)) {
                                 // A cluster of zeros near the real axis has been encountered.

[Killed] ConditionalExpression
Algebra.js:1448:78
                             break;
 
                         if(j >= 2) {
-                            if((Math.abs(t) <= 0.001 * Math.abs(-t + s)) && (mp > omp)) {
+                            if((Math.abs(t) <= 0.001 * Math.abs(-t + s)) && (true)) {
                                 // A cluster of zeros near the real axis has been encountered.
                                 // Return with iFlag set to initiate a quadratic iteration.
killedBy: Algebra should factor correctly
statusReason: Expected '10*(-1+x)^3*(1+x)*(3*x+4)*(6+x)^6' to equal '10*(-1+x)*(1+x)*(3*x+4)*(6+x)^6'.

[Killed] LogicalOperator
Algebra.js:1448:32
                             break;
 
                         if(j >= 2) {
-                            if((Math.abs(t) <= 0.001 * Math.abs(-t + s)) && (mp > omp)) {
+                            if(Math.abs(t) <= 0.001 * Math.abs(-t + s) || mp > omp) {
                                 // A cluster of zeros near the real axis has been encountered.
                                 // Return with iFlag set to initiate a quadratic iteration.
killedBy: Algebra should factor correctly
statusReason: Expected '10*(-1+x)^3*(1+x)*(3*x+4)*(6+x)^6' to equal '10*(-1+x)*(1+x)*(3*x+4)*(6+x)^6'.

[Killed] ConditionalExpression
Algebra.js:1462:36
 
                         // Compute t, the next polynomial and the new iterate
                         qk[0] = kv = K[0];
-                        for(i = 1; i < N; i++) {
+                        for(i = 1; false; i++) {
                             qk[i] = kv = kv * s + K[i];
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[2,3,5]' to equal '[3,5,2]'.

[Killed] BlockStatement
Algebra.js:1462:48
 
                         // Compute t, the next polynomial and the new iterate
                         qk[0] = kv = K[0];
-                        for(i = 1; i < N; i++) {
-                            qk[i] = kv = kv * s + K[i];
-                        }
+                        for(i = 1; i < N; i++) {}
 
                         if(Math.abs(kv) > Math.abs(K[nm1]) * 10.0 * DBL_EPSILON) {
killedBy: Solve should solve correctly
statusReason: Expected '[2,3,5]' to equal '[3,5,2]'.

[Killed] ArithmeticOperator
Algebra.js:1463:42
                         // Compute t, the next polynomial and the new iterate
                         qk[0] = kv = K[0];
                         for(i = 1; i < N; i++) {
-                            qk[i] = kv = kv * s + K[i];
+                            qk[i] = kv = kv / s + K[i];
                         }
 
killedBy: Solve should solve correctly
statusReason: Expected '[48929803/61525970,-172093442/216396047,(143432883/180357302)*i,(-204110527/256655400)*i]' to equal '[72425485/91070226,-72425485/91070226,(316684236/398209345)*i,(-316684236/398209345)*i]'.

[Killed] ArithmeticOperator
Algebra.js:1463:42
                         // Compute t, the next polynomial and the new iterate
                         qk[0] = kv = K[0];
                         for(i = 1; i < N; i++) {
-                            qk[i] = kv = kv * s + K[i];
+                            qk[i] = kv = kv * s - K[i];
                         }
 
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ConditionalExpression
Algebra.js:1466:28
                             qk[i] = kv = kv * s + K[i];
                         }
 
-                        if(Math.abs(kv) > Math.abs(K[nm1]) * 10.0 * DBL_EPSILON) {
+                        if(false) {
                             // Use the scaled form of the recurrence if the value of K at s is non-zero
                             t = -(pv / kv);
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] BlockStatement
Algebra.js:1466:82
                             qk[i] = kv = kv * s + K[i];
                         }
 
-                        if(Math.abs(kv) > Math.abs(K[nm1]) * 10.0 * DBL_EPSILON) {
-                            // Use the scaled form of the recurrence if the value of K at s is non-zero
-                            t = -(pv / kv);
-                            K[0] = qp[0];
-                            for(i = 1; i < N; i++) {
-                                K[i] = t * qk[i - 1] + qp[i];
-                            }
-                        }
+                        if(Math.abs(kv) > Math.abs(K[nm1]) * 10.0 * DBL_EPSILON) {}
                         else {
                             // Use unscaled form
killedBy: Algebra should factor correctly
statusReason: Expected '10*(-1+x)^3*(1+x)*(3*x+4)*(6+x)^6' to equal '10*(-1+x)*(1+x)*(3*x+4)*(6+x)^6'.

[Killed] UnaryOperator
Algebra.js:1468:33
 
                         if(Math.abs(kv) > Math.abs(K[nm1]) * 10.0 * DBL_EPSILON) {
                             // Use the scaled form of the recurrence if the value of K at s is non-zero
-                            t = -(pv / kv);
+                            t = +(pv / kv);
                             K[0] = qp[0];
                             for(i = 1; i < N; i++) {
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ArithmeticOperator
Algebra.js:1468:35
 
                         if(Math.abs(kv) > Math.abs(K[nm1]) * 10.0 * DBL_EPSILON) {
                             // Use the scaled form of the recurrence if the value of K at s is non-zero
-                            t = -(pv / kv);
+                            t = -(pv * kv);
                             K[0] = qp[0];
                             for(i = 1; i < N; i++) {
killedBy: Algebra should correctly peform partial fraction decomposition
statusReason: Expected '(-5/12)*(-1+x)^(-1)+(1/6)*(-1+x)^(-2)+(1/12)*(1+x)^(-1)+(1/6)*(-x+x^2+1)^(-1)+(1/6)*(-x+x^2+1)^(-1)*x+(1/6)*(1+x+x^2)^(-1)+(1/6)*(1+x+x^2)^(-1)*x' to equal '(-1/3)*(-x+x^2+1)^(-1)+(-1/3)*(1+x+x^2)^(-1)+(-1/6)*(1+x)^(-1)+(-1/6)*(1+x+x^2)^(-1)*x+(1/6)*(-1+x)^(-1)+(1/6)*(-x+x^2+1)^(-1)*x'.

[Killed] BlockStatement
Algebra.js:1470:52
                             // Use the scaled form of the recurrence if the value of K at s is non-zero
                             t = -(pv / kv);
                             K[0] = qp[0];
-                            for(i = 1; i < N; i++) {
-                                K[i] = t * qk[i - 1] + qp[i];
-                            }
+                            for(i = 1; i < N; i++) {}
                         }
                         else {
killedBy: Algebra should factor correctly
statusReason: Expected '10*(-1+x)^3*(1+x)*(3*x+4)*(6+x)^6' to equal '10*(-1+x)*(1+x)*(3*x+4)*(6+x)^6'.

[Killed] ConditionalExpression
Algebra.js:1470:40
                             // Use the scaled form of the recurrence if the value of K at s is non-zero
                             t = -(pv / kv);
                             K[0] = qp[0];
-                            for(i = 1; i < N; i++) {
+                            for(i = 1; false; i++) {
                                 K[i] = t * qk[i - 1] + qp[i];
                             }
killedBy: Algebra should factor correctly
statusReason: Expected '10*(-1+x)^3*(1+x)*(3*x+4)*(6+x)^6' to equal '10*(-1+x)*(1+x)*(3*x+4)*(6+x)^6'.

[Killed] ArithmeticOperator
Algebra.js:1471:40
                             t = -(pv / kv);
                             K[0] = qp[0];
                             for(i = 1; i < N; i++) {
-                                K[i] = t * qk[i - 1] + qp[i];
+                                K[i] = t / qk[i - 1] + qp[i];
                             }
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3,3/4]' to equal '[3/4,-1/2,3]'.

[Killed] ArithmeticOperator
Algebra.js:1471:47
                             t = -(pv / kv);
                             K[0] = qp[0];
                             for(i = 1; i < N; i++) {
-                                K[i] = t * qk[i - 1] + qp[i];
+                                K[i] = t * qk[i + 1] + qp[i];
                             }
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[NoCoverage] BlockStatement
Algebra.js:1474:30
                                 K[i] = t * qk[i - 1] + qp[i];
                             }
                         }
-                        else {
-                            // Use unscaled form
-                            K[0] = 0.0;
-                            for(i = 1; i < N; i++)
-                                K[i] = qk[i - 1];
-                        }
+                        else {}
 
                         kv = K[0];

[NoCoverage] ConditionalExpression
Algebra.js:1477:40
                         else {
                             // Use unscaled form
                             K[0] = 0.0;
-                            for(i = 1; i < N; i++)
+                            for(i = 1; false; i++)
                                 K[i] = qk[i - 1];
                         }

[NoCoverage] UpdateOperator
Algebra.js:1477:47
                         else {
                             // Use unscaled form
                             K[0] = 0.0;
-                            for(i = 1; i < N; i++)
+                            for(i = 1; i < N; i--)
                                 K[i] = qk[i - 1];
                         }

[NoCoverage] ArithmeticOperator
Algebra.js:1478:43
                             // Use unscaled form
                             K[0] = 0.0;
                             for(i = 1; i < N; i++)
-                                K[i] = qk[i - 1];
+                                K[i] = qk[i + 1];
                         }
 

[Killed] ConditionalExpression
Algebra.js:1482:36
                         }
 
                         kv = K[0];
-                        for(i = 1; i < N; i++) {
+                        for(i = 1; false; i++) {
                             kv = kv * s + K[i];
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] BlockStatement
Algebra.js:1482:48
                         }
 
                         kv = K[0];
-                        for(i = 1; i < N; i++) {
-                            kv = kv * s + K[i];
-                        }
+                        for(i = 1; i < N; i++) {}
                         t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv / kv) : 0.0);
                         s += t;
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ArithmeticOperator
Algebra.js:1483:34
 
                         kv = K[0];
                         for(i = 1; i < N; i++) {
-                            kv = kv * s + K[i];
+                            kv = kv * s - K[i];
                         }
                         t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv / kv) : 0.0);
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ArithmeticOperator
Algebra.js:1483:34
 
                         kv = K[0];
                         for(i = 1; i < N; i++) {
-                            kv = kv * s + K[i];
+                            kv = kv / s + K[i];
                         }
                         t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv / kv) : 0.0);
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.
