[Killed] UnaryOperator
Algebra.js:1485:89
                         for(i = 1; i < N; i++) {
                             kv = kv * s + K[i];
                         }
-                        t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv / kv) : 0.0);
+                        t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? +(pv / kv) : 0.0);
                         s += t;
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ArithmeticOperator
Algebra.js:1485:91
                         for(i = 1; i < N; i++) {
                             kv = kv * s + K[i];
                         }
-                        t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv / kv) : 0.0);
+                        t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv * kv) : 0.0);
                         s += t;
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] AssignmentOperator
Algebra.js:1486:25
                             kv = kv * s + K[i];
                         }
                         t = ((Math.abs(kv) > (Math.abs(K[nm1]) * 10.0 * DBL_EPSILON)) ? -(pv / kv) : 0.0);
-                        s += t;
+                        s -= t;
                     }
                     return dumFlag;
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1521:32
                     calcPar.h = calcPar.g = calcPar.f = calcPar.e = calcPar.d = calcPar.c = calcPar.a7 = calcPar.a3 = calcPar.a1 = 0.0;
                     tFlag = calcSC_ak1(DBL_EPSILON, N, a, b, calcPar, K, u, v, qk);
 
-                    for(j = 0; j < L2; j++) {
+                    for(j = 0; false; j++) {
                         fflag = 1;
 
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Timeout] UpdateOperator
Algebra.js:1521:40
                     calcPar.h = calcPar.g = calcPar.f = calcPar.e = calcPar.d = calcPar.c = calcPar.a7 = calcPar.a3 = calcPar.a1 = 0.0;
                     tFlag = calcSC_ak1(DBL_EPSILON, N, a, b, calcPar, K, u, v, qk);
 
-                    for(j = 0; j < L2; j++) {
+                    for(j = 0; j < L2; j--) {
                         fflag = 1;
 

[Killed] ArithmeticOperator
Algebra.js:1535:53
                         vv = vi = sdPar.b;
 
                         // Estimate s
-                        ss = ((K[N - 1] != 0.0) ? -(p[N] / K[N - 1]) : 0.0);
+                        ss = ((K[N - 1] != 0.0) ? -(p[N] * K[N - 1]) : 0.0);
                         ts = tv = 1.0;
 
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1535:32
                         vv = vi = sdPar.b;
 
                         // Estimate s
-                        ss = ((K[N - 1] != 0.0) ? -(p[N] / K[N - 1]) : 0.0);
+                        ss = ((false) ? -(p[N] / K[N - 1]) : 0.0);
                         ts = tv = 1.0;
 
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1538:29
                         ss = ((K[N - 1] != 0.0) ? -(p[N] / K[N - 1]) : 0.0);
                         ts = tv = 1.0;
 
-                        if((j != 0) && (tFlag != 3)) {
+                        if((true) && (tFlag != 3)) {
                             // Compute relative measures of convergence of s and v sequences
                             tv = ((vv != 0.0) ? Math.abs((vv - ovv) / vv) : tv);
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ConditionalExpression
Algebra.js:1538:28
                         ss = ((K[N - 1] != 0.0) ? -(p[N] / K[N - 1]) : 0.0);
                         ts = tv = 1.0;
 
-                        if((j != 0) && (tFlag != 3)) {
+                        if(true) {
                             // Compute relative measures of convergence of s and v sequences
                             tv = ((vv != 0.0) ? Math.abs((vv - ovv) / vv) : tv);
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ArithmeticOperator
Algebra.js:1540:58
 
                         if((j != 0) && (tFlag != 3)) {
                             // Compute relative measures of convergence of s and v sequences
-                            tv = ((vv != 0.0) ? Math.abs((vv - ovv) / vv) : tv);
+                            tv = ((vv != 0.0) ? Math.abs((vv - ovv) * vv) : tv);
                             ts = ((ss != 0.0) ? Math.abs((ss - oss) / ss) : ts);
 
killedBy: Solve should solve correctly
statusReason: Expected '[-143172707/180030148,(316684236/398209345)*i,(-316684236/398209345)*i,143172707/180030148]' to equal '[72425485/91070226,-72425485/91070226,(316684236/398209345)*i,(-316684236/398209345)*i]'.

[Timeout] ConditionalExpression
Algebra.js:1540:36
 
                         if((j != 0) && (tFlag != 3)) {
                             // Compute relative measures of convergence of s and v sequences
-                            tv = ((vv != 0.0) ? Math.abs((vv - ovv) / vv) : tv);
+                            tv = ((false) ? Math.abs((vv - ovv) / vv) : tv);
                             ts = ((ss != 0.0) ? Math.abs((ss - oss) / ss) : ts);
 

[Killed] ArithmeticOperator
Algebra.js:1541:58
                         if((j != 0) && (tFlag != 3)) {
                             // Compute relative measures of convergence of s and v sequences
                             tv = ((vv != 0.0) ? Math.abs((vv - ovv) / vv) : tv);
-                            ts = ((ss != 0.0) ? Math.abs((ss - oss) / ss) : ts);
+                            ts = ((ss != 0.0) ? Math.abs((ss - oss) * ss) : ts);
 
                             // If decreasing, multiply the two most recent convergence measures
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ArithmeticOperator
Algebra.js:1541:59
                         if((j != 0) && (tFlag != 3)) {
                             // Compute relative measures of convergence of s and v sequences
                             tv = ((vv != 0.0) ? Math.abs((vv - ovv) / vv) : tv);
-                            ts = ((ss != 0.0) ? Math.abs((ss - oss) / ss) : ts);
+                            ts = ((ss != 0.0) ? Math.abs((ss + oss) / ss) : ts);
 
                             // If decreasing, multiply the two most recent convergence measures
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1544:37
                             ts = ((ss != 0.0) ? Math.abs((ss - oss) / ss) : ts);
 
                             // If decreasing, multiply the two most recent convergence measures
-                            tvv = ((tv < otv) ? tv * otv : 1.0);
+                            tvv = ((true) ? tv * otv : 1.0);
                             tss = ((ts < ots) ? ts * ots : 1.0);
 
killedBy: Solve should solve correctly
statusReason: Expected '[-1,1,i,-i]' to equal '[1,-1,i,-i]'.

[Killed] ArithmeticOperator
Algebra.js:1544:49
                             ts = ((ss != 0.0) ? Math.abs((ss - oss) / ss) : ts);
 
                             // If decreasing, multiply the two most recent convergence measures
-                            tvv = ((tv < otv) ? tv * otv : 1.0);
+                            tvv = ((tv < otv) ? tv / otv : 1.0);
                             tss = ((ts < ots) ? ts * ots : 1.0);
 
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1545:37
 
                             // If decreasing, multiply the two most recent convergence measures
                             tvv = ((tv < otv) ? tv * otv : 1.0);
-                            tss = ((ts < ots) ? ts * ots : 1.0);
+                            tss = ((false) ? ts * ots : 1.0);
 
                             // Compare with convergence criteria
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ArithmeticOperator
Algebra.js:1545:49
 
                             // If decreasing, multiply the two most recent convergence measures
                             tvv = ((tv < otv) ? tv * otv : 1.0);
-                            tss = ((ts < ots) ? ts * ots : 1.0);
+                            tss = ((ts < ots) ? ts / ots : 1.0);
 
                             // Compare with convergence criteria
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ConditionalExpression
Algebra.js:1548:39
                             tss = ((ts < ots) ? ts * ots : 1.0);
 
                             // Compare with convergence criteria
-                            vpass = ((tvv < betav) ? 1 : 0);
+                            vpass = ((true) ? 1 : 0);
                             spass = ((tss < betas) ? 1 : 0);
 
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Timeout] ConditionalExpression
Algebra.js:1548:39
                             tss = ((ts < ots) ? ts * ots : 1.0);
 
                             // Compare with convergence criteria
-                            vpass = ((tvv < betav) ? 1 : 0);
+                            vpass = ((false) ? 1 : 0);
                             spass = ((tss < betas) ? 1 : 0);
 

[Killed] ConditionalExpression
Algebra.js:1549:39
 
                             // Compare with convergence criteria
                             vpass = ((tvv < betav) ? 1 : 0);
-                            spass = ((tss < betas) ? 1 : 0);
+                            spass = ((true) ? 1 : 0);
 
                             if((spass) || (vpass)) {
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1549:39
 
                             // Compare with convergence criteria
                             vpass = ((tvv < betav) ? 1 : 0);
-                            spass = ((tss < betas) ? 1 : 0);
+                            spass = ((false) ? 1 : 0);
 
                             if((spass) || (vpass)) {
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] LogicalOperator
Algebra.js:1551:32
                             vpass = ((tvv < betav) ? 1 : 0);
                             spass = ((tss < betas) ? 1 : 0);
 
-                            if((spass) || (vpass)) {
+                            if(spass && vpass) {
 
                                 // At least one sequence has passed the convergence test.
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)*(1+x^2)*(1+x)^3*(1+x^2)^2*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ConditionalExpression
Algebra.js:1551:32
                             vpass = ((tvv < betav) ? 1 : 0);
                             spass = ((tss < betas) ? 1 : 0);
 
-                            if((spass) || (vpass)) {
+                            if(false) {
 
                                 // At least one sequence has passed the convergence test.
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:1556:56
                                 // At least one sequence has passed the convergence test.
                                 // Store variables before iterating
 
-                                for(i = 0; i < N; i++) {
-                                    svk[i] = K[i];
-                                }
+                                for(i = 0; i < N; i++) {}
                                 s = ss;
 
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1556:44
                                 // At least one sequence has passed the convergence test.
                                 // Store variables before iterating
 
-                                for(i = 0; i < N; i++) {
+                                for(i = 0; false; i++) {
                                     svk[i] = K[i];
                                 }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1566:74
                                 stry = vtry = 0;
 
                                 for(; ; ) {
-                                    if((fflag && ((fflag = 0) == 0)) && ((spass) && (!vpass || (tss < tvv)))) {
+                                    if((fflag && ((fflag = 0) == 0)) && (true)) {
                                         ;// Do nothing. Provides a quick "short circuit".
                                     }
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ConditionalExpression
Algebra.js:1566:40
                                 stry = vtry = 0;
 
                                 for(; ; ) {
-                                    if((fflag && ((fflag = 0) == 0)) && ((spass) && (!vpass || (tss < tvv)))) {
+                                    if(false) {
                                         ;// Do nothing. Provides a quick "short circuit".
                                     }
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Timeout] BlockStatement
Algebra.js:1569:42
                                     if((fflag && ((fflag = 0) == 0)) && ((spass) && (!vpass || (tss < tvv)))) {
                                         ;// Do nothing. Provides a quick "short circuit".
                                     }
-                                    else {
-                                        QuadIT_ak1(DBL_EPSILON, N, iPar, ui, vi, qp, NN, sdPar, p, qk, calcPar, K);
-                                        a = sdPar.a;
-                                        b = sdPar.b;
-
-                                        if((iPar.NZ) > 0)
-                                            return;
-
-                                        // Quadratic iteration has failed. Flag that it has been tried and decrease the
-                                        // convergence criterion
-                                        iFlag = vtry = 1;
-                                        betav *= 0.25;
-
-                                        // Try linear iteration if it has not been tried and the s sequence is converging
-                                        if(stry || (!spass)) {
-                                            iFlag = 0;
-                                        }
-                                        else {
-                                            for(i = 0; i < N; i++)
-                                                K[i] = svk[i];
-                                        }
-                                    }
+                                    else {}
                                     //fflag = 0;
                                     if(iFlag != 0) {

[Killed] ConditionalExpression
Algebra.js:1574:44
                                         a = sdPar.a;
                                         b = sdPar.b;
 
-                                        if((iPar.NZ) > 0)
+                                        if(false)
                                             return;
 
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)*(1+x)*(-1+x)^7*(1+x)^5*(1+x^2)^4*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] ConditionalExpression
Algebra.js:1574:44
                                         a = sdPar.a;
                                         b = sdPar.b;
 
-                                        if((iPar.NZ) > 0)
+                                        if(true)
                                             return;
 
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Survived] AssignmentOperator
Algebra.js:1580:41
                                         // Quadratic iteration has failed. Flag that it has been tried and decrease the
                                         // convergence criterion
                                         iFlag = vtry = 1;
-                                        betav *= 0.25;
+                                        betav /= 0.25;
 
                                         // Try linear iteration if it has not been tried and the s sequence is converging

[Killed] ConditionalExpression
Algebra.js:1583:44
                                         betav *= 0.25;
 
                                         // Try linear iteration if it has not been tried and the s sequence is converging
-                                        if(stry || (!spass)) {
+                                        if(true) {
                                             iFlag = 0;
                                         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Killed] ConditionalExpression
Algebra.js:1583:44
                                         betav *= 0.25;
 
                                         // Try linear iteration if it has not been tried and the s sequence is converging
-                                        if(stry || (!spass)) {
+                                        if(false) {
                                             iFlag = 0;
                                         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Survived] BlockStatement
Algebra.js:1586:46
                                         if(stry || (!spass)) {
                                             iFlag = 0;
                                         }
-                                        else {
-                                            for(i = 0; i < N; i++)
-                                                K[i] = svk[i];
-                                        }
+                                        else {}
                                     }
                                     //fflag = 0;

[Timeout] UpdateOperator
Algebra.js:1587:63
                                             iFlag = 0;
                                         }
                                         else {
-                                            for(i = 0; i < N; i++)
+                                            for(i = 0; i < N; i--)
                                                 K[i] = svk[i];
                                         }

[Survived] ConditionalExpression
Algebra.js:1587:56
                                             iFlag = 0;
                                         }
                                         else {
-                                            for(i = 0; i < N; i++)
+                                            for(i = 0; false; i++)
                                                 K[i] = svk[i];
                                         }

[Killed] ConditionalExpression
Algebra.js:1592:40
                                         }
                                     }
                                     //fflag = 0;
-                                    if(iFlag != 0) {
+                                    if(false) {
                                         // Use sdPar for passing in s instead of defining a brand-new variable.
                                         // sdPar.a = s
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1592:40
                                         }
                                     }
                                     //fflag = 0;
-                                    if(iFlag != 0) {
+                                    if(true) {
                                         // Use sdPar for passing in s instead of defining a brand-new variable.
                                         // sdPar.a = s
killedBy: Solve should solve correctly
statusReason: Expected '[-1/2,3/4,3]' to equal '[3/4,-1/2,3]'.

[Survived] AssignmentOperator
Algebra.js:1605:41
                                         // Linear iteration has failed. Flag that it has been tried and decrease the
                                         // convergence criterion
                                         stry = 1;
-                                        betas *= 0.25;
+                                        betas /= 0.25;
 
                                         if(iFlag != 0) {

[NoCoverage] BlockStatement
Algebra.js:1607:56
                                         stry = 1;
                                         betas *= 0.25;
 
-                                        if(iFlag != 0) {
-                                            // If linear iteration signals an almost double real zero, attempt quadratic iteration
-                                            ui = -(s + s);
-                                            vi = s * s;
-                                            continue;
-
-                                        }
+                                        if(iFlag != 0) {}
                                     }
 

[Survived] ConditionalExpression
Algebra.js:1607:44
                                         stry = 1;
                                         betas *= 0.25;
 
-                                        if(iFlag != 0) {
+                                        if(true) {
                                             // If linear iteration signals an almost double real zero, attempt quadratic iteration
                                             ui = -(s + s);

[NoCoverage] ArithmeticOperator
Algebra.js:1609:52
 
                                         if(iFlag != 0) {
                                             // If linear iteration signals an almost double real zero, attempt quadratic iteration
-                                            ui = -(s + s);
+                                            ui = -(s - s);
                                             vi = s * s;
                                             continue;

[NoCoverage] UnaryOperator
Algebra.js:1609:50
 
                                         if(iFlag != 0) {
                                             // If linear iteration signals an almost double real zero, attempt quadratic iteration
-                                            ui = -(s + s);
+                                            ui = +(s + s);
                                             vi = s * s;
                                             continue;

[NoCoverage] ArithmeticOperator
Algebra.js:1610:50
                                         if(iFlag != 0) {
                                             // If linear iteration signals an almost double real zero, attempt quadratic iteration
                                             ui = -(s + s);
-                                            vi = s * s;
+                                            vi = s / s;
                                             continue;
 

[Survived] ConditionalExpression
Algebra.js:1617:48
                                     }
 
                                     // Restore variables
-                                    for(i = 0; i < N; i++)
+                                    for(i = 0; false; i++)
                                         K[i] = svk[i];
 

[Timeout] UpdateOperator
Algebra.js:1617:55
                                     }
 
                                     // Restore variables
-                                    for(i = 0; i < N; i++)
+                                    for(i = 0; i < N; i--)
                                         K[i] = svk[i];
 

[Timeout] ConditionalExpression
Algebra.js:1621:40
                                         K[i] = svk[i];
 
                                     // Try quadratic iteration if it has not been tried and the v sequence is converging
-                                    if(!vpass || vtry)
+                                    if(false)
                                         break;		// Break out of infinite for loop
 

[Timeout] LogicalOperator
Algebra.js:1621:40
                                         K[i] = svk[i];
 
                                     // Try quadratic iteration if it has not been tried and the v sequence is converging
-                                    if(!vpass || vtry)
+                                    if(!vpass && vtry)
                                         break;		// Break out of infinite for loop
 

[Killed] ArithmeticOperator
Algebra.js:1645:38
 
                 function rpSolve(degPar, p, zeror, zeroi) {
                     var N = degPar.Degree,
-                            RADFAC = 3.14159265358979323846 / 180, // Degrees-to-radians conversion factor = PI/180
+                            RADFAC = 3.14159265358979323846 * 180, // Degrees-to-radians conversion factor = PI/180
                             LB2 = Math.LN2, // Dummy variable to avoid re-calculating this value in loop below
                             MDP1 = degPar.Degree + 1,
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)^5*(1+x)^4*(1+x^2)^3*(1+x^4)^2*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Survived] ArithmeticOperator
Algebra.js:1647:36
                     var N = degPar.Degree,
                             RADFAC = 3.14159265358979323846 / 180, // Degrees-to-radians conversion factor = PI/180
                             LB2 = Math.LN2, // Dummy variable to avoid re-calculating this value in loop below
-                            MDP1 = degPar.Degree + 1,
+                            MDP1 = degPar.Degree - 1,
                             K = new Array(MDP1),
                             pt = new Array(MDP1),

[Survived] ArrayDeclaration
Algebra.js:1650:34
                             MDP1 = degPar.Degree + 1,
                             K = new Array(MDP1),
                             pt = new Array(MDP1),
-                            qp = new Array(MDP1),
+                            qp = new Array(),
                             temp = new Array(MDP1),
                             // qPar is a dummy variable for passing the four parameters--sr, si, lr, and li--by reference

[Killed] BlockStatement
Algebra.js:1663:24
                     // Calculate the machine epsilon and store in the variable DBL_EPSILON.
                     // To calculate this value, just use existing variables rather than create new ones that will be used only for this code block
                     aa = 1.0;
-                    do {
-                        DBL_EPSILON = aa;
-                        aa /= 2;
-                        bb = 1.0 + aa;
-                    }
+                    do {}
                     while(bb > 1.0);
 
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Timeout] AssignmentOperator
Algebra.js:1665:25
                     aa = 1.0;
                     do {
                         DBL_EPSILON = aa;
-                        aa /= 2;
+                        aa *= 2;
                         bb = 1.0 + aa;
                     }

[Killed] ArithmeticOperator
Algebra.js:1666:30
                     do {
                         DBL_EPSILON = aa;
                         aa /= 2;
-                        bb = 1.0 + aa;
+                        bb = 1.0 - aa;
                     }
                     while(bb > 1.0);
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:1668:27
                         aa /= 2;
                         bb = 1.0 + aa;
                     }
-                    while(bb > 1.0);
+                    while(false);
 
                     var LO = Number.MIN_VALUE / DBL_EPSILON,
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Timeout] ArithmeticOperator
Algebra.js:1670:30
                     }
                     while(bb > 1.0);
 
-                    var LO = Number.MIN_VALUE / DBL_EPSILON,
+                    var LO = Number.MIN_VALUE * DBL_EPSILON,
                             cosr = Math.cos(94.0 * RADFAC), // = -0.069756474
                             sinr = Math.sin(94.0 * RADFAC), // = 0.99756405
