[Killed] BlockStatement
Extra.js:255:76
                                                 retval = _.parse(format('(({1})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})', t, f2.a, f.a, f.b));
                                             }
                                             else {
-                                                if(a_has_sin && b_has_cos) {
-                                                    var sin, cos;
-                                                    sin = fn1.findFunction('sin');
-                                                    cos = fn2.findFunction('cos');
-                                                    //who has the s?
-                                                    if(sin.args[0].equals(cos.args[0]) && !sin.args[0].contains(s)) {
-                                                        var b, c, d, e;
-                                                        b = _.divide(fn2, cos.toUnitMultiplier()).toString();
-                                                        c = sin.args[0].toString();
-                                                        d = f.b;
-                                                        e = _.divide(fn1, sin.toUnitMultiplier());
-                                                        exp = '(({1})*({2})*cos({3})*sin(sqrt({4})*({0})))/sqrt({4})+({1})*sin({3})*({5})*cos(sqrt({4})*({0}))';
-                                                        retval = _.parse(format(exp, t, a, b, c, d, e));
-                                                    }
-                                                }
+                                                if(a_has_sin && b_has_cos) {}
                                             }
                                         }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(3*cos(1)+s*sin(1))*(9+s^2)^(-1),s,t)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] BooleanLiteral
Extra.js:260:91
                                                     sin = fn1.findFunction('sin');
                                                     cos = fn2.findFunction('cos');
                                                     //who has the s?
-                                                    if(sin.args[0].equals(cos.args[0]) && !sin.args[0].contains(s)) {
+                                                    if(sin.args[0].equals(cos.args[0]) && sin.args[0].contains(s)) {
                                                         var b, c, d, e;
                                                         b = _.divide(fn2, cos.toUnitMultiplier()).toString();
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(3*cos(1)+s*sin(1))*(9+s^2)^(-1),s,t)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] BlockStatement
Extra.js:260:117
                                                     sin = fn1.findFunction('sin');
                                                     cos = fn2.findFunction('cos');
                                                     //who has the s?
-                                                    if(sin.args[0].equals(cos.args[0]) && !sin.args[0].contains(s)) {
-                                                        var b, c, d, e;
-                                                        b = _.divide(fn2, cos.toUnitMultiplier()).toString();
-                                                        c = sin.args[0].toString();
-                                                        d = f.b;
-                                                        e = _.divide(fn1, sin.toUnitMultiplier());
-                                                        exp = '(({1})*({2})*cos({3})*sin(sqrt({4})*({0})))/sqrt({4})+({1})*sin({3})*({5})*cos(sqrt({4})*({0}))';
-                                                        retval = _.parse(format(exp, t, a, b, c, d, e));
-                                                    }
+                                                    if(sin.args[0].equals(cos.args[0]) && !sin.args[0].contains(s)) {}
                                                 }
                                             }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(3*cos(1)+s*sin(1))*(9+s^2)^(-1),s,t)' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] StringLiteral
Extra.js:266:63
                                                         c = sin.args[0].toString();
                                                         d = f.b;
                                                         e = _.divide(fn1, sin.toUnitMultiplier());
-                                                        exp = '(({1})*({2})*cos({3})*sin(sqrt({4})*({0})))/sqrt({4})+({1})*sin({3})*({5})*cos(sqrt({4})*({0}))';
+                                                        exp = "";
                                                         retval = _.parse(format(exp, t, a, b, c, d, e));
                                                     }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '0' to equal '5*cos(1)*sin(3*t)+5*cos(3*t)*sin(1)'.

[Killed] LogicalOperator
Extra.js:276:33
                                 }
                             }
                         }
-                        else if(f.x.power.num && f.x.power.num.equals(3) && f.x.power.den.equals(2) && num.contains('sqrt(pi)') && !num.contains(s) && num.isLinear()) {
+                        else if(f.x.power.num && f.x.power.num.equals(3) && f.x.power.den.equals(2) && num.contains('sqrt(pi)') || !num.contains(s) && num.isLinear()) {
                             var b = _.divide(num.clone(), _.parse('sqrt(pi)'));
                             retval = _.parse(format('(2*({2})*sqrt({0}))/({1})', t, f.a, b, num));
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(6/7)*sqrt(pi)^(-1)*sqrt(t)' to equal '(-3/14)*cos((1/7)*sqrt(7)*t)*t+(3/2)*sin((1/7)*sqrt(7)*t)*sqrt(7)^(-1)'.

[Killed] ConditionalExpression
Extra.js:276:33
                                 }
                             }
                         }
-                        else if(f.x.power.num && f.x.power.num.equals(3) && f.x.power.den.equals(2) && num.contains('sqrt(pi)') && !num.contains(s) && num.isLinear()) {
+                        else if(true) {
                             var b = _.divide(num.clone(), _.parse('sqrt(pi)'));
                             retval = _.parse(format('(2*({2})*sqrt({0}))/({1})', t, f.a, b, num));
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(6/7)*sqrt(pi)^(-1)*sqrt(t)' to equal '(-3/14)*cos((1/7)*sqrt(7)*t)*t+(3/2)*sin((1/7)*sqrt(7)*t)*sqrt(7)^(-1)'.

[Killed] StringLiteral
Extra.js:278:53
                         }
                         else if(f.x.power.num && f.x.power.num.equals(3) && f.x.power.den.equals(2) && num.contains('sqrt(pi)') && !num.contains(s) && num.isLinear()) {
                             var b = _.divide(num.clone(), _.parse('sqrt(pi)'));
-                            retval = _.parse(format('(2*({2})*sqrt({0}))/({1})', t, f.a, b, num));
+                            retval = _.parse(format("", t, f.a, b, num));
                         }
                         else if(den_p.equals(2) && f.x.power.equals(2)) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '0' to equal '(10/3)*sqrt(t)'.

[Killed] ConditionalExpression
Extra.js:280:33
                             var b = _.divide(num.clone(), _.parse('sqrt(pi)'));
                             retval = _.parse(format('(2*({2})*sqrt({0}))/({1})', t, f.a, b, num));
                         }
-                        else if(den_p.equals(2) && f.x.power.equals(2)) {
+                        else if(false) {
                             var a, d, exp;
                             if(!num.contains(s)) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '3*e^(-t)*t' to equal '(-3/14)*cos((1/7)*sqrt(7)*t)*t+(3/2)*sin((1/7)*sqrt(7)*t)*sqrt(7)^(-1)'.

[Killed] ConditionalExpression
Extra.js:280:33
                             var b = _.divide(num.clone(), _.parse('sqrt(pi)'));
                             retval = _.parse(format('(2*({2})*sqrt({0}))/({1})', t, f.a, b, num));
                         }
-                        else if(den_p.equals(2) && f.x.power.equals(2)) {
+                        else if(true) {
                             var a, d, exp;
                             if(!num.contains(s)) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Division by zero not allowed!: 81: 1

[Killed] BlockStatement
Extra.js:282:50
                         }
                         else if(den_p.equals(2) && f.x.power.equals(2)) {
                             var a, d, exp;
-                            if(!num.contains(s)) {
-                                a = _.divide(num, new Symbol(2));
-                                exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({3})*sqrt(({2})*({3})))-(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*({3}))';
-                                retval = _.parse(format(exp, t, a, f.a, f.b));
-                            }
+                            if(!num.contains(s)) {}
                             else {
                                 // Decompose the numerator to check value of s
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(3*(1+7*s^2)^(-2),s,t)' to equal '(-3/14)*cos((1/7)*sqrt(7)*t)*t+(3/2)*sin((1/7)*sqrt(7)*t)*sqrt(7)^(-1)'.

[Killed] ConditionalExpression
Extra.js:282:32
                         }
                         else if(den_p.equals(2) && f.x.power.equals(2)) {
                             var a, d, exp;
-                            if(!num.contains(s)) {
+                            if(true) {
                                 a = _.divide(num, new Symbol(2));
                                 exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({3})*sqrt(({2})*({3})))-(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*({3}))';
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(-5/8)*cos(2*t)*s*t+(5/16)*s*sin(2*t)' to equal '(5/4)*sin(2*t)*t'.

[Killed] BooleanLiteral
Extra.js:289:88
                             }
                             else {
                                 // Decompose the numerator to check value of s
-                                f2 = core.Utils.decompose_fn(_.expand(num.clone()), s, true);
+                                f2 = core.Utils.decompose_fn(_.expand(num.clone()), s, false);
                                 if(f2.x.isComposite()) {
                                     var s_terms = [];
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Cannot read property 'isComposite' of undefined: 1

[Killed] ConditionalExpression
Extra.js:290:36
                             else {
                                 // Decompose the numerator to check value of s
                                 f2 = core.Utils.decompose_fn(_.expand(num.clone()), s, true);
-                                if(f2.x.isComposite()) {
+                                if(true) {
                                     var s_terms = [];
                                     //first collect the factors e.g. (a)(bx)(cx^2+d)
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: ParseError: Cannot read property 'value' of undefined: 1

[Survived] ConditionalExpression
Extra.js:290:36
                             else {
                                 // Decompose the numerator to check value of s
                                 f2 = core.Utils.decompose_fn(_.expand(num.clone()), s, true);
-                                if(f2.x.isComposite()) {
+                                if(false) {
                                     var s_terms = [];
                                     //first collect the factors e.g. (a)(bx)(cx^2+d)

[NoCoverage] BlockStatement
Extra.js:293:83
                                 if(f2.x.isComposite()) {
                                     var s_terms = [];
                                     //first collect the factors e.g. (a)(bx)(cx^2+d)
-                                    var symbols = num.collectSymbols(function (x) {
-                                        x = Symbol.unwrapPARENS(x);
-                                        var t = core.Utils.decompose_fn(x, s, true);
-                                        t.symbol = x;
-                                        return t;
-                                    }).
+                                    var symbols = num.collectSymbols(function (x) {}).
                                             //then sort them by power hightest to lowest
                                             sort(function (a, b) {

[NoCoverage] MethodExpression
Extra.js:293:51
                                 if(f2.x.isComposite()) {
                                     var s_terms = [];
                                     //first collect the factors e.g. (a)(bx)(cx^2+d)
-                                    var symbols = num.collectSymbols(function (x) {
-                                        x = Symbol.unwrapPARENS(x);
-                                        var t = core.Utils.decompose_fn(x, s, true);
-                                        t.symbol = x;
-                                        return t;
-                                    }).
-                                            //then sort them by power hightest to lowest
-                                            sort(function (a, b) {
-                                                var p1, p2;
-                                                p1 = a.x.value !== s ? 0 : a.x.power;
-                                                p2 = b.x.value !== s ? 0 : b.x.power;
-                                                return p2 - p1;
-                                            });
+                                    var symbols = num.collectSymbols(function (x) {
+  x = Symbol.unwrapPARENS(x);
+  var t = core.Utils.decompose_fn(x, s, true);
+  t.symbol = x;
+  return t;
+});
                                     a = new Symbol(-1);
                                     // Grab only the ones which have s

[NoCoverage] BooleanLiteral
Extra.js:295:79
                                     //first collect the factors e.g. (a)(bx)(cx^2+d)
                                     var symbols = num.collectSymbols(function (x) {
                                         x = Symbol.unwrapPARENS(x);
-                                        var t = core.Utils.decompose_fn(x, s, true);
+                                        var t = core.Utils.decompose_fn(x, s, false);
                                         t.symbol = x;
                                         return t;

[NoCoverage] BlockStatement
Extra.js:300:66
                                         return t;
                                     }).
                                             //then sort them by power hightest to lowest
-                                            sort(function (a, b) {
-                                                var p1, p2;
-                                                p1 = a.x.value !== s ? 0 : a.x.power;
-                                                p2 = b.x.value !== s ? 0 : b.x.power;
-                                                return p2 - p1;
-                                            });
+                                            sort(function (a, b) {});
                                     a = new Symbol(-1);
                                     // Grab only the ones which have s

[NoCoverage] ConditionalExpression
Extra.js:302:54
                                             //then sort them by power hightest to lowest
                                             sort(function (a, b) {
                                                 var p1, p2;
-                                                p1 = a.x.value !== s ? 0 : a.x.power;
+                                                p1 = true ? 0 : a.x.power;
                                                 p2 = b.x.value !== s ? 0 : b.x.power;
                                                 return p2 - p1;

[NoCoverage] ConditionalExpression
Extra.js:302:54
                                             //then sort them by power hightest to lowest
                                             sort(function (a, b) {
                                                 var p1, p2;
-                                                p1 = a.x.value !== s ? 0 : a.x.power;
+                                                p1 = false ? 0 : a.x.power;
                                                 p2 = b.x.value !== s ? 0 : b.x.power;
                                                 return p2 - p1;

[NoCoverage] ConditionalExpression
Extra.js:303:54
                                             sort(function (a, b) {
                                                 var p1, p2;
                                                 p1 = a.x.value !== s ? 0 : a.x.power;
-                                                p2 = b.x.value !== s ? 0 : b.x.power;
+                                                p2 = true ? 0 : b.x.power;
                                                 return p2 - p1;
                                             });

[NoCoverage] ConditionalExpression
Extra.js:303:54
                                             sort(function (a, b) {
                                                 var p1, p2;
                                                 p1 = a.x.value !== s ? 0 : a.x.power;
-                                                p2 = b.x.value !== s ? 0 : b.x.power;
+                                                p2 = false ? 0 : b.x.power;
                                                 return p2 - p1;
                                             });

[NoCoverage] ArithmeticOperator
Extra.js:304:56
                                                 var p1, p2;
                                                 p1 = a.x.value !== s ? 0 : a.x.power;
                                                 p2 = b.x.value !== s ? 0 : b.x.power;
-                                                return p2 - p1;
+                                                return p2 + p1;
                                             });
                                     a = new Symbol(-1);

[NoCoverage] UnaryOperator
Extra.js:306:52
                                                 p2 = b.x.value !== s ? 0 : b.x.power;
                                                 return p2 - p1;
                                             });
-                                    a = new Symbol(-1);
+                                    a = new Symbol(+1);
                                     // Grab only the ones which have s
                                     for(var i = 0; i < symbols.length; i++) {

[NoCoverage] BlockStatement
Extra.js:308:77
                                             });
                                     a = new Symbol(-1);
                                     // Grab only the ones which have s
-                                    for(var i = 0; i < symbols.length; i++) {
-                                        var fc = symbols[i];
-                                        if(fc.x.value === s)
-                                            s_terms.push(fc);
-                                        else
-                                            a = _.multiply(a, fc.symbol);
-                                    }
+                                    for(var i = 0; i < symbols.length; i++) {}
                                     // The following 2 assumptions are made
                                     // 1. since the numerator was factored above then each s_term has a unique power

[NoCoverage] UpdateOperator
Extra.js:308:72
                                             });
                                     a = new Symbol(-1);
                                     // Grab only the ones which have s
-                                    for(var i = 0; i < symbols.length; i++) {
+                                    for(var i = 0; i < symbols.length; i--) {
                                         var fc = symbols[i];
                                         if(fc.x.value === s)

[NoCoverage] ConditionalExpression
Extra.js:310:44
                                     // Grab only the ones which have s
                                     for(var i = 0; i < symbols.length; i++) {
                                         var fc = symbols[i];
-                                        if(fc.x.value === s)
+                                        if(true)
                                             s_terms.push(fc);
                                         else

[NoCoverage] ConditionalExpression
Extra.js:310:44
                                     // Grab only the ones which have s
                                     for(var i = 0; i < symbols.length; i++) {
                                         var fc = symbols[i];
-                                        if(fc.x.value === s)
+                                        if(false)
                                             s_terms.push(fc);
                                         else

[NoCoverage] BooleanLiteral
Extra.js:320:130
                                     // 2. because the terms are sorted by descending powers then the first item 
                                     //    has the highest power
                                     // We can now check for the next type s(s^2-a^2)/(s^2+a^2)^2
-                                    if(s_terms[0].x.power.equals(2) && s_terms[1].x.power.equals(1) && s_terms[1].b.equals(0) && !s_terms[0].b.equals(0)) {
+                                    if(s_terms[0].x.power.equals(2) && s_terms[1].x.power.equals(1) && s_terms[1].b.equals(0) && s_terms[0].b.equals(0)) {
                                         b = s_terms[0].a.negate();
                                         exp = '-(({1})*({2})*({5})*({0})*sin((sqrt(({4})*({5}))*({0}))/({4})))/' +

[NoCoverage] LogicalOperator
Extra.js:320:40
                                     // 2. because the terms are sorted by descending powers then the first item 
                                     //    has the highest power
                                     // We can now check for the next type s(s^2-a^2)/(s^2+a^2)^2
-                                    if(s_terms[0].x.power.equals(2) && s_terms[1].x.power.equals(1) && s_terms[1].b.equals(0) && !s_terms[0].b.equals(0)) {
+                                    if(s_terms[0].x.power.equals(2) && s_terms[1].x.power.equals(1) || s_terms[1].b.equals(0) && !s_terms[0].b.equals(0)) {
                                         b = s_terms[0].a.negate();
                                         exp = '-(({1})*({2})*({5})*({0})*sin((sqrt(({4})*({5}))*({0}))/({4})))/' +

[NoCoverage] StringLiteral
Extra.js:322:47
                                     // We can now check for the next type s(s^2-a^2)/(s^2+a^2)^2
                                     if(s_terms[0].x.power.equals(2) && s_terms[1].x.power.equals(1) && s_terms[1].b.equals(0) && !s_terms[0].b.equals(0)) {
                                         b = s_terms[0].a.negate();
-                                        exp = '-(({1})*({2})*({5})*({0})*sin((sqrt(({4})*({5}))*({0}))/({4})))/' +
+                                        exp = "" +
                                                 '(2*({4})^2*sqrt(({4})*({5})))-(({1})*({3})*({0})*sin((sqrt(({4})*({5}))*({0}))/({4})))' +
                                                 '/(2*({4})*sqrt(({4})*({5})))+(({1})*({2})*cos((sqrt(({4})*({5}))*({0}))/({4})))/({4})^2';

[NoCoverage] StringLiteral
Extra.js:324:49
                                         b = s_terms[0].a.negate();
                                         exp = '-(({1})*({2})*({5})*({0})*sin((sqrt(({4})*({5}))*({0}))/({4})))/' +
                                                 '(2*({4})^2*sqrt(({4})*({5})))-(({1})*({3})*({0})*sin((sqrt(({4})*({5}))*({0}))/({4})))' +
-                                                '/(2*({4})*sqrt(({4})*({5})))+(({1})*({2})*cos((sqrt(({4})*({5}))*({0}))/({4})))/({4})^2';
+                                                "";
                                         retval = _.parse(format(exp, t, a, b, s_terms[0].b, f.a, f.b));
                                     }

[Killed] BlockStatement
Extra.js:328:38
                                         retval = _.parse(format(exp, t, a, b, s_terms[0].b, f.a, f.b));
                                     }
                                 }
-                                else {
-                                    if(f2.x.isLinear()) {
-                                        a = _.divide(f2.a, new Symbol(2));
-                                        exp = '(({1})*({0})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))';
-                                        retval = _.parse(format(exp, t, a, f.a, f.b));
-                                    }
-                                    else if(f2.x.power.equals(2)) {
-                                        if(f2.b.equals(0)) {
-                                            a = _.divide(f2.a, new Symbol(2));
-                                            exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
-                                            retval = _.parse(format(exp, t, a, f.a, f.b));
-                                        }
-                                        else {
-                                            a = _.divide(f2.a, new Symbol(2));
-                                            d = f2.b.negate();
-                                            exp = '-((({2})*({4})-2*({1})*({3}))*sin((sqrt(({2})*({3}))*({0}))/({2})))/(2*({2})*({3})*sqrt(({2})*({3})))+' +
-                                                    '(({4})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/(2*({2})*({3}))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
-                                            retval = _.parse(format(exp, t, a, f.a, f.b, d));
-
-                                        }
-                                    }
-                                }
+                                else {}
                             }
                         }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(4+s^2)^(-2)*s,s,t)' to equal '(5/4)*sin(2*t)*t'.

[Killed] BlockStatement
Extra.js:329:57
                                     }
                                 }
                                 else {
-                                    if(f2.x.isLinear()) {
-                                        a = _.divide(f2.a, new Symbol(2));
-                                        exp = '(({1})*({0})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))';
-                                        retval = _.parse(format(exp, t, a, f.a, f.b));
-                                    }
+                                    if(f2.x.isLinear()) {}
                                     else if(f2.x.power.equals(2)) {
                                         if(f2.b.equals(0)) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(5*(4+s^2)^(-2)*s,s,t)' to equal '(5/4)*sin(2*t)*t'.

[Killed] ConditionalExpression
Extra.js:329:40
                                     }
                                 }
                                 else {
-                                    if(f2.x.isLinear()) {
+                                    if(true) {
                                         a = _.divide(f2.a, new Symbol(2));
                                         exp = '(({1})*({0})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))';
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/8)*sin((1/2)*t)*t' to equal '(1/8)*sin((1/2)*t)+(5/16)*cos((1/2)*t)*t'.
