[Killed] BlockStatement
Algebra.js:2060:50
                 });
                 return [c, s];
             },
-            mix: function (o, include_negatives) {
-                var factors = keys(o);
-                var l = factors.length;
-                var m = [];//create a row which we'r going to be mixing
-                for(var i = 0; i < l; i++) {
-                    var factor = factors[i],
-                            p = o[factor];
-                    var ll = m.length;
-                    for(var j = 0; j < ll; j++) {
-                        var t = m[j] * factor;
-                        m.push(t);
-                        if(include_negatives)
-                            m.push(-t);
-                    }
-
-                    for(var j = 1; j <= p; j++)
-                        m.push(Math.pow(factor, j));
-                }
-                return m;
-            },
+            mix: function (o, include_negatives) {},
             //TODO: this method is to replace common factoring
             common: function (symbol, factors) {
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-13*x-x^2+2*x^3-6)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Survived] ArrayDeclaration
Algebra.js:2063:25
             mix: function (o, include_negatives) {
                 var factors = keys(o);
                 var l = factors.length;
-                var m = [];//create a row which we'r going to be mixing
+                var m = ["Stryker was here"];//create a row which we'r going to be mixing
                 for(var i = 0; i < l; i++) {
                     var factor = factors[i],

[Killed] ConditionalExpression
Algebra.js:2064:32
                 var factors = keys(o);
                 var l = factors.length;
                 var m = [];//create a row which we'r going to be mixing
-                for(var i = 0; i < l; i++) {
+                for(var i = 0; false; i++) {
                     var factor = factors[i],
                             p = o[factor];
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:2064:44
                 var factors = keys(o);
                 var l = factors.length;
                 var m = [];//create a row which we'r going to be mixing
-                for(var i = 0; i < l; i++) {
-                    var factor = factors[i],
-                            p = o[factor];
-                    var ll = m.length;
-                    for(var j = 0; j < ll; j++) {
-                        var t = m[j] * factor;
-                        m.push(t);
-                        if(include_negatives)
-                            m.push(-t);
-                    }
-
-                    for(var j = 1; j <= p; j++)
-                        m.push(Math.pow(factor, j));
-                }
+                for(var i = 0; i < l; i++) {}
                 return m;
             },
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:2068:49
                     var factor = factors[i],
                             p = o[factor];
                     var ll = m.length;
-                    for(var j = 0; j < ll; j++) {
-                        var t = m[j] * factor;
-                        m.push(t);
-                        if(include_negatives)
-                            m.push(-t);
-                    }
+                    for(var j = 0; j < ll; j++) {}
 
                     for(var j = 1; j <= p; j++)
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2068:36
                     var factor = factors[i],
                             p = o[factor];
                     var ll = m.length;
-                    for(var j = 0; j < ll; j++) {
+                    for(var j = 0; false; j++) {
                         var t = m[j] * factor;
                         m.push(t);
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ArithmeticOperator
Algebra.js:2069:33
                             p = o[factor];
                     var ll = m.length;
                     for(var j = 0; j < ll; j++) {
-                        var t = m[j] * factor;
+                        var t = m[j] / factor;
                         m.push(t);
                         if(include_negatives)
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Survived] ConditionalExpression
Algebra.js:2071:28
                     for(var j = 0; j < ll; j++) {
                         var t = m[j] * factor;
                         m.push(t);
-                        if(include_negatives)
+                        if(false)
                             m.push(-t);
                     }

[Survived] ConditionalExpression
Algebra.js:2071:28
                     for(var j = 0; j < ll; j++) {
                         var t = m[j] * factor;
                         m.push(t);
-                        if(include_negatives)
+                        if(true)
                             m.push(-t);
                     }

[Survived] UnaryOperator
Algebra.js:2072:36
                         var t = m[j] * factor;
                         m.push(t);
                         if(include_negatives)
-                            m.push(-t);
+                            m.push(+t);
                     }
 

[Killed] ConditionalExpression
Algebra.js:2075:36
                             m.push(-t);
                     }
 
-                    for(var j = 1; j <= p; j++)
+                    for(var j = 1; false; j++)
                         m.push(Math.pow(factor, j));
                 }
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Timeout] UpdateOperator
Algebra.js:2075:44
                             m.push(-t);
                     }
 
-                    for(var j = 1; j <= p; j++)
+                    for(var j = 1; j <= p; j--)
                         m.push(Math.pow(factor, j));
                 }

[Killed] ConditionalExpression
Algebra.js:2083:24
             //TODO: this method is to replace common factoring
             common: function (symbol, factors) {
                 try {
-                    if(symbol.group === CP) {
+                    if(false) {
                         //this may have the unfortunate side effect of expanding and factoring again
                         //to only end up with the same result. 
killedBy: Algebra should factor correctly
statusReason: Expected '2*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Survived] ConditionalExpression
Algebra.js:2083:24
             //TODO: this method is to replace common factoring
             common: function (symbol, factors) {
                 try {
-                    if(symbol.group === CP) {
+                    if(true) {
                         //this may have the unfortunate side effect of expanding and factoring again
                         //to only end up with the same result. 

[Survived] BooleanLiteral
Algebra.js:2089:64
                         //TODO: try to avoid this
                         //collect the symbols and sort to have the longest first. Thinking is that the longest terms 
                         //has to contain the variable in order for it to be factorable
-                        var symbols = _.expand(symbol.clone(), true).collectSymbols(null, null, function (a, b) {
+                        var symbols = _.expand(symbol.clone(), false).collectSymbols(null, null, function (a, b) {
                             return (b.length || 1) - (a.length || 1);
                         });

[Survived] BlockStatement
Algebra.js:2089:113
                         //TODO: try to avoid this
                         //collect the symbols and sort to have the longest first. Thinking is that the longest terms 
                         //has to contain the variable in order for it to be factorable
-                        var symbols = _.expand(symbol.clone(), true).collectSymbols(null, null, function (a, b) {
-                            return (b.length || 1) - (a.length || 1);
-                        });
+                        var symbols = _.expand(symbol.clone(), true).collectSymbols(null, null, function (a, b) {});
 
                         var map = {}; //create a map of common factors

[Survived] LogicalOperator
Algebra.js:2090:55
                         //collect the symbols and sort to have the longest first. Thinking is that the longest terms 
                         //has to contain the variable in order for it to be factorable
                         var symbols = _.expand(symbol.clone(), true).collectSymbols(null, null, function (a, b) {
-                            return (b.length || 1) - (a.length || 1);
+                            return (b.length || 1) - (a.length && 1);
                         });
 

[Survived] ConditionalExpression
Algebra.js:2090:55
                         //collect the symbols and sort to have the longest first. Thinking is that the longest terms 
                         //has to contain the variable in order for it to be factorable
                         var symbols = _.expand(symbol.clone(), true).collectSymbols(null, null, function (a, b) {
-                            return (b.length || 1) - (a.length || 1);
+                            return (b.length || 1) - (false);
                         });
 

[Killed] BlockStatement
Algebra.js:2095:65
 
                         var map = {}; //create a map of common factors
                         var coeffs = [];
-                        for(var i = 0; i < symbols.length; i++) {
-                            var sym = symbols[i];
-                            coeffs.push(sym.multiplier.clone());
-                            sym.each(function (x) {
-                                var p = Number(x.power);
-                                //This check exits since we have a symbolic power.
-                                //For the future... think about removing this check and modify for symbolic powers
-                                if(isNaN(p))
-                                    throw new Error('exiting');
-                                //loop through the symbols and lump together common terms
-                                if(x.value in map) {
-                                    if(p < map[x.value][0])
-                                        map[x.value][0] = p;
-                                    map[x.value][1].push(x);
-                                }
-                                else
-                                    map[x.value] = [p, [x]];
-                            });
-                        }
+                        for(var i = 0; i < symbols.length; i++) {}
                         //the factor
                         var factor = new Symbol(1);
killedBy: Algebra should factor correctly
statusReason: Expected '2*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] UpdateOperator
Algebra.js:2095:60
 
                         var map = {}; //create a map of common factors
                         var coeffs = [];
-                        for(var i = 0; i < symbols.length; i++) {
+                        for(var i = 0; i < symbols.length; i--) {
                             var sym = symbols[i];
                             coeffs.push(sym.multiplier.clone());
killedBy: Algebra should factor correctly
statusReason: Expected '2*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] BlockStatement
Algebra.js:2098:51
                         for(var i = 0; i < symbols.length; i++) {
                             var sym = symbols[i];
                             coeffs.push(sym.multiplier.clone());
-                            sym.each(function (x) {
-                                var p = Number(x.power);
-                                //This check exits since we have a symbolic power.
-                                //For the future... think about removing this check and modify for symbolic powers
-                                if(isNaN(p))
-                                    throw new Error('exiting');
-                                //loop through the symbols and lump together common terms
-                                if(x.value in map) {
-                                    if(p < map[x.value][0])
-                                        map[x.value][0] = p;
-                                    map[x.value][1].push(x);
-                                }
-                                else
-                                    map[x.value] = [p, [x]];
-                            });
+                            sym.each(function (x) {});
                         }
                         //the factor
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ConditionalExpression
Algebra.js:2102:36
                                 var p = Number(x.power);
                                 //This check exits since we have a symbolic power.
                                 //For the future... think about removing this check and modify for symbolic powers
-                                if(isNaN(p))
+                                if(true)
                                     throw new Error('exiting');
                                 //loop through the symbols and lump together common terms
killedBy: Algebra should factor correctly
statusReason: Expected '2*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Survived] ConditionalExpression
Algebra.js:2102:36
                                 var p = Number(x.power);
                                 //This check exits since we have a symbolic power.
                                 //For the future... think about removing this check and modify for symbolic powers
-                                if(isNaN(p))
+                                if(false)
                                     throw new Error('exiting');
                                 //loop through the symbols and lump together common terms

[Killed] ConditionalExpression
Algebra.js:2105:36
                                 if(isNaN(p))
                                     throw new Error('exiting');
                                 //loop through the symbols and lump together common terms
-                                if(x.value in map) {
+                                if(false) {
                                     if(p < map[x.value][0])
                                         map[x.value][0] = p;
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] BlockStatement
Algebra.js:2105:52
                                 if(isNaN(p))
                                     throw new Error('exiting');
                                 //loop through the symbols and lump together common terms
-                                if(x.value in map) {
-                                    if(p < map[x.value][0])
-                                        map[x.value][0] = p;
-                                    map[x.value][1].push(x);
-                                }
+                                if(x.value in map) {}
                                 else
                                     map[x.value] = [p, [x]];
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Survived] ConditionalExpression
Algebra.js:2106:40
                                     throw new Error('exiting');
                                 //loop through the symbols and lump together common terms
                                 if(x.value in map) {
-                                    if(p < map[x.value][0])
+                                    if(false)
                                         map[x.value][0] = p;
                                     map[x.value][1].push(x);

[Survived] ConditionalExpression
Algebra.js:2106:40
                                     throw new Error('exiting');
                                 //loop through the symbols and lump together common terms
                                 if(x.value in map) {
-                                    if(p < map[x.value][0])
+                                    if(true)
                                         map[x.value][0] = p;
                                     map[x.value][1].push(x);

[Killed] ArrayDeclaration
Algebra.js:2111:56
                                     map[x.value][1].push(x);
                                 }
                                 else
-                                    map[x.value] = [p, [x]];
+                                    map[x.value] = [p, []];
                             });
                         }
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ArrayDeclaration
Algebra.js:2111:52
                                     map[x.value][1].push(x);
                                 }
                                 else
-                                    map[x.value] = [p, [x]];
+                                    map[x.value] = [];
                             });
                         }
killedBy: Algebra should factor correctly
statusReason: Expected '2*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] BlockStatement
Algebra.js:2116:43
                         }
                         //the factor
                         var factor = new Symbol(1);
-                        for(var x in map) {
-                            //if this factor is found in all terms since the length of 
-                            //matching variable terms matches the number of original terms
-                            if(map[x][1].length === symbols.length) {
-                                //generate a symbol and multiply into the factor
-                                factor = _.multiply(factor, _.pow(new Symbol(x), new Symbol(map[x][0])));
-                            }
-                        }
+                        for(var x in map) {}
                         //get coefficient factor
                         var c = core.Math2.QGCD.apply(null, coeffs);
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ConditionalExpression
Algebra.js:2119:32
                         for(var x in map) {
                             //if this factor is found in all terms since the length of 
                             //matching variable terms matches the number of original terms
-                            if(map[x][1].length === symbols.length) {
+                            if(false) {
                                 //generate a symbol and multiply into the factor
                                 factor = _.multiply(factor, _.pow(new Symbol(x), new Symbol(map[x][0])));
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ConditionalExpression
Algebra.js:2119:32
                         for(var x in map) {
                             //if this factor is found in all terms since the length of 
                             //matching variable terms matches the number of original terms
-                            if(map[x][1].length === symbols.length) {
+                            if(true) {
                                 //generate a symbol and multiply into the factor
                                 factor = _.multiply(factor, _.pow(new Symbol(x), new Symbol(map[x][0])));
killedBy: Algebra should factor correctly
statusReason: Expected '2*abs(x)*sqrt(1+y^(-1))*sqrt(y)' to equal '2*abs(x)*sqrt(1+y)'.

[Survived] ConditionalExpression
Algebra.js:2127:28
                         //get coefficient factor
                         var c = core.Math2.QGCD.apply(null, coeffs);
 
-                        if(!c.equals(1)) {
+                        if(false) {
                             factors.add(new Symbol(c));
                             for(var i = 0; i < symbols.length; i++) {

[Survived] BooleanLiteral
Algebra.js:2127:28
                         //get coefficient factor
                         var c = core.Math2.QGCD.apply(null, coeffs);
 
-                        if(!c.equals(1)) {
+                        if(c.equals(1)) {
                             factors.add(new Symbol(c));
                             for(var i = 0; i < symbols.length; i++) {

[Killed] UpdateOperator
Algebra.js:2129:64
 
                         if(!c.equals(1)) {
                             factors.add(new Symbol(c));
-                            for(var i = 0; i < symbols.length; i++) {
+                            for(var i = 0; i < symbols.length; i--) {
                                 symbols[i].multiplier = symbols[i].multiplier.divide(c);
                             }
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ConditionalExpression
Algebra.js:2129:44
 
                         if(!c.equals(1)) {
                             factors.add(new Symbol(c));
-                            for(var i = 0; i < symbols.length; i++) {
+                            for(var i = 0; false; i++) {
                                 symbols[i].multiplier = symbols[i].multiplier.divide(c);
                             }
killedBy: Algebra should factor correctly
statusReason: Expected '4*abs(x)*sqrt(1+y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] BlockStatement
Algebra.js:2135:47
                         }
 
                         //if we actuall found any factors
-                        if(!factor.equals(1)) {
-                            factors.add(factor);
-                            symbol = new Symbol(0);
-                            for(var i = 0; i < symbols.length; i++) {
-                                symbol = _.add(symbol, _.divide(symbols[i], factor.clone()));
-                            }
-                        }
+                        if(!factor.equals(1)) {}
                     }
                 }
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ConditionalExpression
Algebra.js:2135:28
                         }
 
                         //if we actuall found any factors
-                        if(!factor.equals(1)) {
+                        if(false) {
                             factors.add(factor);
                             symbol = new Symbol(0);
killedBy: Algebra should factor correctly
statusReason: Expected '4*sqrt(x^2+x^2*y)' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] BlockStatement
Algebra.js:2138:69
                         if(!factor.equals(1)) {
                             factors.add(factor);
                             symbol = new Symbol(0);
-                            for(var i = 0; i < symbols.length; i++) {
-                                symbol = _.add(symbol, _.divide(symbols[i], factor.clone()));
-                            }
+                            for(var i = 0; i < symbols.length; i++) {}
                         }
                     }
killedBy: Algebra should factor correctly
statusReason: Expected '1' to equal '2*abs(x)*sqrt(1+y)'.

[Killed] ConditionalExpression
Algebra.js:2138:44
                         if(!factor.equals(1)) {
                             factors.add(factor);
                             symbol = new Symbol(0);
-                            for(var i = 0; i < symbols.length; i++) {
+                            for(var i = 0; false; i++) {
                                 symbol = _.add(symbol, _.divide(symbols[i], factor.clone()));
                             }
killedBy: Algebra should factor correctly
statusReason: Expected '1' to equal '2*abs(x)*sqrt(1+y)'.

[NoCoverage] BlockStatement
Algebra.js:2144:26
                         }
                     }
                 }
-                catch(e) {
-                    ;
-                }
+                catch(e) {}
 
                 return symbol;

[Survived] BlockStatement
Algebra.js:2151:40
                 return symbol;
             },
             zeroes: function (symbol, factors) {
-                var exit = function () {
-                    throw new core.exceptions.ValueLimitExceededError('Exiting');
-                };
+                var exit = function () {};
                 try {
                     var vars, term, sum, p, e;

[Killed] ArrayDeclaration
Algebra.js:2163:34
                     sum = new Symbol(0);
 
                     var terms = [];
-                    var powers = [];
+                    var powers = ["Stryker was here"];
 
                     //start setting each variable to zero
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2166:53
                     var powers = [];
 
                     //start setting each variable to zero
-                    for(var i = 0, l = vars.length; i < vars.length; i++) {
+                    for(var i = 0, l = vars.length; false; i++) {
                         var subs = {};
                         //we want to create a subs object with all but the current variable set to zero
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] BlockStatement
Algebra.js:2166:75
                     var powers = [];
 
                     //start setting each variable to zero
-                    for(var i = 0, l = vars.length; i < vars.length; i++) {
-                        var subs = {};
-                        //we want to create a subs object with all but the current variable set to zero
-                        for(var j = 0; j < l; j++)
-                            if(i !== j) //make sure we're not looking at the same variable
-                                subs[vars[j]] = 0;
-                        term = _.parse(e, subs);
-                        var tp = term.power;
-                        //the temporary power has to be an integer as well
-                        if(!isInt(tp))
-                            exit();
-                        terms.push(term);
-                        powers.push(term.power);
-                    }
+                    for(var i = 0, l = vars.length; i < vars.length; i++) {}
 
                     //get the gcd. This will be the p in (a^n+b^m)^p
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2169:40
                     for(var i = 0, l = vars.length; i < vars.length; i++) {
                         var subs = {};
                         //we want to create a subs object with all but the current variable set to zero
-                        for(var j = 0; j < l; j++)
+                        for(var j = 0; false; j++)
                             if(i !== j) //make sure we're not looking at the same variable
                                 subs[vars[j]] = 0;
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-2*y+2*x)*(x+y)' to equal '(-y+x)*(x+y)'.

[Timeout] UpdateOperator
Algebra.js:2169:47
                     for(var i = 0, l = vars.length; i < vars.length; i++) {
                         var subs = {};
                         //we want to create a subs object with all but the current variable set to zero
-                        for(var j = 0; j < l; j++)
+                        for(var j = 0; j < l; j--)
                             if(i !== j) //make sure we're not looking at the same variable
                                 subs[vars[j]] = 0;

[Killed] ConditionalExpression
Algebra.js:2170:32
                         var subs = {};
                         //we want to create a subs object with all but the current variable set to zero
                         for(var j = 0; j < l; j++)
-                            if(i !== j) //make sure we're not looking at the same variable
+                            if(false) //make sure we're not looking at the same variable
                                 subs[vars[j]] = 0;
                         term = _.parse(e, subs);
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-2*y+2*x)*(x+y)' to equal '(-y+x)*(x+y)'.

[Killed] ConditionalExpression
Algebra.js:2170:32
                         var subs = {};
                         //we want to create a subs object with all but the current variable set to zero
                         for(var j = 0; j < l; j++)
-                            if(i !== j) //make sure we're not looking at the same variable
+                            if(true) //make sure we're not looking at the same variable
                                 subs[vars[j]] = 0;
                         term = _.parse(e, subs);
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.
