[Killed] BlockStatement
Extra.js:334:67
                                         exp = '(({1})*({0})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))';
                                         retval = _.parse(format(exp, t, a, f.a, f.b));
                                     }
-                                    else if(f2.x.power.equals(2)) {
-                                        if(f2.b.equals(0)) {
-                                            a = _.divide(f2.a, new Symbol(2));
-                                            exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
-                                            retval = _.parse(format(exp, t, a, f.a, f.b));
-                                        }
-                                        else {
-                                            a = _.divide(f2.a, new Symbol(2));
-                                            d = f2.b.negate();
-                                            exp = '-((({2})*({4})-2*({1})*({3}))*sin((sqrt(({2})*({3}))*({0}))/({2})))/(2*({2})*({3})*sqrt(({2})*({3})))+' +
-                                                    '(({4})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/(2*({2})*({3}))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
-                                            retval = _.parse(format(exp, t, a, f.a, f.b, d));
-
-                                        }
-                                    }
+                                    else if(f2.x.power.equals(2)) {}
                                 }
                             }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt((-1+6*s^2)*(1+4*s^2)^(-2),s,t)' to equal '(1/8)*sin((1/2)*t)+(5/16)*cos((1/2)*t)*t'.

[Killed] ConditionalExpression
Extra.js:334:45
                                         exp = '(({1})*({0})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))';
                                         retval = _.parse(format(exp, t, a, f.a, f.b));
                                     }
-                                    else if(f2.x.power.equals(2)) {
+                                    else if(false) {
                                         if(f2.b.equals(0)) {
                                             a = _.divide(f2.a, new Symbol(2));
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt((-1+6*s^2)*(1+4*s^2)^(-2),s,t)' to equal '(1/8)*sin((1/2)*t)+(5/16)*cos((1/2)*t)*t'.

[Killed] ConditionalExpression
Extra.js:335:44
                                         retval = _.parse(format(exp, t, a, f.a, f.b));
                                     }
                                     else if(f2.x.power.equals(2)) {
-                                        if(f2.b.equals(0)) {
+                                        if(true) {
                                             a = _.divide(f2.a, new Symbol(2));
                                             exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '(3/16)*cos((1/2)*t)*t+(3/8)*sin((1/2)*t)' to equal '(1/8)*sin((1/2)*t)+(5/16)*cos((1/2)*t)*t'.

[Survived] ConditionalExpression
Extra.js:335:44
                                         retval = _.parse(format(exp, t, a, f.a, f.b));
                                     }
                                     else if(f2.x.power.equals(2)) {
-                                        if(f2.b.equals(0)) {
+                                        if(false) {
                                             a = _.divide(f2.a, new Symbol(2));
                                             exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';

[Killed] BlockStatement
Extra.js:340:46
                                             exp = '(({1})*sin((sqrt(({2})*({3}))*({0}))/({2})))/(({2})*sqrt(({2})*({3})))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
                                             retval = _.parse(format(exp, t, a, f.a, f.b));
                                         }
-                                        else {
-                                            a = _.divide(f2.a, new Symbol(2));
-                                            d = f2.b.negate();
-                                            exp = '-((({2})*({4})-2*({1})*({3}))*sin((sqrt(({2})*({3}))*({0}))/({2})))/(2*({2})*({3})*sqrt(({2})*({3})))+' +
-                                                    '(({4})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/(2*({2})*({3}))+(({1})*({0})*cos((sqrt(({2})*({3}))*({0}))/({2})))/({2})^2';
-                                            retval = _.parse(format(exp, t, a, f.a, f.b, d));
-
-                                        }
+                                        else {}
                                     }
                                 }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt((-1+6*s^2)*(1+4*s^2)^(-2),s,t)' to equal '(1/8)*sin((1/2)*t)+(5/16)*cos((1/2)*t)*t'.

[Killed] BlockStatement
Extra.js:352:55
                                 }
                             }
                         }
-                        else if(symbol.isComposite()) {
-                            // 1/(s+1)^2
-                            if(den_p.equals(2) && f.x.group === S) {
-                                retval = _.parse(`(${m})*(${t})*e^(-(${f.b})*(${t}))`);
-                            }
-                            else {
-                                retval = new Symbol(0);
-
-                                symbol.each(function (x) {
-                                    retval = _.add(retval, __.LaPlace.inverse(x, s_, t));
-                                }, true);
-                            }
-                        }
+                        else if(symbol.isComposite()) {}
                     }
 
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(8*(2*s^2+3)^(-2)*s^2,s,t)' to equal '2*sin((1/2)*sqrt(6)*t)*sqrt(6)^(-1)+cos((1/2)*sqrt(6)*t)*t'.

[Killed] ConditionalExpression
Extra.js:352:33
                                 }
                             }
                         }
-                        else if(symbol.isComposite()) {
+                        else if(false) {
                             // 1/(s+1)^2
                             if(den_p.equals(2) && f.x.group === S) {
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(8*(2*s^2+3)^(-2)*s^2,s,t)' to equal '2*sin((1/2)*sqrt(6)*t)*sqrt(6)^(-1)+cos((1/2)*sqrt(6)*t)*t'.

[Killed] ConditionalExpression
Extra.js:354:32
                         }
                         else if(symbol.isComposite()) {
                             // 1/(s+1)^2
-                            if(den_p.equals(2) && f.x.group === S) {
+                            if(true) {
                                 retval = _.parse(`(${m})*(${t})*e^(-(${f.b})*(${t}))`);
                             }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 't' to equal '2*sin((1/2)*sqrt(6)*t)*sqrt(6)^(-1)+cos((1/2)*sqrt(6)*t)*t'.

[Survived] LogicalOperator
Extra.js:354:32
                         }
                         else if(symbol.isComposite()) {
                             // 1/(s+1)^2
-                            if(den_p.equals(2) && f.x.group === S) {
+                            if(den_p.equals(2) || f.x.group === S) {
                                 retval = _.parse(`(${m})*(${t})*e^(-(${f.b})*(${t}))`);
                             }

[NoCoverage] StringLiteral
Extra.js:355:50
                         else if(symbol.isComposite()) {
                             // 1/(s+1)^2
                             if(den_p.equals(2) && f.x.group === S) {
-                                retval = _.parse(`(${m})*(${t})*e^(-(${f.b})*(${t}))`);
+                                retval = _.parse(``);
                             }
                             else {

[Killed] BlockStatement
Extra.js:357:34
                             if(den_p.equals(2) && f.x.group === S) {
                                 retval = _.parse(`(${m})*(${t})*e^(-(${f.b})*(${t}))`);
                             }
-                            else {
-                                retval = new Symbol(0);
-
-                                symbol.each(function (x) {
-                                    retval = _.add(retval, __.LaPlace.inverse(x, s_, t));
-                                }, true);
-                            }
+                            else {}
                         }
                     }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(8*(2*s^2+3)^(-2)*s^2,s,t)' to equal '2*sin((1/2)*sqrt(6)*t)*sqrt(6)^(-1)+cos((1/2)*sqrt(6)*t)*t'.

[Killed] BlockStatement
Extra.js:360:58
                             else {
                                 retval = new Symbol(0);
 
-                                symbol.each(function (x) {
-                                    retval = _.add(retval, __.LaPlace.inverse(x, s_, t));
-                                }, true);
+                                symbol.each(function (x) {}, true);
                             }
                         }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected '0' to equal '2*sin((1/2)*sqrt(6)*t)*sqrt(6)^(-1)+cos((1/2)*sqrt(6)*t)*t'.

[Survived] BooleanLiteral
Extra.js:362:36
 
                                 symbol.each(function (x) {
                                     retval = _.add(retval, __.LaPlace.inverse(x, s_, t));
-                                }, true);
+                                }, false);
                             }
                         }

[Killed] BooleanLiteral
Extra.js:367:24
                         }
                     }
 
-                    if(!retval) {
+                    if(retval) {
                         retval = _.symfunction('ilt', [input_symbol, s_, t]);
                     }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(a*b^(-1)*x^(-1),x,t)' to equal 'a*b^(-1)'.

[Killed] ConditionalExpression
Extra.js:367:24
                         }
                     }
 
-                    if(!retval) {
+                    if(true) {
                         retval = _.symfunction('ilt', [input_symbol, s_, t]);
                     }
killedBy: Extra Calculus should invert a Laplace transform correctly
statusReason: Expected 'ilt(a*b^(-1)*x^(-1),x,t)' to equal 'a*b^(-1)'.

[NoCoverage] StringLiteral
Extra.js:368:48
                     }
 
                     if(!retval) {
-                        retval = _.symfunction('ilt', [input_symbol, s_, t]);
+                        retval = _.symfunction("", [input_symbol, s_, t]);
                     }
 

[Survived] BooleanLiteral
Extra.js:372:20
                     }
 
                     return retval;
-                }, true);
+                }, false);
             }
         },

[Killed] BlockStatement
Extra.js:376:42
             }
         },
         Statistics: {
-            frequencyMap: function (arr) {
-                var map = {};
-                //get the frequency map
-                for(var i = 0, l = arr.length; i < l; i++) {
-                    var e = arr[i],
-                            key = e.toString();
-                    if(!map[key]) //default it to zero
-                        map[key] = 0;
-                    map[key]++; //increment
-                }
-                return map;
-            },
+            frequencyMap: function (arr) {},
             sort: function (arr) {
                 return arr.sort(function (a, b) {
killedBy: Extra Calculus should calculate mode correctly
statusReason: ParseError: Cannot convert undefined or null to object: 1

[Killed] BlockStatement
Extra.js:379:60
             frequencyMap: function (arr) {
                 var map = {};
                 //get the frequency map
-                for(var i = 0, l = arr.length; i < l; i++) {
-                    var e = arr[i],
-                            key = e.toString();
-                    if(!map[key]) //default it to zero
-                        map[key] = 0;
-                    map[key]++; //increment
-                }
+                for(var i = 0, l = arr.length; i < l; i++) {}
                 return map;
             },
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected 'undefined' to equal 'r'.

[Killed] UpdateOperator
Extra.js:379:55
             frequencyMap: function (arr) {
                 var map = {};
                 //get the frequency map
-                for(var i = 0, l = arr.length; i < l; i++) {
+                for(var i = 0, l = arr.length; i < l; i--) {
                     var e = arr[i],
                             key = e.toString();
killedBy: Extra Calculus should calculate mode correctly
statusReason: ParseError: Cannot read property 'toString' of undefined: 1

[Killed] BooleanLiteral
Extra.js:382:24
                 for(var i = 0, l = arr.length; i < l; i++) {
                     var e = arr[i],
                             key = e.toString();
-                    if(!map[key]) //default it to zero
+                    if(map[key]) //default it to zero
                         map[key] = 0;
                     map[key]++; //increment
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected 'mode(1,2,3)' to equal 'mode(1,2)'.

[Killed] ConditionalExpression
Extra.js:382:24
                 for(var i = 0, l = arr.length; i < l; i++) {
                     var e = arr[i],
                             key = e.toString();
-                    if(!map[key]) //default it to zero
+                    if(false) //default it to zero
                         map[key] = 0;
                     map[key]++; //increment
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected 'mode(1,2,3)' to equal 'mode(1,2)'.

[Killed] UpdateOperator
Extra.js:384:21
                             key = e.toString();
                     if(!map[key]) //default it to zero
                         map[key] = 0;
-                    map[key]++; //increment
+                    map[key]--; //increment
                 }
                 return map;
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected '3' to equal 'mode(1,2)'.

[NoCoverage] BlockStatement
Extra.js:388:34
                 }
                 return map;
             },
-            sort: function (arr) {
-                return arr.sort(function (a, b) {
-                    if(!a.isConstant() || !b.isConstant())
-                        _.error('Unable to sort! All values must be numeric');
-                    return a.multiplier.subtract(b.multiplier);
-                });
-            },
+            sort: function (arr) {},
             count: function (arr) {
                 return new Symbol(arr.length);

[NoCoverage] BlockStatement
Extra.js:389:49
                 return map;
             },
             sort: function (arr) {
-                return arr.sort(function (a, b) {
-                    if(!a.isConstant() || !b.isConstant())
-                        _.error('Unable to sort! All values must be numeric');
-                    return a.multiplier.subtract(b.multiplier);
-                });
+                return arr.sort(function (a, b) {});
             },
             count: function (arr) {

[NoCoverage] MethodExpression
Extra.js:389:24
                 return map;
             },
             sort: function (arr) {
-                return arr.sort(function (a, b) {
-                    if(!a.isConstant() || !b.isConstant())
-                        _.error('Unable to sort! All values must be numeric');
-                    return a.multiplier.subtract(b.multiplier);
-                });
+                return arr;
             },
             count: function (arr) {

[NoCoverage] BooleanLiteral
Extra.js:390:43
             },
             sort: function (arr) {
                 return arr.sort(function (a, b) {
-                    if(!a.isConstant() || !b.isConstant())
+                    if(!a.isConstant() || b.isConstant())
                         _.error('Unable to sort! All values must be numeric');
                     return a.multiplier.subtract(b.multiplier);

[NoCoverage] ConditionalExpression
Extra.js:390:24
             },
             sort: function (arr) {
                 return arr.sort(function (a, b) {
-                    if(!a.isConstant() || !b.isConstant())
+                    if(false)
                         _.error('Unable to sort! All values must be numeric');
                     return a.multiplier.subtract(b.multiplier);

[NoCoverage] BlockStatement
Extra.js:395:35
                     return a.multiplier.subtract(b.multiplier);
                 });
             },
-            count: function (arr) {
-                return new Symbol(arr.length);
-            },
+            count: function (arr) {},
             sum: function (arr, x_) {
                 var sum = new Symbol(0);

[NoCoverage] BlockStatement
Extra.js:398:37
             count: function (arr) {
                 return new Symbol(arr.length);
             },
-            sum: function (arr, x_) {
-                var sum = new Symbol(0);
-                for(var i = 0, l = arr.length; i < l; i++) {
-                    var xi = arr[i].clone();
-                    if(x_) {
-                        sum = _.add(_.pow(_.subtract(xi, x_.clone()), new Symbol(2)), sum);
-                    }
-                    else
-                        sum = _.add(xi, sum);
-                }
-
-                return sum;
-            },
+            sum: function (arr, x_) {},
             mean: function () {
                 var args = [].slice.call(arguments);

[NoCoverage] BlockStatement
Extra.js:400:60
             },
             sum: function (arr, x_) {
                 var sum = new Symbol(0);
-                for(var i = 0, l = arr.length; i < l; i++) {
-                    var xi = arr[i].clone();
-                    if(x_) {
-                        sum = _.add(_.pow(_.subtract(xi, x_.clone()), new Symbol(2)), sum);
-                    }
-                    else
-                        sum = _.add(xi, sum);
-                }
+                for(var i = 0, l = arr.length; i < l; i++) {}
 
                 return sum;

[NoCoverage] UpdateOperator
Extra.js:400:55
             },
             sum: function (arr, x_) {
                 var sum = new Symbol(0);
-                for(var i = 0, l = arr.length; i < l; i++) {
+                for(var i = 0, l = arr.length; i < l; i--) {
                     var xi = arr[i].clone();
                     if(x_) {

[NoCoverage] ConditionalExpression
Extra.js:402:24
                 var sum = new Symbol(0);
                 for(var i = 0, l = arr.length; i < l; i++) {
                     var xi = arr[i].clone();
-                    if(x_) {
+                    if(false) {
                         sum = _.add(_.pow(_.subtract(xi, x_.clone()), new Symbol(2)), sum);
                     }

[NoCoverage] BlockStatement
Extra.js:402:28
                 var sum = new Symbol(0);
                 for(var i = 0, l = arr.length; i < l; i++) {
                     var xi = arr[i].clone();
-                    if(x_) {
-                        sum = _.add(_.pow(_.subtract(xi, x_.clone()), new Symbol(2)), sum);
-                    }
+                    if(x_) {}
                     else
                         sum = _.add(xi, sum);

[NoCoverage] BlockStatement
Extra.js:411:31
 
                 return sum;
             },
-            mean: function () {
-                var args = [].slice.call(arguments);
-                //handle arrays
-                if(isVector(args[0]))
-                    return __.Statistics.mean.apply(this, args[0].elements);
-                return  _.divide(__.Statistics.sum(args), __.Statistics.count(args));
-            },
+            mean: function () {},
             median: function () {
                 var args = [].slice.call(arguments), retval;

[NoCoverage] ArrayDeclaration
Extra.js:412:28
                 return sum;
             },
             mean: function () {
-                var args = [].slice.call(arguments);
+                var args = ["Stryker was here"].slice.call(arguments);
                 //handle arrays
                 if(isVector(args[0]))

[NoCoverage] ConditionalExpression
Extra.js:414:20
             mean: function () {
                 var args = [].slice.call(arguments);
                 //handle arrays
-                if(isVector(args[0]))
+                if(false)
                     return __.Statistics.mean.apply(this, args[0].elements);
                 return  _.divide(__.Statistics.sum(args), __.Statistics.count(args));

[NoCoverage] ConditionalExpression
Extra.js:414:20
             mean: function () {
                 var args = [].slice.call(arguments);
                 //handle arrays
-                if(isVector(args[0]))
+                if(true)
                     return __.Statistics.mean.apply(this, args[0].elements);
                 return  _.divide(__.Statistics.sum(args), __.Statistics.count(args));

[NoCoverage] BlockStatement
Extra.js:418:33
                     return __.Statistics.mean.apply(this, args[0].elements);
                 return  _.divide(__.Statistics.sum(args), __.Statistics.count(args));
             },
-            median: function () {
-                var args = [].slice.call(arguments), retval;
-                //handle arrays
-                if(isVector(args[0]))
-                    return __.Statistics.median.apply(this, args[0].elements);
-                try {
-                    var sorted = __.Statistics.sort(args);
-                    var l = args.length;
-                    if(core.Utils.even(l)) {
-                        var mid = l / 2;
-                        retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);
-                    }
-                    else
-                        retval = sorted[Math.floor(l / 2)];
-                }
-                catch(e) {
-                    retval = _.symfunction('median', args);
-                }
-                return retval;
-            },
+            median: function () {},
             mode: function () {
                 var args = [].slice.call(arguments),

[NoCoverage] BlockStatement
Extra.js:423:21
                 //handle arrays
                 if(isVector(args[0]))
                     return __.Statistics.median.apply(this, args[0].elements);
-                try {
-                    var sorted = __.Statistics.sort(args);
-                    var l = args.length;
-                    if(core.Utils.even(l)) {
-                        var mid = l / 2;
-                        retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);
-                    }
-                    else
-                        retval = sorted[Math.floor(l / 2)];
-                }
+                try {}
                 catch(e) {
                     retval = _.symfunction('median', args);

[NoCoverage] MethodExpression
Extra.js:424:34
                 if(isVector(args[0]))
                     return __.Statistics.median.apply(this, args[0].elements);
                 try {
-                    var sorted = __.Statistics.sort(args);
+                    var sorted = __.Statistics;
                     var l = args.length;
                     if(core.Utils.even(l)) {

[NoCoverage] BlockStatement
Extra.js:426:44
                 try {
                     var sorted = __.Statistics.sort(args);
                     var l = args.length;
-                    if(core.Utils.even(l)) {
-                        var mid = l / 2;
-                        retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);
-                    }
+                    if(core.Utils.even(l)) {}
                     else
                         retval = sorted[Math.floor(l / 2)];

[NoCoverage] ConditionalExpression
Extra.js:426:24
                 try {
                     var sorted = __.Statistics.sort(args);
                     var l = args.length;
-                    if(core.Utils.even(l)) {
+                    if(true) {
                         var mid = l / 2;
                         retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);

[NoCoverage] ArithmeticOperator
Extra.js:427:35
                     var sorted = __.Statistics.sort(args);
                     var l = args.length;
                     if(core.Utils.even(l)) {
-                        var mid = l / 2;
+                        var mid = l * 2;
                         retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);
                     }

[NoCoverage] ArithmeticOperator
Extra.js:428:60
                     var l = args.length;
                     if(core.Utils.even(l)) {
                         var mid = l / 2;
-                        retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);
+                        retval = __.Statistics.mean(sorted[mid + 1], sorted[mid]);
                     }
                     else

[NoCoverage] ArithmeticOperator
Extra.js:431:52
                         retval = __.Statistics.mean(sorted[mid - 1], sorted[mid]);
                     }
                     else
-                        retval = sorted[Math.floor(l / 2)];
+                        retval = sorted[Math.floor(l * 2)];
                 }
                 catch(e) {

[NoCoverage] BlockStatement
Extra.js:433:26
                     else
                         retval = sorted[Math.floor(l / 2)];
                 }
-                catch(e) {
-                    retval = _.symfunction('median', args);
-                }
+                catch(e) {}
                 return retval;
             },

[Killed] ConditionalExpression
Extra.js:448:20
                 var map = __.Statistics.frequencyMap(args);
 
                 //the mode of 1 item is that item as per issue #310 (verified by Happypig375). 
-                if(core.Utils.keys(map).length === 1)
+                if(true)
                     retval = args[0];
                 else {
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected '1' to equal 'mode(1,2)'.

[Survived] ConditionalExpression
Extra.js:448:20
                 var map = __.Statistics.frequencyMap(args);
 
                 //the mode of 1 item is that item as per issue #310 (verified by Happypig375). 
-                if(core.Utils.keys(map).length === 1)
+                if(false)
                     retval = args[0];
                 else {

[Killed] BlockStatement
Extra.js:453:39
                 else {
                     //invert by arraning them according to their frequency
                     var inverse = {};
-                    for(var x in map) {
-                        var freq = map[x];
-                        //check if it's in the inverse already
-                        if(!(freq in inverse))
-                            inverse[freq] = x;
-                        else {
-                            var e = inverse[freq];
-                            //if it's already an array then just add it
-                            if(isArray(e))
-                                e.push(x);
-                            //convert it to and array
-                            else
-                                inverse[freq] = [x, inverse[freq]];
-                        }
-                    }
+                    for(var x in map) {}
                     //the keys now represent the maxes. We want the max of those keys
                     var max = inverse[Math.max.apply(null, core.Utils.keys(inverse))];
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected 'undefined' to equal 'mode(1,2)'.

[Killed] ConditionalExpression
Extra.js:456:28
                     for(var x in map) {
                         var freq = map[x];
                         //check if it's in the inverse already
-                        if(!(freq in inverse))
+                        if(true)
                             inverse[freq] = x;
                         else {
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected '2' to equal 'mode(1,2)'.

[Killed] BooleanLiteral
Extra.js:456:28
                     for(var x in map) {
                         var freq = map[x];
                         //check if it's in the inverse already
-                        if(!(freq in inverse))
+                        if(freq in inverse)
                             inverse[freq] = x;
                         else {
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected '2' to equal 'mode(1,2)'.
