[Killed] BlockStatement
Extra.js:458:30
                         //check if it's in the inverse already
                         if(!(freq in inverse))
                             inverse[freq] = x;
-                        else {
-                            var e = inverse[freq];
-                            //if it's already an array then just add it
-                            if(isArray(e))
-                                e.push(x);
-                            //convert it to and array
-                            else
-                                inverse[freq] = [x, inverse[freq]];
-                        }
+                        else {}
                     }
                     //the keys now represent the maxes. We want the max of those keys
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected '1' to equal 'mode(1,2)'.

[Killed] ConditionalExpression
Extra.js:461:32
                         else {
                             var e = inverse[freq];
                             //if it's already an array then just add it
-                            if(isArray(e))
+                            if(true)
                                 e.push(x);
                             //convert it to and array
killedBy: Extra Calculus should calculate mode correctly
statusReason: ParseError: e.push is not a function: 1

[Survived] ConditionalExpression
Extra.js:461:32
                         else {
                             var e = inverse[freq];
                             //if it's already an array then just add it
-                            if(isArray(e))
+                            if(false)
                                 e.push(x);
                             //convert it to and array

[Killed] ConditionalExpression
Extra.js:472:24
                     var max = inverse[Math.max.apply(null, core.Utils.keys(inverse))];
                     //check it's an array. If it is then map over the results and convert 
                     //them to Symbol
-                    if(isArray(max)) {
+                    if(false) {
                         retval = _.symfunction('mode', max.sort());
                     }
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected '(2, 1)' to equal 'mode(1,2)'.

[Killed] BlockStatement
Extra.js:472:38
                     var max = inverse[Math.max.apply(null, core.Utils.keys(inverse))];
                     //check it's an array. If it is then map over the results and convert 
                     //them to Symbol
-                    if(isArray(max)) {
-                        retval = _.symfunction('mode', max.sort());
-                    }
+                    if(isArray(max)) {}
                     else
                         retval = _.parse(max);
killedBy: Extra Calculus should calculate mode correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] MethodExpression
Extra.js:473:56
                     //check it's an array. If it is then map over the results and convert 
                     //them to Symbol
                     if(isArray(max)) {
-                        retval = _.symfunction('mode', max.sort());
+                        retval = _.symfunction('mode', max);
                     }
                     else
killedBy: Extra Calculus should calculate mode correctly
statusReason: Expected 'mode(2,1)' to equal 'mode(1,2)'.

[NoCoverage] BlockStatement
Extra.js:481:43
 
                 return retval;
             },
-            gVariance: function (k, args) {
-                var x_ = __.Statistics.mean.apply(__.Statistics, args),
-                        sum = __.Statistics.sum(args, x_);
-                return _.multiply(k, sum);
-            },
+            gVariance: function (k, args) {},
             variance: function () {
                 var args = [].slice.call(arguments);

[NoCoverage] BlockStatement
Extra.js:486:35
                         sum = __.Statistics.sum(args, x_);
                 return _.multiply(k, sum);
             },
-            variance: function () {
-                var args = [].slice.call(arguments);
-                //handle arrays
-                if(isVector(args[0]))
-                    return __.Statistics.variance.apply(this, args[0].elements);
-                var k = _.divide(new Symbol(1), __.Statistics.count(args));
-                return __.Statistics.gVariance(k, args);
-            },
+            variance: function () {},
             sampleVariance: function () {
                 var args = [].slice.call(arguments);

[NoCoverage] ArrayDeclaration
Extra.js:487:28
                 return _.multiply(k, sum);
             },
             variance: function () {
-                var args = [].slice.call(arguments);
+                var args = ["Stryker was here"].slice.call(arguments);
                 //handle arrays
                 if(isVector(args[0]))

[NoCoverage] BlockStatement
Extra.js:494:41
                 var k = _.divide(new Symbol(1), __.Statistics.count(args));
                 return __.Statistics.gVariance(k, args);
             },
-            sampleVariance: function () {
-                var args = [].slice.call(arguments);
-                //handle arrays
-                if(isVector(args[0]))
-                    return __.Statistics.sampleVariance.apply(this, args[0].elements);
-
-                var k = _.divide(new Symbol(1), _.subtract(__.Statistics.count(args), new Symbol(1)));
-                return __.Statistics.gVariance(k, args);
-            },
+            sampleVariance: function () {},
             standardDeviation: function () {
                 var args = [].slice.call(arguments);

[NoCoverage] BlockStatement
Extra.js:503:44
                 var k = _.divide(new Symbol(1), _.subtract(__.Statistics.count(args), new Symbol(1)));
                 return __.Statistics.gVariance(k, args);
             },
-            standardDeviation: function () {
-                var args = [].slice.call(arguments);
-                //handle arrays
-                if(isVector(args[0]))
-                    return __.Statistics.standardDeviation.apply(this, args[0].elements);
-                return _.pow(__.Statistics.variance.apply(__.Statistics, args), new Symbol(1 / 2));
-            },
+            standardDeviation: function () {},
             sampleStandardDeviation: function () {
                 var args = [].slice.call(arguments);

[NoCoverage] ArithmeticOperator
Extra.js:508:92
                 //handle arrays
                 if(isVector(args[0]))
                     return __.Statistics.standardDeviation.apply(this, args[0].elements);
-                return _.pow(__.Statistics.variance.apply(__.Statistics, args), new Symbol(1 / 2));
+                return _.pow(__.Statistics.variance.apply(__.Statistics, args), new Symbol(1 * 2));
             },
             sampleStandardDeviation: function () {

[NoCoverage] BlockStatement
Extra.js:510:50
                     return __.Statistics.standardDeviation.apply(this, args[0].elements);
                 return _.pow(__.Statistics.variance.apply(__.Statistics, args), new Symbol(1 / 2));
             },
-            sampleStandardDeviation: function () {
-                var args = [].slice.call(arguments);
-                //handle arrays
-                if(isVector(args[0]))
-                    return __.Statistics.sampleStandardDeviation.apply(this, args[0].elements);
-                return _.pow(__.Statistics.sampleVariance.apply(__.Statistics, args), new Symbol(1 / 2));
-            },
+            sampleStandardDeviation: function () {},
             zScore: function (x, mean, stdev) {
                 return _.divide(_.subtract(x, mean), stdev);

[NoCoverage] ArithmeticOperator
Extra.js:515:98
                 //handle arrays
                 if(isVector(args[0]))
                     return __.Statistics.sampleStandardDeviation.apply(this, args[0].elements);
-                return _.pow(__.Statistics.sampleVariance.apply(__.Statistics, args), new Symbol(1 / 2));
+                return _.pow(__.Statistics.sampleVariance.apply(__.Statistics, args), new Symbol(1 * 2));
             },
             zScore: function (x, mean, stdev) {

[NoCoverage] BlockStatement
Extra.js:517:47
                     return __.Statistics.sampleStandardDeviation.apply(this, args[0].elements);
                 return _.pow(__.Statistics.sampleVariance.apply(__.Statistics, args), new Symbol(1 / 2));
             },
-            zScore: function (x, mean, stdev) {
-                return _.divide(_.subtract(x, mean), stdev);
-            }
+            zScore: function (x, mean, stdev) {}
         },
         Units: {
