[Killed] ConditionalExpression
Algebra.js:2175:28
                         term = _.parse(e, subs);
                         var tp = term.power;
                         //the temporary power has to be an integer as well
-                        if(!isInt(tp))
+                        if(true)
                             exit();
                         terms.push(term);
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] BooleanLiteral
Algebra.js:2175:28
                         term = _.parse(e, subs);
                         var tp = term.power;
                         //the temporary power has to be an integer as well
-                        if(!isInt(tp))
+                        if(isInt(tp))
                             exit();
                         terms.push(term);
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2183:24
 
                     //get the gcd. This will be the p in (a^n+b^m)^p
                     //if the gcd equals 1 meaning n = m then we need a tie breakder
-                    if(core.Utils.allSame(powers)) {
+                    if(false) {
                         //get p given x number of terms
                         var n_terms = symbol.length;
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Survived] ConditionalExpression
Algebra.js:2183:24
 
                     //get the gcd. This will be the p in (a^n+b^m)^p
                     //if the gcd equals 1 meaning n = m then we need a tie breakder
-                    if(core.Utils.allSame(powers)) {
+                    if(true) {
                         //get p given x number of terms
                         var n_terms = symbol.length;

[Killed] BlockStatement
Algebra.js:2188:44
                         var n_terms = symbol.length;
                         //the number of zeroes determines
                         var n_zeroes = terms.length;
-                        if(n_zeroes === 2) {
-                            p = new Frac(powers[0] / (n_terms - 1));
-                        }
+                        if(n_zeroes === 2) {}
                         if(n_zeroes === 3) {
                             p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) - 3) / 2));
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2188:28
                         var n_terms = symbol.length;
                         //the number of zeroes determines
                         var n_zeroes = terms.length;
-                        if(n_zeroes === 2) {
+                        if(false) {
                             p = new Frac(powers[0] / (n_terms - 1));
                         }
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ArithmeticOperator
Algebra.js:2189:42
                         //the number of zeroes determines
                         var n_zeroes = terms.length;
                         if(n_zeroes === 2) {
-                            p = new Frac(powers[0] / (n_terms - 1));
+                            p = new Frac(powers[0] * (n_terms - 1));
                         }
                         if(n_zeroes === 3) {
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ArithmeticOperator
Algebra.js:2189:55
                         //the number of zeroes determines
                         var n_zeroes = terms.length;
                         if(n_zeroes === 2) {
-                            p = new Frac(powers[0] / (n_terms - 1));
+                            p = new Frac(powers[0] / (n_terms + 1));
                         }
                         if(n_zeroes === 3) {
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2191:28
                         if(n_zeroes === 2) {
                             p = new Frac(powers[0] / (n_terms - 1));
                         }
-                        if(n_zeroes === 3) {
+                        if(true) {
                             p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) - 3) / 2));
                         }
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] BlockStatement
Algebra.js:2191:44
                         if(n_zeroes === 2) {
                             p = new Frac(powers[0] / (n_terms - 1));
                         }
-                        if(n_zeroes === 3) {
-                            p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) - 3) / 2));
-                        }
+                        if(n_zeroes === 3) {}
                         /*
                          //get the lowest possible power
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^2*c^4+3*a^4*b^2+3*a^4*c^2+3*b^2*c^4+3*b^4*c^2+6*a^2*b^2*c^2+a^6+b^6+c^6' to equal '(a^2+b^2+c^2)^3'.

[Killed] ArithmeticOperator
Algebra.js:2192:65
                             p = new Frac(powers[0] / (n_terms - 1));
                         }
                         if(n_zeroes === 3) {
-                            p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) - 3) / 2));
+                            p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) - 3) * 2));
                         }
                         /*
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^2*c^4+3*a^4*b^2+3*a^4*c^2+3*b^2*c^4+3*b^4*c^2+6*a^2*b^2*c^2+a^6+b^6+c^6' to equal '(a^2+b^2+c^2)^3'.

[Killed] ArithmeticOperator
Algebra.js:2192:66
                             p = new Frac(powers[0] / (n_terms - 1));
                         }
                         if(n_zeroes === 3) {
-                            p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) - 3) / 2));
+                            p = new Frac(powers[0] / Math.round((Math.sqrt(8 * n_terms - 1) + 3) / 2));
                         }
                         /*
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^2*c^4+3*a^4*b^2+3*a^4*c^2+3*b^2*c^4+3*b^4*c^2+6*a^2*b^2*c^2+a^6+b^6+c^6' to equal '(a^2+b^2+c^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2215:24
                         p = core.Math2.QGCD.apply(null, powers);
 
                     //if we don't have an integer then exit
-                    if(!isInt(p))
+                    if(true)
                         exit();
 
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] BooleanLiteral
Algebra.js:2215:24
                         p = core.Math2.QGCD.apply(null, powers);
 
                     //if we don't have an integer then exit
-                    if(!isInt(p))
+                    if(isInt(p))
                         exit();
 
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] UpdateOperator
Algebra.js:2219:54
                         exit();
 
                     //build the factor
-                    for(var i = 0; i < terms.length; i++) {
+                    for(var i = 0; i < terms.length; i--) {
                         var t = terms[i];
                         var n = t.power.clone().divide(p);
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] BlockStatement
Algebra.js:2219:59
                         exit();
 
                     //build the factor
-                    for(var i = 0; i < terms.length; i++) {
-                        var t = terms[i];
-                        var n = t.power.clone().divide(p);
-                        t.multiplier = new Frac(Math.pow(t.multiplier, 1 / n));
-                        t.power = p.clone();
-                        sum = _.add(sum, t);
-                    }
+                    for(var i = 0; i < terms.length; i++) {}
 
                     //by now we have the factor of zeroes. We'll know if we got it right because 
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ArithmeticOperator
Algebra.js:2222:72
                     for(var i = 0; i < terms.length; i++) {
                         var t = terms[i];
                         var n = t.power.clone().divide(p);
-                        t.multiplier = new Frac(Math.pow(t.multiplier, 1 / n));
+                        t.multiplier = new Frac(Math.pow(t.multiplier, 1 * n));
                         t.power = p.clone();
                         sum = _.add(sum, t);
killedBy: Algebra should factor correctly
statusReason: Expected '12*a^2*b^4+48*a^4*b^2+64*a^6+b^6' to equal '((9007199254740996/2251799813685249)*a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2229:24
 
                     //by now we have the factor of zeroes. We'll know if we got it right because 
                     //we'll get a remainder of zero each time we divide by it
-                    if(sum.group !== CP)
+                    if(true)
                         return symbol; //nothing to do
 
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Timeout] ConditionalExpression
Algebra.js:2229:24
 
                     //by now we have the factor of zeroes. We'll know if we got it right because 
                     //we'll get a remainder of zero each time we divide by it
-                    if(sum.group !== CP)
+                    if(false)
                         return symbol; //nothing to do
 

[Killed] ConditionalExpression
Algebra.js:2234:28
 
                     while(true) {
                         var d = __.div(symbol.clone(), sum.clone());
-                        if(d[1].equals(0)) {
+                        if(true) {
                             symbol = d[0];
                             factors.add(sum.clone());
killedBy: Algebra should factor correctly
statusReason: Expected '(-3*b+4*a)*(3*b+4*a)^2' to equal '(-3*b+4*a)*(12*a*b+16*a^2+9*b^2)'.

[Killed] ConditionalExpression
Algebra.js:2234:28
 
                     while(true) {
                         var d = __.div(symbol.clone(), sum.clone());
-                        if(d[1].equals(0)) {
+                        if(false) {
                             symbol = d[0];
                             factors.add(sum.clone());
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] ConditionalExpression
Algebra.js:2237:32
                         if(d[1].equals(0)) {
                             symbol = d[0];
                             factors.add(sum.clone());
-                            if(symbol.equals(1)) //we've reached 1 so done.
+                            if(true) //we've reached 1 so done.
                                 break;
                         }
killedBy: Algebra should factor correctly
statusReason: Expected '(4*a^2+b^2)^3' to equal '((9007199254740996/2251799813685249)*a^2+b^2)^3'.

[Survived] ConditionalExpression
Algebra.js:2237:32
                         if(d[1].equals(0)) {
                             symbol = d[0];
                             factors.add(sum.clone());
-                            if(symbol.equals(1)) //we've reached 1 so done.
+                            if(false) //we've reached 1 so done.
                                 break;
                         }

[Killed] ConditionalExpression
Algebra.js:2252:20
             },
             factor: function (symbol, factors) {
                 // Don't try to factor constants
-                if(symbol.isConstant()) {
+                if(false) {
                     return core.Math2.factor(symbol);
                 }
killedBy: Algebra should factor correctly
statusReason: Expected '100' to equal '2^2*5^2'.

[Killed] BlockStatement
Algebra.js:2252:41
             },
             factor: function (symbol, factors) {
                 // Don't try to factor constants
-                if(symbol.isConstant()) {
-                    return core.Math2.factor(symbol);
-                }
+                if(symbol.isConstant()) {}
 
                 var _symbol = _.parse(symbol);
killedBy: Algebra should factor correctly
statusReason: Expected '100' to equal '2^2*5^2'.

[Killed] ConditionalExpression
Algebra.js:2258:20
 
                 var _symbol = _.parse(symbol);
                 var retval = __.Factor._factor(_symbol, factors);
-                if(retval.equals(symbol)) {
+                if(true) {
                     return retval;
                 }
killedBy: Algebra should use simple factor result
statusReason: Expected '(1+2*x)^2*(1/4)' to be '(1/4)*(1+2*x)^2'.

[Killed] ConditionalExpression
Algebra.js:2258:20
 
                 var _symbol = _.parse(symbol);
                 var retval = __.Factor._factor(_symbol, factors);
-                if(retval.equals(symbol)) {
+                if(false) {
                     return retval;
                 }
killedBy: Algebra should simplify correctly
statusReason: Expected '(a^2+b^2)*a*b' to equal '(a*b)^(-1)*(a^2+b^2)'.

[Killed] ConditionalExpression
Algebra.js:2262:20
                     return retval;
                 }
 
-                if(retval.group === CB) {
+                if(true) {
                     var t = new Symbol(1);
                     var p = _.parse(retval.power);
killedBy: Algebra should factor correctly
statusReason: Expected 'x^2' to equal '(1+x)^2'.

[Killed] ConditionalExpression
Algebra.js:2262:20
                     return retval;
                 }
 
-                if(retval.group === CB) {
+                if(false) {
                     var t = new Symbol(1);
                     var p = _.parse(retval.power);
killedBy: Algebra should use simple factor result
statusReason: Expected '(1+2*x)^2*(1/4)' to be '(1/4)*(1+2*x)^2'.

[Killed] ConditionalExpression
Algebra.js:2274:24
                      * NOTE: for sign issues with factor START DEBUGGING HERE
                      */
                     //move the sign to t
-                    if(retval.multiplier.lessThan(0)) {
+                    if(true) {
                         t.negate();
                         retval.negate();
killedBy: Algebra should perform divisions
statusReason: Expected '-b^(-1)' to equal 'b^(-1)'.

[Survived] ConditionalExpression
Algebra.js:2274:24
                      * NOTE: for sign issues with factor START DEBUGGING HERE
                      */
                     //move the sign to t
-                    if(retval.multiplier.lessThan(0)) {
+                    if(false) {
                         t.negate();
                         retval.negate();

[Killed] BlockStatement
Algebra.js:2279:46
                         retval.negate();
                     }
 
-                    retval.each(function (x) {
-                        // Related to #566. Since the symbol's group may not have been properly
-                        // updated, it's easier to just parse the symbol and have the parser 
-                        // do the update for us.
-                        var factored = _.parse(__.Factor._factor(x));
-
-                        if(factored.group === CB) {
-                            // Include the multiplier
-                            m = _.multiply(m, Symbol.create(factored.multiplier));
-                            factored.each(function (y) {
-                                var _factored = _.parse(__.Factor._factor(y));
-                                t = _.multiply(t, _factored);
-                                if(_factored.group === CB) {
-                                    m = _.multiply(m, Symbol.create(_factored.multiplier));
-                                }
-                            });
-                        }
-                        else {
-                            t = _.multiply(t, factored);
-                        }
-                    });
+                    retval.each(function (x) {});
 
                     //put back the multiplier and power
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] BlockStatement
Algebra.js:2285:51
                         // do the update for us.
                         var factored = _.parse(__.Factor._factor(x));
 
-                        if(factored.group === CB) {
-                            // Include the multiplier
-                            m = _.multiply(m, Symbol.create(factored.multiplier));
-                            factored.each(function (y) {
-                                var _factored = _.parse(__.Factor._factor(y));
-                                t = _.multiply(t, _factored);
-                                if(_factored.group === CB) {
-                                    m = _.multiply(m, Symbol.create(_factored.multiplier));
-                                }
-                            });
-                        }
+                        if(factored.group === CB) {}
                         else {
                             t = _.multiply(t, factored);
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] BlockStatement
Algebra.js:2288:56
                         if(factored.group === CB) {
                             // Include the multiplier
                             m = _.multiply(m, Symbol.create(factored.multiplier));
-                            factored.each(function (y) {
-                                var _factored = _.parse(__.Factor._factor(y));
-                                t = _.multiply(t, _factored);
-                                if(_factored.group === CB) {
-                                    m = _.multiply(m, Symbol.create(_factored.multiplier));
-                                }
-                            });
+                            factored.each(function (y) {});
                         }
                         else {
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)*(1+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Survived] ConditionalExpression
Algebra.js:2291:36
                             factored.each(function (y) {
                                 var _factored = _.parse(__.Factor._factor(y));
                                 t = _.multiply(t, _factored);
-                                if(_factored.group === CB) {
+                                if(false) {
                                     m = _.multiply(m, Symbol.create(_factored.multiplier));
                                 }

[Survived] BlockStatement
Algebra.js:2291:60
                             factored.each(function (y) {
                                 var _factored = _.parse(__.Factor._factor(y));
                                 t = _.multiply(t, _factored);
-                                if(_factored.group === CB) {
-                                    m = _.multiply(m, Symbol.create(_factored.multiplier));
-                                }
+                                if(_factored.group === CB) {}
                             });
                         }

[Killed] BlockStatement
Algebra.js:2296:30
                                 }
                             });
                         }
-                        else {
-                            t = _.multiply(t, factored);
-                        }
+                        else {}
                     });
 
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] ConditionalExpression
Algebra.js:2308:20
                 return retval;
             },
             quadFactor: function (symbol, factors) {
-                if(symbol.isPoly() && __.degree(symbol.equals(2))) {
+                if(false) {
                     //We've  already checked that we're dealing with a polynomial
                     var v = core.Utils.variables(symbol)[0]; //get the variable
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Survived] ConditionalExpression
Algebra.js:2308:20
                 return retval;
             },
             quadFactor: function (symbol, factors) {
-                if(symbol.isPoly() && __.degree(symbol.equals(2))) {
+                if(true) {
                     //We've  already checked that we're dealing with a polynomial
                     var v = core.Utils.variables(symbol)[0]; //get the variable

[Killed] ConditionalExpression
Algebra.js:2315:24
                     //factor the lead coefficient
                     var cf = __.Factor._factor(coeffs[2].clone());
                     //check if we have factors
-                    if(cf.group === CB) {
+                    if(false) {
                         var symbols = cf.collectSymbols();
                         //if the factors are greater than 2 we're done so exit
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Survived] ConditionalExpression
Algebra.js:2315:24
                     //factor the lead coefficient
                     var cf = __.Factor._factor(coeffs[2].clone());
                     //check if we have factors
-                    if(cf.group === CB) {
+                    if(true) {
                         var symbols = cf.collectSymbols();
                         //if the factors are greater than 2 we're done so exit

[Killed] ConditionalExpression
Algebra.js:2318:28
                     if(cf.group === CB) {
                         var symbols = cf.collectSymbols();
                         //if the factors are greater than 2 we're done so exit
-                        if(symbols.length > 2)
+                        if(true)
                             return symbol;
                         //if we have two factors then attempt to factor the polynomial
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Survived] ConditionalExpression
Algebra.js:2318:28
                     if(cf.group === CB) {
                         var symbols = cf.collectSymbols();
                         //if the factors are greater than 2 we're done so exit
-                        if(symbols.length > 2)
+                        if(false)
                             return symbol;
                         //if we have two factors then attempt to factor the polynomial

[Killed] BlockStatement
Algebra.js:2330:73
                         var b = _.parse(coeffs[1]).negate();
                         var a = _.parse(symbols[1]);
                         //solve the system
-                        var root = __.quad(a, b, c).filter(function (x) {
-                            if(core.Utils.isInt(x))
-                                return x;
-                        });
+                        var root = __.quad(a, b, c).filter(function (x) {});
                         //if we have one root then find the other one by dividing the constant
                         if(root.length === 1) {
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] MethodExpression
Algebra.js:2330:36
                         var b = _.parse(coeffs[1]).negate();
                         var a = _.parse(symbols[1]);
                         //solve the system
-                        var root = __.quad(a, b, c).filter(function (x) {
-                            if(core.Utils.isInt(x))
-                                return x;
-                        });
+                        var root = __.quad(a, b, c);
                         //if we have one root then find the other one by dividing the constant
                         if(root.length === 1) {
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] ConditionalExpression
Algebra.js:2331:32
                         var a = _.parse(symbols[1]);
                         //solve the system
                         var root = __.quad(a, b, c).filter(function (x) {
-                            if(core.Utils.isInt(x))
+                            if(false)
                                 return x;
                         });
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] ConditionalExpression
Algebra.js:2331:32
                         var a = _.parse(symbols[1]);
                         //solve the system
                         var root = __.quad(a, b, c).filter(function (x) {
-                            if(core.Utils.isInt(x))
+                            if(true)
                                 return x;
                         });
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] BlockStatement
Algebra.js:2335:47
                                 return x;
                         });
                         //if we have one root then find the other one by dividing the constant
-                        if(root.length === 1) {
-                            var root1 = root[0];
-                            var root2 = _.divide(coeffs[0], _.parse(root1));
-                            if(core.Utils.isInt(root2)) {
-                                //we found them both
-                                factors.add(_.parse(format('({0})*({1})+({2})', symbols[1], v, root2)));
-                                factors.add(_.parse(format('({0})*({1})+({2})', symbols[0], v, root1)));
-                                symbol = new Symbol(1);
-                            }
-                        }
+                        if(root.length === 1) {}
                     }
                 }
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] ConditionalExpression
Algebra.js:2335:28
                                 return x;
                         });
                         //if we have one root then find the other one by dividing the constant
-                        if(root.length === 1) {
+                        if(false) {
                             var root1 = root[0];
                             var root2 = _.divide(coeffs[0], _.parse(root1));
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] BlockStatement
Algebra.js:2338:57
                         if(root.length === 1) {
                             var root1 = root[0];
                             var root2 = _.divide(coeffs[0], _.parse(root1));
-                            if(core.Utils.isInt(root2)) {
-                                //we found them both
-                                factors.add(_.parse(format('({0})*({1})+({2})', symbols[1], v, root2)));
-                                factors.add(_.parse(format('({0})*({1})+({2})', symbols[0], v, root1)));
-                                symbol = new Symbol(1);
-                            }
+                            if(core.Utils.isInt(root2)) {}
                         }
                     }
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] ConditionalExpression
Algebra.js:2338:32
                         if(root.length === 1) {
                             var root1 = root[0];
                             var root2 = _.divide(coeffs[0], _.parse(root1));
-                            if(core.Utils.isInt(root2)) {
+                            if(false) {
                                 //we found them both
                                 factors.add(_.parse(format('({0})*({1})+({2})', symbols[1], v, root2)));
killedBy: Algebra should simplify correctly
statusReason: Expected '(-32+5*K)*(-35*K+4*K^2+112)*(-944*K+85*K^2+2560)^(-1)' to equal '(-35*K+4*K^2+112)*(-80+17*K)^(-1)'.

[Killed] ConditionalExpression
Algebra.js:2350:20
                 return symbol;
             },
             cubeFactor: function (symbol, factors) {
-                if(symbol.isComposite()) {
+                if(false) {
                     var symbols = symbol.collectSymbols();
                     // The symbol should be in the form of a^3+-b^3. The length
killedBy: Algebra should factor correctly
statusReason: Expected '1331*x^3*y^3+216*z^6' to equal '(-66*x*y*z^2+121*x^2*y^2+36*z^4)*(11*x*y+6*z^2)'.
