[Killed] StringLiteral
Algebra.js:2678:48
 
                 var d = core.Utils.arrayMin(k);
                 var retval = new Symbol(0);
-                var q = _.parse(symbol.value + '^' + d);
+                var q = _.parse(symbol.value + "" + d);
                 symbol.each(function (x) {
                     x = _.divide(x, q.clone());
killedBy: Algebra should factor correctly
statusReason: Expected '(-2*x+12*x^3+6*x^2)^(-1)*(4*x^2+7*x^3+x)' to equal '(1/2)*(-1+3*x+6*x^2)^(-1)*(1+4*x+7*x^2)'.

[Killed] BlockStatement
Algebra.js:2679:42
                 var d = core.Utils.arrayMin(k);
                 var retval = new Symbol(0);
                 var q = _.parse(symbol.value + '^' + d);
-                symbol.each(function (x) {
-                    x = _.divide(x, q.clone());
-                    retval = _.add(retval, x);
-                });
+                symbol.each(function (x) {});
 
                 factors.add(q);
killedBy: Algebra should factor correctly
statusReason: Expected '1/2' to equal '(1/2)*(-1+3*x+6*x^2)^(-1)*(1+4*x+7*x^2)'.

[Killed] ConditionalExpression
Algebra.js:2694:20
              * @returns {Symbol}
              */
             coeffFactor: function (symbol, factors) {
-                if(symbol.isComposite()) {
+                if(false) {
                     var gcd = core.Math2.QGCD.apply(null, symbol.coeffs());
 
killedBy: Algebra should factor correctly
statusReason: Expected '((5/2)*x+x^2+1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2694:20
              * @returns {Symbol}
              */
             coeffFactor: function (symbol, factors) {
-                if(symbol.isComposite()) {
+                if(true) {
                     var gcd = core.Math2.QGCD.apply(null, symbol.coeffs());
 
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] BlockStatement
Algebra.js:2697:40
                 if(symbol.isComposite()) {
                     var gcd = core.Math2.QGCD.apply(null, symbol.coeffs());
 
-                    if(!gcd.equals(1)) {
-                        symbol.each(function (x) {
-                            if(x.isComposite()) {
-                                x.each(function (y) {
-                                    y.multiplier = y.multiplier.divide(gcd);
-                                });
-                            }
-                            else
-                                x.multiplier = x.multiplier.divide(gcd);
-                        });
-                        symbol.updateHash();
-                    }
+                    if(!gcd.equals(1)) {}
                     else {
                         // TODO: This should probably go to the prototype
killedBy: Algebra should use simple factor result
statusReason: Expected '(1/16)*(1+2*x)^2' to be '(1/4)*(1+2*x)^2'.

[Killed] ConditionalExpression
Algebra.js:2697:24
                 if(symbol.isComposite()) {
                     var gcd = core.Math2.QGCD.apply(null, symbol.coeffs());
 
-                    if(!gcd.equals(1)) {
+                    if(false) {
                         symbol.each(function (x) {
                             if(x.isComposite()) {
killedBy: Algebra should use simple factor result
statusReason: Expected '(1/16)*(1+2*x)^2' to be '(1/4)*(1+2*x)^2'.

[Killed] BlockStatement
Algebra.js:2698:50
                     var gcd = core.Math2.QGCD.apply(null, symbol.coeffs());
 
                     if(!gcd.equals(1)) {
-                        symbol.each(function (x) {
-                            if(x.isComposite()) {
-                                x.each(function (y) {
-                                    y.multiplier = y.multiplier.divide(gcd);
-                                });
-                            }
-                            else
-                                x.multiplier = x.multiplier.divide(gcd);
-                        });
+                        symbol.each(function (x) {});
                         symbol.updateHash();
                     }
killedBy: Algebra should use simple factor result
statusReason: Expected '(1/16)*(1+2*x)^2' to be '(1/4)*(1+2*x)^2'.

[Killed] ConditionalExpression
Algebra.js:2699:32
 
                     if(!gcd.equals(1)) {
                         symbol.each(function (x) {
-                            if(x.isComposite()) {
+                            if(false) {
                                 x.each(function (y) {
                                     y.multiplier = y.multiplier.divide(gcd);
killedBy: Algebra should use simple factor result
statusReason: Expected '(1/4)*(1+x+x^2)' to be '(1/4)*(1+2*x)^2'.

[Killed] BlockStatement
Algebra.js:2699:49
 
                     if(!gcd.equals(1)) {
                         symbol.each(function (x) {
-                            if(x.isComposite()) {
-                                x.each(function (y) {
-                                    y.multiplier = y.multiplier.divide(gcd);
-                                });
-                            }
+                            if(x.isComposite()) {}
                             else
                                 x.multiplier = x.multiplier.divide(gcd);
killedBy: Algebra should use simple factor result
statusReason: Expected '(1/4)*(1+x+x^2)' to be '(1/4)*(1+2*x)^2'.

[Killed] BlockStatement
Algebra.js:2700:53
                     if(!gcd.equals(1)) {
                         symbol.each(function (x) {
                             if(x.isComposite()) {
-                                x.each(function (y) {
-                                    y.multiplier = y.multiplier.divide(gcd);
-                                });
+                                x.each(function (y) {});
                             }
                             else
killedBy: Algebra should use simple factor result
statusReason: Expected '(1/4)*(1+x+x^2)' to be '(1/4)*(1+2*x)^2'.

[Survived] BlockStatement
Algebra.js:2711:55
                     }
                     else {
                         // TODO: This should probably go to the prototype
-                        var power = function (symbol) {
-                            var p;
-                            if(symbol.group === CB) {
-                                p = 0;
-                                symbol.each(function (x) {
-                                    p += x.power;
-                                });
-                            }
-                            else {
-                                p = Number(symbol.power);
-                            }
-                            return p;
-                        };
+                        var power = function (symbol) {};
                         // Factor out negatives from the lead term
                         var terms = symbol.collectSymbols(null, null, null, true).sort(function (a, b) {

[Killed] ConditionalExpression
Algebra.js:2713:32
                         // TODO: This should probably go to the prototype
                         var power = function (symbol) {
                             var p;
-                            if(symbol.group === CB) {
+                            if(false) {
                                 p = 0;
                                 symbol.each(function (x) {
killedBy: Algebra should factor correctly
statusReason: Expected '-(-11*x*y+6*z^2)*(121*x^2*y^2+36*z^4+66*x*y*z^2)' to equal '(-6*z^2+11*x*y)*(121*x^2*y^2+36*z^4+66*x*y*z^2)'.

[Survived] ConditionalExpression
Algebra.js:2713:32
                         // TODO: This should probably go to the prototype
                         var power = function (symbol) {
                             var p;
-                            if(symbol.group === CB) {
+                            if(true) {
                                 p = 0;
                                 symbol.each(function (x) {

[Killed] BlockStatement
Algebra.js:2715:58
                             var p;
                             if(symbol.group === CB) {
                                 p = 0;
-                                symbol.each(function (x) {
-                                    p += x.power;
-                                });
+                                symbol.each(function (x) {});
                             }
                             else {
killedBy: Algebra should factor correctly
statusReason: Expected '-(-11*x*y+6*z^2)*(121*x^2*y^2+36*z^4+66*x*y*z^2)' to equal '(-6*z^2+11*x*y)*(121*x^2*y^2+36*z^4+66*x*y*z^2)'.

[Killed] AssignmentOperator
Algebra.js:2716:37
                             if(symbol.group === CB) {
                                 p = 0;
                                 symbol.each(function (x) {
-                                    p += x.power;
+                                    p -= x.power;
                                 });
                             }
killedBy: Algebra should factor correctly
statusReason: Expected '-(-11*x*y+6*z^2)*(121*x^2*y^2+36*z^4+66*x*y*z^2)' to equal '(-6*z^2+11*x*y)*(121*x^2*y^2+36*z^4+66*x*y*z^2)'.

[Survived] BlockStatement
Algebra.js:2719:34
                                     p += x.power;
                                 });
                             }
-                            else {
-                                p = Number(symbol.power);
-                            }
+                            else {}
                             return p;
                         };

[Killed] MethodExpression
Algebra.js:2725:37
                             return p;
                         };
                         // Factor out negatives from the lead term
-                        var terms = symbol.collectSymbols(null, null, null, true).sort(function (a, b) {
-                            // Push constants to the back
-                            if(a.isConstant(true))
-                                return 1;
-                            return b.power - a.power;
-                        });
+                        var terms = symbol.collectSymbols(null, null, null, true);
 
                         var LT = terms[0];
killedBy: Algebra should correctly peform partial fraction decomposition
statusReason: Expected '-(-1+x)^(-1)-(-1+x)^(-2)' to equal '(-1+x)^(-1)+(-1+x)^(-2)'.

[Killed] BlockStatement
Algebra.js:2725:104
                             return p;
                         };
                         // Factor out negatives from the lead term
-                        var terms = symbol.collectSymbols(null, null, null, true).sort(function (a, b) {
-                            // Push constants to the back
-                            if(a.isConstant(true))
-                                return 1;
-                            return b.power - a.power;
-                        });
+                        var terms = symbol.collectSymbols(null, null, null, true).sort(function (a, b) {});
 
                         var LT = terms[0];
killedBy: Algebra should correctly peform partial fraction decomposition
statusReason: Expected '-(-1+x)^(-1)-(-1+x)^(-2)' to equal '(-1+x)^(-1)+(-1+x)^(-2)'.

[Killed] ConditionalExpression
Algebra.js:2727:32
                         // Factor out negatives from the lead term
                         var terms = symbol.collectSymbols(null, null, null, true).sort(function (a, b) {
                             // Push constants to the back
-                            if(a.isConstant(true))
+                            if(true)
                                 return 1;
                             return b.power - a.power;
killedBy: Algebra should correctly peform partial fraction decomposition
statusReason: Expected '-(-1+x)^(-1)-(-1+x)^(-2)' to equal '(-1+x)^(-1)+(-1+x)^(-2)'.

[Survived] ConditionalExpression
Algebra.js:2727:32
                         // Factor out negatives from the lead term
                         var terms = symbol.collectSymbols(null, null, null, true).sort(function (a, b) {
                             // Push constants to the back
-                            if(a.isConstant(true))
+                            if(false)
                                 return 1;
                             return b.power - a.power;

[Killed] ArithmeticOperator
Algebra.js:2729:36
                             // Push constants to the back
                             if(a.isConstant(true))
                                 return 1;
-                            return b.power - a.power;
+                            return b.power + a.power;
                         });
 
killedBy: Algebra should correctly peform partial fraction decomposition
statusReason: Expected '-(-1+x)^(-1)-(-1+x)^(-2)' to equal '(-1+x)^(-1)+(-1+x)^(-2)'.

[Killed] ConditionalExpression
Algebra.js:2735:28
                         var LT = terms[0];
 
                         // Check if the LT is indeed the greatest
-                        if(power(LT) > power(terms[1]) || terms[1].isConstant(true)) {
+                        if(true) {
                             if(LT.multiplier.lessThan(0)) {
                                 // Although the symbol should always be linear at this point, remove the negative for squares
killedBy: Algebra should factor correctly
statusReason: Expected '-(-y+x)*(x+y)' to equal '(-y+x)*(x+y)'.

[Killed] BlockStatement
Algebra.js:2735:86
                         var LT = terms[0];
 
                         // Check if the LT is indeed the greatest
-                        if(power(LT) > power(terms[1]) || terms[1].isConstant(true)) {
-                            if(LT.multiplier.lessThan(0)) {
-                                // Although the symbol should always be linear at this point, remove the negative for squares
-                                // to be safe.
-                                factors.add(new Symbol(-1));
-
-                                symbol.each(function (x) {
-                                    x.negate();
-                                }, true);
-                            }
-                        }
+                        if(power(LT) > power(terms[1]) || terms[1].isConstant(true)) {}
 
                     }
killedBy: Algebra should simplify correctly
statusReason: Expected '(-1-x^2+x)^(-1)*(-x+x^2+1)' to equal '-1'.

[Killed] ConditionalExpression
Algebra.js:2736:32
 
                         // Check if the LT is indeed the greatest
                         if(power(LT) > power(terms[1]) || terms[1].isConstant(true)) {
-                            if(LT.multiplier.lessThan(0)) {
+                            if(false) {
                                 // Although the symbol should always be linear at this point, remove the negative for squares
                                 // to be safe.
killedBy: Algebra should simplify correctly
statusReason: Expected '(-1-x^2+x)^(-1)*(-x+x^2+1)' to equal '-1'.

[Killed] BlockStatement
Algebra.js:2736:59
 
                         // Check if the LT is indeed the greatest
                         if(power(LT) > power(terms[1]) || terms[1].isConstant(true)) {
-                            if(LT.multiplier.lessThan(0)) {
-                                // Although the symbol should always be linear at this point, remove the negative for squares
-                                // to be safe.
-                                factors.add(new Symbol(-1));
-
-                                symbol.each(function (x) {
-                                    x.negate();
-                                }, true);
-                            }
+                            if(LT.multiplier.lessThan(0)) {}
                         }
 
killedBy: Algebra should simplify correctly
statusReason: Expected '(-1-x^2+x)^(-1)*(-x+x^2+1)' to equal '-1'.

[Killed] UnaryOperator
Algebra.js:2739:56
                             if(LT.multiplier.lessThan(0)) {
                                 // Although the symbol should always be linear at this point, remove the negative for squares
                                 // to be safe.
-                                factors.add(new Symbol(-1));
+                                factors.add(new Symbol(+1));
 
                                 symbol.each(function (x) {
killedBy: Algebra should simplify correctly
statusReason: Expected '1' to equal '-1'.

[Killed] BlockStatement
Algebra.js:2741:58
                                 // to be safe.
                                 factors.add(new Symbol(-1));
 
-                                symbol.each(function (x) {
-                                    x.negate();
-                                }, true);
+                                symbol.each(function (x) {}, true);
                             }
                         }
killedBy: Algebra should simplify correctly
statusReason: Expected '(-1-x^2+x)^(-1)*(-x+x^2+1)' to equal '-1'.

[Survived] BooleanLiteral
Algebra.js:2743:36
 
                                 symbol.each(function (x) {
                                     x.negate();
-                                }, true);
+                                }, false);
                             }
                         }

[Killed] ConditionalExpression
Algebra.js:2749:24
 
                     }
 
-                    if(factors) {
+                    if(true) {
                         factors.add(new Symbol(gcd));
                     }
killedBy: Algebra should factor correctly
statusReason: Expected '3*a^2*b^4+3*a^4*b^2+a^6+b^6' to equal '(a^2+b^2)^3'.

[Killed] BlockStatement
Algebra.js:2749:33
 
                     }
 
-                    if(factors) {
-                        factors.add(new Symbol(gcd));
-                    }
+                    if(factors) {}
                 }
 
killedBy: Algebra should use simple factor result
statusReason: Expected '(1+2*x)^2' to be '(1/4)*(1+2*x)^2'.

[Killed] ConditionalExpression
Algebra.js:2770:24
                     // they'll be moved to the actual factors.
                     var factor_array = [];
 
-                    if(symbol.isConstant() || symbol.group === S)
+                    if(true)
                         return symbol;
                     var poly = new Polynomial(symbol, variable),
killedBy: Algebra should factor correctly
statusReason: Expected '(-42-x+x^2)*(11+x)^3' to equal '(-7+x)*(11+x)^3*(6+x)'.

[Survived] ConditionalExpression
Algebra.js:2770:47
                     // they'll be moved to the actual factors.
                     var factor_array = [];
 
-                    if(symbol.isConstant() || symbol.group === S)
+                    if(symbol.isConstant() || false)
                         return symbol;
                     var poly = new Polynomial(symbol, variable),

[Killed] ConditionalExpression
Algebra.js:2776:36
                             cnst = poly.coeffs[0],
                             cfactors = core.Math2.ifactor(cnst),
                             roots = __.proots(symbol);
-                    for(var i = 0; i < roots.length; i++) {
+                    for(var i = 0; false; i++) {
                         var r = roots[i],
                                 p = 1;
killedBy: Algebra should factor correctly
statusReason: Expected '(-42-x+x^2)*(-7+x)^3*(11+x)^3' to equal '(-7+x)*(11+x)^3*(6+x)'.

[Timeout] UpdateOperator
Algebra.js:2776:54
                             cnst = poly.coeffs[0],
                             cfactors = core.Math2.ifactor(cnst),
                             roots = __.proots(symbol);
-                    for(var i = 0; i < roots.length; i++) {
+                    for(var i = 0; i < roots.length; i--) {
                         var r = roots[i],
                                 p = 1;

[Killed] ConditionalExpression
Algebra.js:2779:28
                     for(var i = 0; i < roots.length; i++) {
                         var r = roots[i],
                                 p = 1;
-                        if(!isNaN(r)) { //if it's a number
+                        if(false) { //if it's a number
                             for(var x in cfactors) {
                                 //check it's raised to a power
killedBy: Algebra should factor correctly
statusReason: Expected '(-42-x+x^2)*(-7+x)^3*(11+x)^3' to equal '(-7+x)*(11+x)^3*(6+x)'.

[Killed] BooleanLiteral
Algebra.js:2779:28
                     for(var i = 0; i < roots.length; i++) {
                         var r = roots[i],
                                 p = 1;
-                        if(!isNaN(r)) { //if it's a number
+                        if(isNaN(r)) { //if it's a number
                             for(var x in cfactors) {
                                 //check it's raised to a power
killedBy: Algebra should factor correctly
statusReason: Expected '(-42-x+x^2)*(-7+x)^3*(11+x)^3' to equal '(-7+x)*(11+x)^3*(6+x)'.

[Killed] BlockStatement
Algebra.js:2780:52
                         var r = roots[i],
                                 p = 1;
                         if(!isNaN(r)) { //if it's a number
-                            for(var x in cfactors) {
-                                //check it's raised to a power
-                                var n = core.Utils.round(Math.log(x) / Math.log(Math.abs(r)), 8);
-                                if(isInt(n)) {
-                                    r = x; //x must be the root since n gave us a whole
-                                    p = n;
-                                    break;
-                                }
-                            }
+                            for(var x in cfactors) {}
                             var root = new Frac(r),
                                     terms = [new Frac(root.num).negate()];
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ArithmeticOperator
Algebra.js:2782:58
                         if(!isNaN(r)) { //if it's a number
                             for(var x in cfactors) {
                                 //check it's raised to a power
-                                var n = core.Utils.round(Math.log(x) / Math.log(Math.abs(r)), 8);
+                                var n = core.Utils.round(Math.log(x) * Math.log(Math.abs(r)), 8);
                                 if(isInt(n)) {
                                     r = x; //x must be the root since n gave us a whole
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2783:36
                             for(var x in cfactors) {
                                 //check it's raised to a power
                                 var n = core.Utils.round(Math.log(x) / Math.log(Math.abs(r)), 8);
-                                if(isInt(n)) {
+                                if(true) {
                                     r = x; //x must be the root since n gave us a whole
                                     p = n;
killedBy: Algebra should factor correctly
statusReason: Expected '(-42-x+x^2)*(11+x)^3' to equal '(-7+x)*(11+x)^3*(6+x)'.

[Killed] ConditionalExpression
Algebra.js:2783:36
                             for(var x in cfactors) {
                                 //check it's raised to a power
                                 var n = core.Utils.round(Math.log(x) / Math.log(Math.abs(r)), 8);
-                                if(isInt(n)) {
+                                if(false) {
                                     r = x; //x must be the root since n gave us a whole
                                     p = n;
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-3+x)^3*(1+2*x)*(2+x)^3' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2795:32
                             //convert to Frac. The den is coeff of LT and the num is coeff of constant
                             var div = Polynomial.fromArray(terms, poly.variable).fill(),
                                     t = poly.divide(div);
-                            if(t[1].equalsNumber(0)) { //if it's zero we have a root and divide it out
+                            if(false) { //if it's zero we have a root and divide it out
                                 poly = t[0];
                                 // factors.add(div.toSymbol());
killedBy: Algebra should factor correctly
statusReason: Expected '(-42-x+x^2)*(-7+x)^3*(11+x)^3' to equal '(-7+x)*(11+x)^3*(6+x)'.

[Killed] ConditionalExpression
Algebra.js:2795:32
                             //convert to Frac. The den is coeff of LT and the num is coeff of constant
                             var div = Polynomial.fromArray(terms, poly.variable).fill(),
                                     t = poly.divide(div);
-                            if(t[1].equalsNumber(0)) { //if it's zero we have a root and divide it out
+                            if(true) { //if it's zero we have a root and divide it out
                                 poly = t[0];
                                 // factors.add(div.toSymbol());
killedBy: Algebra should factor correctly
statusReason: Expected '(-7+x)*(6+x)^3' to equal '(6+x)^3*(7+x)'.

[Killed] BlockStatement
Algebra.js:2803:47
                         }
                     }
 
-                    if(!poly.equalsNumber(1)) {
-                        poly = __.Factor.search(poly, factors);
-                    }
+                    if(!poly.equalsNumber(1)) {}
 
                     // Move the factors over since all went well.
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2803:24
                         }
                     }
 
-                    if(!poly.equalsNumber(1)) {
+                    if(false) {
                         poly = __.Factor.search(poly, factors);
                     }
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] BlockStatement
Algebra.js:2808:55
                     }
 
                     // Move the factors over since all went well.
-                    factor_array.forEach(function (x) {
-                        factors.add(x);
-                    });
+                    factor_array.forEach(function (x) {});
 
                     return poly.toSymbol();
killedBy: Algebra should use simple factor result
statusReason: Expected '1/4' to be '(1/4)*(1+2*x)^2'.

[Killed] BlockStatement
Algebra.js:2814:26
 
                     return poly.toSymbol();
                 }
-                catch(e) {
-                    return untouched;
-                }
+                catch(e) {}
             },
             search: function (poly, factors, base) {
killedBy: Algebra should also factor correctly
statusReason: Expected '-16*a^2+56*a+32' to equal '-8*(-4+a)*(1+2*a)'.

[Killed] LogicalOperator
Algebra.js:2819:24
                 }
             },
             search: function (poly, factors, base) {
-                base = base || 10; //I like 10 because numbers exhibit similar behaviours at 10
+                base = base && 10; //I like 10 because numbers exhibit similar behaviours at 10
                 var v = poly.variable; //the polynmial variable name
                 /**
killedBy: Algebra should factor correctly
statusReason: Expected '(1/2)*(-13*x-x^2+2*x^3-6)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2819:24
                 }
             },
             search: function (poly, factors, base) {
-                base = base || 10; //I like 10 because numbers exhibit similar behaviours at 10
+                base = false; //I like 10 because numbers exhibit similar behaviours at 10
                 var v = poly.variable; //the polynmial variable name
                 /**
killedBy: Algebra should factor correctly
statusReason: Expected '(-1+x)*(1+x)*(1+x^10+x^12+x^14+x^2+x^4+x^6+x^8)' to equal '(-1+x)*(1+x)*(1+x^2)*(1+x^4)*(1+x^8)'.

[Killed] BlockStatement
Algebra.js:2830:53
                  * @param {int} p - the power at which to create the polynomial
                  * @returns {null|Polynomial} - returns polynomial if successful otherwise null
                  */
-                var check = function (c1, c2, n, p) {
-                    var candidate = Polynomial.fit(c1, c2, n, base, p, v);
-                    if(candidate && candidate.coeffs.length > 1) {
-                        var t = poly.divide(candidate);
-                        if(t[1].equalsNumber(0)) {
-                            factors.add(candidate.toSymbol());
-                            return [t[0], candidate];
-                        }
-                    }
-                    return null;
-                };
+                var check = function (c1, c2, n, p) {};
                 var cnst = poly.coeffs[0];
                 var cfactors = core.Math2.ifactor(cnst);
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.

[Killed] ConditionalExpression
Algebra.js:2832:24
                  */
                 var check = function (c1, c2, n, p) {
                     var candidate = Polynomial.fit(c1, c2, n, base, p, v);
-                    if(candidate && candidate.coeffs.length > 1) {
+                    if(false) {
                         var t = poly.divide(candidate);
                         if(t[1].equalsNumber(0)) {
killedBy: Algebra should factor correctly
statusReason: Expected '-((-5/2)*x-x^2-1)*(-3+x)' to equal '(1/2)*(-3+x)*(1+2*x)*(2+x)'.
