[Killed] BlockStatement
Solve.js:80:49
     core.Settings.BI_SECTION_EPSILON = 1e-12;
 
 
-    core.Symbol.prototype.hasTrig = function () {
-        return this.containsFunction(['cos', 'sin', 'tan', 'cot', 'csc', 'sec']);
-    };
+    core.Symbol.prototype.hasTrig = function () {};
 
     core.Symbol.prototype.hasNegativeTerms = function () {
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0.06782644201779 to equal 0.067826442018.

[Killed] StringLiteral
Solve.js:81:74
 
 
     core.Symbol.prototype.hasTrig = function () {
-        return this.containsFunction(['cos', 'sin', 'tan', 'cot', 'csc', 'sec']);
+        return this.containsFunction(['cos', 'sin', 'tan', 'cot', 'csc', ""]);
     };
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] StringLiteral
Solve.js:81:67
 
 
     core.Symbol.prototype.hasTrig = function () {
-        return this.containsFunction(['cos', 'sin', 'tan', 'cot', 'csc', 'sec']);
+        return this.containsFunction(['cos', 'sin', 'tan', 'cot', "", 'sec']);
     };
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] BlockStatement
Solve.js:84:58
         return this.containsFunction(['cos', 'sin', 'tan', 'cot', 'csc', 'sec']);
     };
 
-    core.Symbol.prototype.hasNegativeTerms = function () {
-        if(this.isComposite()) {
-            for(var x in this.symbols) {
-                var sym = this.symbols[x];
-                if(sym.group === PL && sym.hasNegativeTerms() || this.symbols[x].power.lessThan(0))
-                    return true;
-            }
-        }
-        return false;
-    };
+    core.Symbol.prototype.hasNegativeTerms = function () {};
 
     /* nerdamer version 0.7.x and up allows us to make better use of operator overloading

[NoCoverage] ConditionalExpression
Solve.js:85:12
     };
 
     core.Symbol.prototype.hasNegativeTerms = function () {
-        if(this.isComposite()) {
+        if(false) {
             for(var x in this.symbols) {
                 var sym = this.symbols[x];

[NoCoverage] ConditionalExpression
Solve.js:85:12
     };
 
     core.Symbol.prototype.hasNegativeTerms = function () {
-        if(this.isComposite()) {
+        if(true) {
             for(var x in this.symbols) {
                 var sym = this.symbols[x];

[NoCoverage] BlockStatement
Solve.js:86:40
 
     core.Symbol.prototype.hasNegativeTerms = function () {
         if(this.isComposite()) {
-            for(var x in this.symbols) {
-                var sym = this.symbols[x];
-                if(sym.group === PL && sym.hasNegativeTerms() || this.symbols[x].power.lessThan(0))
-                    return true;
-            }
+            for(var x in this.symbols) {}
         }
         return false;

[NoCoverage] ConditionalExpression
Solve.js:88:20
         if(this.isComposite()) {
             for(var x in this.symbols) {
                 var sym = this.symbols[x];
-                if(sym.group === PL && sym.hasNegativeTerms() || this.symbols[x].power.lessThan(0))
+                if(true)
                     return true;
             }

[NoCoverage] ConditionalExpression
Solve.js:88:20
         if(this.isComposite()) {
             for(var x in this.symbols) {
                 var sym = this.symbols[x];
-                if(sym.group === PL && sym.hasNegativeTerms() || this.symbols[x].power.lessThan(0))
+                if(true && sym.hasNegativeTerms() || this.symbols[x].power.lessThan(0))
                     return true;
             }

[NoCoverage] BooleanLiteral
Solve.js:89:28
             for(var x in this.symbols) {
                 var sym = this.symbols[x];
                 if(sym.group === PL && sym.hasNegativeTerms() || this.symbols[x].power.lessThan(0))
-                    return true;
+                    return false;
             }
         }

[Killed] BlockStatement
Solve.js:99:33
      * As such we can have this data type be supported completely outside of the core.
      * This is an equation that has a left hand side and a right hand side
      */
-    function Equation(lhs, rhs) {
-        if(rhs.isConstant() && lhs.isConstant() && !lhs.equals(rhs) || lhs.equals(core.Settings.IMAGINARY) && rhs.isConstant(true) || rhs.equals(core.Settings.IMAGINARY) && lhs.isConstant(true))
-            throw new core.exceptions.NerdamerValueError(lhs.toString() + ' does not equal ' + rhs.toString());
-        this.LHS = lhs; //left hand side
-        this.RHS = rhs; //right and side
-    }
+    function Equation(lhs, rhs) {}
     ;
 
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'clone' of undefined: 1

[Killed] LogicalOperator
Solve.js:100:12
      * This is an equation that has a left hand side and a right hand side
      */
     function Equation(lhs, rhs) {
-        if(rhs.isConstant() && lhs.isConstant() && !lhs.equals(rhs) || lhs.equals(core.Settings.IMAGINARY) && rhs.isConstant(true) || rhs.equals(core.Settings.IMAGINARY) && lhs.isConstant(true))
+        if(rhs.isConstant() && lhs.isConstant() || !lhs.equals(rhs) || lhs.equals(core.Settings.IMAGINARY) && rhs.isConstant(true) || rhs.equals(core.Settings.IMAGINARY) && lhs.isConstant(true))
             throw new core.exceptions.NerdamerValueError(lhs.toString() + ' does not equal ' + rhs.toString());
         this.LHS = lhs; //left hand side
killedBy: Solve should solve correctly
statusReason: ParseError: x does not equal (314146179365/1073228064103962)*y: 8: undefined

[Killed] LogicalOperator
Solve.js:100:72
      * This is an equation that has a left hand side and a right hand side
      */
     function Equation(lhs, rhs) {
-        if(rhs.isConstant() && lhs.isConstant() && !lhs.equals(rhs) || lhs.equals(core.Settings.IMAGINARY) && rhs.isConstant(true) || rhs.equals(core.Settings.IMAGINARY) && lhs.isConstant(true))
+        if(rhs.isConstant() && lhs.isConstant() && !lhs.equals(rhs) || lhs.equals(core.Settings.IMAGINARY) || rhs.isConstant(true) || rhs.equals(core.Settings.IMAGINARY) && lhs.isConstant(true))
             throw new core.exceptions.NerdamerValueError(lhs.toString() + ' does not equal ' + rhs.toString());
         this.LHS = lhs; //left hand side
killedBy: Solve should solve correctly
statusReason: ParseError: -314146179365*y+1073228064103962*x does not equal 0: 1

[Killed] BlockStatement
Solve.js:110:31
     //UTILS ##!!
 
     Equation.prototype = {
-        toString: function () {
-            return this.LHS.toString() + '=' + this.RHS.toString();
-        },
+        toString: function () {},
         text: function (option) {
             return this.LHS.text(option) + '=' + this.RHS.text(option);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] BlockStatement
Solve.js:113:33
         toString: function () {
             return this.LHS.toString() + '=' + this.RHS.toString();
         },
-        text: function (option) {
-            return this.LHS.text(option) + '=' + this.RHS.text(option);
-        },
+        text: function (option) {},
         toLHS: function (expand) {
             expand = typeof expand === 'undefined' ? true : false;

[Killed] BooleanLiteral
Solve.js:117:61
             return this.LHS.text(option) + '=' + this.RHS.text(option);
         },
         toLHS: function (expand) {
-            expand = typeof expand === 'undefined' ? true : false;
+            expand = typeof expand === 'undefined' ? true : true;
             var eqn;
             if(!expand) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:117:22
             return this.LHS.text(option) + '=' + this.RHS.text(option);
         },
         toLHS: function (expand) {
-            expand = typeof expand === 'undefined' ? true : false;
+            expand = true ? true : false;
             var eqn;
             if(!expand) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:119:16
         toLHS: function (expand) {
             expand = typeof expand === 'undefined' ? true : false;
             var eqn;
-            if(!expand) {
+            if(true) {
                 eqn = this.clone();
             }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BooleanLiteral
Solve.js:119:16
         toLHS: function (expand) {
             expand = typeof expand === 'undefined' ? true : false;
             var eqn;
-            if(!expand) {
+            if(expand) {
                 eqn = this.clone();
             }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:122:18
             if(!expand) {
                 eqn = this.clone();
             }
-            else {
-                eqn = this.removeDenom();
-            }
+            else {}
             var a = eqn.LHS;
             var b = eqn.RHS;
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'LHS' of undefined: 1

[Killed] LogicalOperator
Solve.js:128:16
             var a = eqn.LHS;
             var b = eqn.RHS;
             
-            if(a.isConstant(true) && !b.isConstant(true)) {
+            if(a.isConstant(true) || !b.isConstant(true)) {
                 // Swap them to avoid confusing parser and cause an infinite loop
                 [a, b] = [b, a];
killedBy: Solve should solve correctly
statusReason: Expected '[(-a*b+8)^y^(-1)]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] BlockStatement
Solve.js:128:59
             var a = eqn.LHS;
             var b = eqn.RHS;
             
-            if(a.isConstant(true) && !b.isConstant(true)) {
-                // Swap them to avoid confusing parser and cause an infinite loop
-                [a, b] = [b, a];
-            }
+            if(a.isConstant(true) && !b.isConstant(true)) {}
             var _t = _.subtract(a, b);
             var retval = expand ? _.expand(_t) : _t;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArrayDeclaration
Solve.js:130:26
             
             if(a.isConstant(true) && !b.isConstant(true)) {
                 // Swap them to avoid confusing parser and cause an infinite loop
-                [a, b] = [b, a];
+                [a, b] = [];
             }
             var _t = _.subtract(a, b);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:150:16
             a = _.expand(_.multiply(a, den.clone()));
             b = _.expand(_.multiply(b, den));
             //swap the groups
-            if(b.group === CP && b.group !== CP) {
+            if(true) {
                 var t = a;
                 a = b;
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:150:16
             a = _.expand(_.multiply(a, den.clone()));
             b = _.expand(_.multiply(b, den));
             //swap the groups
-            if(b.group === CP && b.group !== CP) {
+            if(true && b.group !== CP) {
                 var t = a;
                 a = b;
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] BlockStatement
Solve.js:157:32
             }
 
             //scan to eliminate denominators
-            if(a.group === CB) {
-                var t = new Symbol(a.multiplier),
-                        newRHS = b.clone();
-                a.each(function (y) {
-                    if(y.power.lessThan(0))
-                        newRHS = _.divide(newRHS, y);
-                    else
-                        t = _.multiply(t, y);
-                });
-                a = t;
-                b = newRHS;
-
-            }
+            if(a.group === CB) {}
             else if(a.group === CP) {
                 //the logic: loop through each and if it has a denominator then multiply it out on both ends
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:157:16
             }
 
             //scan to eliminate denominators
-            if(a.group === CB) {
+            if(true) {
                 var t = new Symbol(a.multiplier),
                         newRHS = b.clone();
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] BlockStatement
Solve.js:160:37
             if(a.group === CB) {
                 var t = new Symbol(a.multiplier),
                         newRHS = b.clone();
-                a.each(function (y) {
-                    if(y.power.lessThan(0))
-                        newRHS = _.divide(newRHS, y);
-                    else
-                        t = _.multiply(t, y);
-                });
+                a.each(function (y) {});
                 a = t;
                 b = newRHS;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:161:24
                 var t = new Symbol(a.multiplier),
                         newRHS = b.clone();
                 a.each(function (y) {
-                    if(y.power.lessThan(0))
+                    if(true)
                         newRHS = _.divide(newRHS, y);
                     else
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:161:24
                 var t = new Symbol(a.multiplier),
                         newRHS = b.clone();
                 a.each(function (y) {
-                    if(y.power.lessThan(0))
+                    if(false)
                         newRHS = _.divide(newRHS, y);
                     else
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:170:37
                 b = newRHS;
 
             }
-            else if(a.group === CP) {
-                //the logic: loop through each and if it has a denominator then multiply it out on both ends
-                //and then start over
-                for(var x in a.symbols) {
-                    var sym = a.symbols[x];
-                    if(sym.group === CB) {
-                        for(var y in sym.symbols) {
-                            var sym2 = sym.symbols[y];
-                            if(sym2.power.lessThan(0)) {
-                                return new Equation(
-                                        _.expand(_.multiply(sym2.clone().toLinear(), a)),
-                                        _.expand(_.multiply(sym2.clone().toLinear(), b))
-                                        );
-                            }
-                        }
-                    }
-                }
-            }
+            else if(a.group === CP) {}
 
             return new Equation(a, b);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:170:21
                 b = newRHS;
 
             }
-            else if(a.group === CP) {
+            else if(false) {
                 //the logic: loop through each and if it has a denominator then multiply it out on both ends
                 //and then start over
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:173:41
             else if(a.group === CP) {
                 //the logic: loop through each and if it has a denominator then multiply it out on both ends
                 //and then start over
-                for(var x in a.symbols) {
-                    var sym = a.symbols[x];
-                    if(sym.group === CB) {
-                        for(var y in sym.symbols) {
-                            var sym2 = sym.symbols[y];
-                            if(sym2.power.lessThan(0)) {
-                                return new Equation(
-                                        _.expand(_.multiply(sym2.clone().toLinear(), a)),
-                                        _.expand(_.multiply(sym2.clone().toLinear(), b))
-                                        );
-                            }
-                        }
-                    }
-                }
+                for(var x in a.symbols) {}
             }
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:175:42
                 //and then start over
                 for(var x in a.symbols) {
                     var sym = a.symbols[x];
-                    if(sym.group === CB) {
-                        for(var y in sym.symbols) {
-                            var sym2 = sym.symbols[y];
-                            if(sym2.power.lessThan(0)) {
-                                return new Equation(
-                                        _.expand(_.multiply(sym2.clone().toLinear(), a)),
-                                        _.expand(_.multiply(sym2.clone().toLinear(), b))
-                                        );
-                            }
-                        }
-                    }
+                    if(sym.group === CB) {}
                 }
             }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:175:24
                 //and then start over
                 for(var x in a.symbols) {
                     var sym = a.symbols[x];
-                    if(sym.group === CB) {
+                    if(true) {
                         for(var y in sym.symbols) {
                             var sym2 = sym.symbols[y];
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:176:51
                 for(var x in a.symbols) {
                     var sym = a.symbols[x];
                     if(sym.group === CB) {
-                        for(var y in sym.symbols) {
-                            var sym2 = sym.symbols[y];
-                            if(sym2.power.lessThan(0)) {
-                                return new Equation(
-                                        _.expand(_.multiply(sym2.clone().toLinear(), a)),
-                                        _.expand(_.multiply(sym2.clone().toLinear(), b))
-                                        );
-                            }
-                        }
+                        for(var y in sym.symbols) {}
                     }
                 }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:178:32
                     if(sym.group === CB) {
                         for(var y in sym.symbols) {
                             var sym2 = sym.symbols[y];
-                            if(sym2.power.lessThan(0)) {
+                            if(true) {
                                 return new Equation(
                                         _.expand(_.multiply(sym2.clone().toLinear(), a)),
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] ConditionalExpression
Solve.js:178:32
                     if(sym.group === CB) {
                         for(var y in sym.symbols) {
                             var sym2 = sym.symbols[y];
-                            if(sym2.power.lessThan(0)) {
+                            if(false) {
                                 return new Equation(
                                         _.expand(_.multiply(sym2.clone().toLinear(), a)),
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:191:28
 
             return new Equation(a, b);
         },
-        clone: function () {
-            return new Equation(this.LHS.clone(), this.RHS.clone());
-        },
+        clone: function () {},
         sub: function (x, y) {
             var clone = this.clone();
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'LHS' of undefined: 1

[NoCoverage] BlockStatement
Solve.js:194:30
         clone: function () {
             return new Equation(this.LHS.clone(), this.RHS.clone());
         },
-        sub: function (x, y) {
-            var clone = this.clone();
-            clone.LHS = clone.LHS.sub(x.clone(), y.clone());
-            clone.RHS = clone.RHS.sub(x.clone(), y.clone());
-            return clone;
-        },
+        sub: function (x, y) {},
         isZero: function () {
             return core.Utils.evaluate(this.toLHS()).equals(0);

[Killed] BlockStatement
Solve.js:200:29
             clone.RHS = clone.RHS.sub(x.clone(), y.clone());
             return clone;
         },
-        isZero: function () {
-            return core.Utils.evaluate(this.toLHS()).equals(0);
-        },
+        isZero: function () {},
         latex: function (option) {
             return [this.LHS.latex(option), this.RHS.latex(option)].join('=');
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] BlockStatement
Solve.js:203:34
         isZero: function () {
             return core.Utils.evaluate(this.toLHS()).equals(0);
         },
-        latex: function (option) {
-            return [this.LHS.latex(option), this.RHS.latex(option)].join('=');
-        }
+        latex: function (option) {}
     };
     //overwrite the equals function

[Killed] BlockStatement
Solve.js:208:32
         }
     };
     //overwrite the equals function
-    _.equals = function (a, b) {
-        return new Equation(a, b);
-    };
+    _.equals = function (a, b) {};
 
     // Extend simplify
killedBy: Solve should solve correctly
statusReason: ParseError: , is not a valid postfix operator at 29: 29: undefined

[Killed] BlockStatement
Solve.js:215:53
     // Extend simplify
     (function () {
         var simplify = _.functions.simplify[0];
-        _.functions.simplify[0] = function (symbol) {
-            if(symbol instanceof Equation) {
-                symbol.LHS = simplify(symbol.LHS);
-                symbol.RHS = simplify(symbol.RHS);
-                return symbol;
-            }
-            // Just call the original simplify
-            return simplify(symbol);
-        };
+        _.functions.simplify[0] = function (symbol) {};
     })();
 
killedBy: Algebra should simplify correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] ConditionalExpression
Solve.js:216:16
     (function () {
         var simplify = _.functions.simplify[0];
         _.functions.simplify[0] = function (symbol) {
-            if(symbol instanceof Equation) {
+            if(true) {
                 symbol.LHS = simplify(symbol.LHS);
                 symbol.RHS = simplify(symbol.RHS);
killedBy: Algebra should simplify correctly
statusReason: ParseError: Cannot read property 'multiplier' of undefined: 1

[NoCoverage] BlockStatement
Solve.js:216:44
     (function () {
         var simplify = _.functions.simplify[0];
         _.functions.simplify[0] = function (symbol) {
-            if(symbol instanceof Equation) {
-                symbol.LHS = simplify(symbol.LHS);
-                symbol.RHS = simplify(symbol.RHS);
-                return symbol;
-            }
+            if(symbol instanceof Equation) {}
             // Just call the original simplify
             return simplify(symbol);

[NoCoverage] BlockStatement
Solve.js:231:58
      * @param {Symbol} symbol
      * @returns {Expression}
      */
-    core.Expression.prototype.equals = function (symbol) {
-        if(symbol instanceof core.Expression)
-            symbol = symbol.symbol; //grab the symbol if it's an expression
-        var eq = new Equation(this.symbol, symbol);
-        return eq;
-    };
+    core.Expression.prototype.equals = function (symbol) {};
 
     core.Expression.prototype.solveFor = function (x) {

[NoCoverage] ConditionalExpression
Solve.js:232:12
      * @returns {Expression}
      */
     core.Expression.prototype.equals = function (symbol) {
-        if(symbol instanceof core.Expression)
+        if(false)
             symbol = symbol.symbol; //grab the symbol if it's an expression
         var eq = new Equation(this.symbol, symbol);

[NoCoverage] ConditionalExpression
Solve.js:232:12
      * @returns {Expression}
      */
     core.Expression.prototype.equals = function (symbol) {
-        if(symbol instanceof core.Expression)
+        if(true)
             symbol = symbol.symbol; //grab the symbol if it's an expression
         var eq = new Equation(this.symbol, symbol);

[NoCoverage] BlockStatement
Solve.js:238:55
         return eq;
     };
 
-    core.Expression.prototype.solveFor = function (x) {
-        var symbol;
-        if(this.symbol instanceof Equation) {
-            //exit right away if we already have the answer
-            //check the LHS
-            if(this.symbol.LHS.isConstant() && this.symbol.RHS.equals(x))
-                return new core.Expression(this.symbol.LHS);
-
-            //check the RHS
-            if(this.symbol.RHS.isConstant() && this.symbol.LHS.equals(x))
-                return new core.Expression(this.symbol.RHS);
-
-            //otherwise just bring it to LHS
-            symbol = this.symbol.toLHS();
-        }
-        else {
-            symbol = this.symbol;
-        }
-
-        return solve(symbol, x).map(function (x) {
-            return new core.Expression(x);
-        });
-    };
+    core.Expression.prototype.solveFor = function (x) {};
 
     core.Expression.prototype.expand = function () {

[NoCoverage] ConditionalExpression
Solve.js:240:12
 
     core.Expression.prototype.solveFor = function (x) {
         var symbol;
-        if(this.symbol instanceof Equation) {
+        if(false) {
             //exit right away if we already have the answer
             //check the LHS

[NoCoverage] ConditionalExpression
Solve.js:240:12
 
     core.Expression.prototype.solveFor = function (x) {
         var symbol;
-        if(this.symbol instanceof Equation) {
+        if(true) {
             //exit right away if we already have the answer
             //check the LHS

[NoCoverage] LogicalOperator
Solve.js:243:16
         if(this.symbol instanceof Equation) {
             //exit right away if we already have the answer
             //check the LHS
-            if(this.symbol.LHS.isConstant() && this.symbol.RHS.equals(x))
+            if(this.symbol.LHS.isConstant() || this.symbol.RHS.equals(x))
                 return new core.Expression(this.symbol.LHS);
 
