[NoCoverage] ConditionalExpression
Solve.js:243:16
         if(this.symbol instanceof Equation) {
             //exit right away if we already have the answer
             //check the LHS
-            if(this.symbol.LHS.isConstant() && this.symbol.RHS.equals(x))
+            if(true)
                 return new core.Expression(this.symbol.LHS);
 

[NoCoverage] ConditionalExpression
Solve.js:247:16
                 return new core.Expression(this.symbol.LHS);
 
             //check the RHS
-            if(this.symbol.RHS.isConstant() && this.symbol.LHS.equals(x))
+            if(false)
                 return new core.Expression(this.symbol.RHS);
 

[NoCoverage] ConditionalExpression
Solve.js:247:16
                 return new core.Expression(this.symbol.LHS);
 
             //check the RHS
-            if(this.symbol.RHS.isConstant() && this.symbol.LHS.equals(x))
+            if(true)
                 return new core.Expression(this.symbol.RHS);
 

[NoCoverage] BlockStatement
Solve.js:253:14
             //otherwise just bring it to LHS
             symbol = this.symbol.toLHS();
         }
-        else {
-            symbol = this.symbol;
-        }
+        else {}
 
         return solve(symbol, x).map(function (x) {

[NoCoverage] BlockStatement
Solve.js:257:50
             symbol = this.symbol;
         }
 
-        return solve(symbol, x).map(function (x) {
-            return new core.Expression(x);
-        });
+        return solve(symbol, x).map(function (x) {});
     };
 

[Killed] BlockStatement
Solve.js:262:52
         });
     };
 
-    core.Expression.prototype.expand = function () {
-        if(this.symbol instanceof Equation) {
-            var clone = this.symbol.clone();
-            clone.RHS = _.expand(clone.RHS);
-            clone.LHS = _.expand(clone.LHS);
-            return new core.Expression(clone);
-        }
-        return new core.Expression(_.expand(this.symbol));
-    };
+    core.Expression.prototype.expand = function () {};
 
     core.Expression.prototype.variables = function () {
killedBy: Nerdamer core should expand square roots
statusReason: TypeError: Cannot read property 'toString' of undefined

[Killed] ConditionalExpression
Solve.js:263:12
     };
 
     core.Expression.prototype.expand = function () {
-        if(this.symbol instanceof Equation) {
+        if(true) {
             var clone = this.symbol.clone();
             clone.RHS = _.expand(clone.RHS);
killedBy: Nerdamer core should expand square roots
statusReason: TypeError: Cannot read property 'group' of undefined

[Survived] ConditionalExpression
Solve.js:263:12
     };
 
     core.Expression.prototype.expand = function () {
-        if(this.symbol instanceof Equation) {
+        if(false) {
             var clone = this.symbol.clone();
             clone.RHS = _.expand(clone.RHS);

[Killed] BlockStatement
Solve.js:272:55
         return new core.Expression(_.expand(this.symbol));
     };
 
-    core.Expression.prototype.variables = function () {
-        if(this.symbol instanceof Equation)
-            return core.Utils.arrayUnique(variables(this.symbol.LHS).concat(variables(this.symbol.RHS)));
-        return variables(this.symbol);
-    };
+    core.Expression.prototype.variables = function () {};
 
 
killedBy: Nerdamer core should ignore constants and special values
statusReason: Expected undefined to equal [  ].

[Survived] ConditionalExpression
Solve.js:273:12
     };
 
     core.Expression.prototype.variables = function () {
-        if(this.symbol instanceof Equation)
+        if(false)
             return core.Utils.arrayUnique(variables(this.symbol.LHS).concat(variables(this.symbol.RHS)));
         return variables(this.symbol);

[Survived] ConditionalExpression
Solve.js:273:12
     };
 
     core.Expression.prototype.variables = function () {
-        if(this.symbol instanceof Equation)
+        if(true)
             return core.Utils.arrayUnique(variables(this.symbol.LHS).concat(variables(this.symbol.RHS)));
         return variables(this.symbol);

[NoCoverage] BlockStatement
Solve.js:280:33
 
 
 
-    var setEq = function (a, b) {
-        return _.equals(a, b);
-    };
+    var setEq = function (a, b) {};
 
     //link the Equation class back to the core

[Killed] BlockStatement
Solve.js:288:64
     core.Equation = Equation;
 
     //Loops through an array and attempts to fails a test. Stops if manages to fail.
-    var checkAll = core.Utils.checkAll = function (args, test) {
-        for(var i = 0; i < args.length; i++)
-            if(test(args[i]))
-                return false;
-        return true;
-    };
+    var checkAll = core.Utils.checkAll = function (args, test) {};
 
     //version solve
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:289:24
 
     //Loops through an array and attempts to fails a test. Stops if manages to fail.
     var checkAll = core.Utils.checkAll = function (args, test) {
-        for(var i = 0; i < args.length; i++)
+        for(var i = 0; false; i++)
             if(test(args[i]))
                 return false;
killedBy: Solve should solve correctly
statusReason: ParseError: -i is not a valid variable name: 1

[Killed] UpdateOperator
Solve.js:289:41
 
     //Loops through an array and attempts to fails a test. Stops if manages to fail.
     var checkAll = core.Utils.checkAll = function (args, test) {
-        for(var i = 0; i < args.length; i++)
+        for(var i = 0; i < args.length; i--)
             if(test(args[i]))
                 return false;
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'group' of undefined: 1

[Killed] ConditionalExpression
Solve.js:290:16
     //Loops through an array and attempts to fails a test. Stops if manages to fail.
     var checkAll = core.Utils.checkAll = function (args, test) {
         for(var i = 0; i < args.length; i++)
-            if(test(args[i]))
+            if(false)
                 return false;
         return true;
killedBy: Solve should solve correctly
statusReason: ParseError: -i is not a valid variable name: 1

[Killed] ConditionalExpression
Solve.js:290:16
     //Loops through an array and attempts to fails a test. Stops if manages to fail.
     var checkAll = core.Utils.checkAll = function (args, test) {
         for(var i = 0; i < args.length; i++)
-            if(test(args[i]))
+            if(true)
                 return false;
         return true;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BooleanLiteral
Solve.js:291:24
     var checkAll = core.Utils.checkAll = function (args, test) {
         for(var i = 0; i < args.length; i++)
             if(test(args[i]))
-                return false;
+                return true;
         return true;
     };
killedBy: Solve should solve correctly
statusReason: ParseError: -i is not a valid variable name: 1

[Killed] BlockStatement
Solve.js:299:40
     var __ = core.Solve = {
         version: '2.0.3',
         solutions: [],
-        solve: function (eq, variable) {
-            var solution = solve(eq, String(variable));
-            return new core.Vector(solution);
-            //return new core.Vector(solve(eq.toString(), variable ? variable.toString() : variable));
-        },
+        solve: function (eq, variable) {},
         /**
          * Brings the equation to LHS. A string can be supplied which will be converted to an Equation
killedBy: Solve should solve correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] BlockStatement
Solve.js:309:39
          * @param {Equation|String} eqn
          * @returns {Symbol}
          */
-        toLHS: function (eqn, expand) {
-            if(isSymbol(eqn))
-                return eqn;
-            //If it's an equation then call its toLHS function instead
-            if(!(eqn instanceof Equation)) {
-                var es = eqn.split('=');
-                //convert falsey values to zero
-                es[1] = es[1] || '0';
-                eqn = new Equation(_.parse(es[0]), _.parse(es[1]));
-            }
-            return eqn.toLHS(expand);
-        },
+        toLHS: function (eqn, expand) {},
 //        getSystemVariables: function(eqns) {
 //            vars = variables(eqns[0], null, null, true);
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'getNum' of undefined: 1

[Killed] ConditionalExpression
Solve.js:310:16
          * @returns {Symbol}
          */
         toLHS: function (eqn, expand) {
-            if(isSymbol(eqn))
+            if(true)
                 return eqn;
             //If it's an equation then call its toLHS function instead
killedBy: Solve should solve correctly
statusReason: ParseError: (intermediate value)(intermediate value)(intermediate value).getNum is not a function: 1

[Killed] ConditionalExpression
Solve.js:310:16
          * @returns {Symbol}
          */
         toLHS: function (eqn, expand) {
-            if(isSymbol(eqn))
+            if(false)
                 return eqn;
             //If it's an equation then call its toLHS function instead
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:313:16
             if(isSymbol(eqn))
                 return eqn;
             //If it's an equation then call its toLHS function instead
-            if(!(eqn instanceof Equation)) {
+            if(false) {
                 var es = eqn.split('=');
                 //convert falsey values to zero
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:313:44
             if(isSymbol(eqn))
                 return eqn;
             //If it's an equation then call its toLHS function instead
-            if(!(eqn instanceof Equation)) {
-                var es = eqn.split('=');
-                //convert falsey values to zero
-                es[1] = es[1] || '0';
-                eqn = new Equation(_.parse(es[0]), _.parse(es[1]));
-            }
+            if(!(eqn instanceof Equation)) {}
             return eqn.toLHS(expand);
         },
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: eqn.toLHS is not a function

[Killed] StringLiteral
Solve.js:314:36
                 return eqn;
             //If it's an equation then call its toLHS function instead
             if(!(eqn instanceof Equation)) {
-                var es = eqn.split('=');
+                var es = eqn.split("");
                 //convert falsey values to zero
                 es[1] = es[1] || '0';
killedBy: Solve should solve system of equations correctly
statusReason: ParseError: Unexpected token!: 1

[Killed] ConditionalExpression
Solve.js:316:25
             if(!(eqn instanceof Equation)) {
                 var es = eqn.split('=');
                 //convert falsey values to zero
-                es[1] = es[1] || '0';
+                es[1] = false;
                 eqn = new Equation(_.parse(es[0]), _.parse(es[1]));
             }
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] ConditionalExpression
Solve.js:316:25
             if(!(eqn instanceof Equation)) {
                 var es = eqn.split('=');
                 //convert falsey values to zero
-                es[1] = es[1] || '0';
+                es[1] = true;
                 eqn = new Equation(_.parse(es[0]), _.parse(es[1]));
             }
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] BlockStatement
Solve.js:340:47
          */
         solveCircle: function (eqns, vars) {
             // Convert the variables to symbols
-            var svars = vars.map(function (x) {
-                return _.parse(x)
-            });
+            var svars = vars.map(function (x) {});
 
             var deg = [];
killedBy: Solve should solve circle equations
statusReason: Error: You must specify the variable for multivariate polynomials!

[Killed] ConditionalExpression
Solve.js:349:28
             var solutions = [];
 
             // Get the degree for the equations
-            for(var i = 0; i < eqns.length; i++) {
+            for(var i = 0; false; i++) {
                 var d = [];
                 for(var j = 0; j < svars.length; j++) {
killedBy: Solve should solve circle equations
statusReason: TypeError: Cannot read property '2' of undefined

[Killed] BlockStatement
Solve.js:349:50
             var solutions = [];
 
             // Get the degree for the equations
-            for(var i = 0; i < eqns.length; i++) {
-                var d = [];
-                for(var j = 0; j < svars.length; j++) {
-                    d.push(Number(core.Algebra.degree(eqns[i], svars[j])));
-                }
-                // Store the total degree
-                d.push(core.Utils.arraySum(d, true));
-                deg.push(d);
-            }
+            for(var i = 0; i < eqns.length; i++) {}
 
             var a = eqns[0];
killedBy: Solve should solve circle equations
statusReason: TypeError: Cannot read property '2' of undefined

[Killed] ConditionalExpression
Solve.js:351:32
             // Get the degree for the equations
             for(var i = 0; i < eqns.length; i++) {
                 var d = [];
-                for(var j = 0; j < svars.length; j++) {
+                for(var j = 0; false; j++) {
                     d.push(Number(core.Algebra.degree(eqns[i], svars[j])));
                 }
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] BlockStatement
Solve.js:351:55
             // Get the degree for the equations
             for(var i = 0; i < eqns.length; i++) {
                 var d = [];
-                for(var j = 0; j < svars.length; j++) {
-                    d.push(Number(core.Algebra.degree(eqns[i], svars[j])));
-                }
+                for(var j = 0; j < svars.length; j++) {}
                 // Store the total degree
                 d.push(core.Utils.arraySum(d, true));
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] BooleanLiteral
Solve.js:355:47
                     d.push(Number(core.Algebra.degree(eqns[i], svars[j])));
                 }
                 // Store the total degree
-                d.push(core.Utils.arraySum(d, true));
+                d.push(core.Utils.arraySum(d, false));
                 deg.push(d);
             }
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] BlockStatement
Solve.js:362:39
             var a = eqns[0];
             var b = eqns[1];
 
-            if(deg[0][2] > deg[1][2]) {
-                [b, a] = [a, b];
-                [deg[1], deg[0]] = [deg[0], deg[1]];
-            }
+            if(deg[0][2] > deg[1][2]) {}
 
             // Only solve it's truly a circle
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] ConditionalExpression
Solve.js:362:16
             var a = eqns[0];
             var b = eqns[1];
 
-            if(deg[0][2] > deg[1][2]) {
+            if(false) {
                 [b, a] = [a, b];
                 [deg[1], deg[0]] = [deg[0], deg[1]];
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] ArrayDeclaration
Solve.js:363:26
             var b = eqns[1];
 
             if(deg[0][2] > deg[1][2]) {
-                [b, a] = [a, b];
+                [b, a] = [];
                 [deg[1], deg[0]] = [deg[0], deg[1]];
             }
killedBy: Solve should solve circle equations
statusReason: Expected 'x,0,y,0' to equal 'x,1,0,y,0,1'.

[Killed] ConditionalExpression
Solve.js:368:16
             }
 
             // Only solve it's truly a circle
-            if(deg[0][0] === 1 && deg[0][2] === 2 && deg[1][0] === 2 && deg[1][2] === 4) {
+            if(false) {
                 // For clarity we'll refer to the variables as x and y
                 var x = vars[0];
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Survived] ConditionalExpression
Solve.js:368:73
             }
 
             // Only solve it's truly a circle
-            if(deg[0][0] === 1 && deg[0][2] === 2 && deg[1][0] === 2 && deg[1][2] === 4) {
+            if(deg[0][0] === 1 && deg[0][2] === 2 && deg[1][0] === 2 && true) {
                 // For clarity we'll refer to the variables as x and y
                 var x = vars[0];

[Killed] BlockStatement
Solve.js:374:113
                 var y = vars[1];
 
                 // We can now get the two points for y
-                var y_points = solve(_.parse(b, knownVariable(x, solve(_.parse(a), x)[0])), y).map(function (x) {
-                    return x.toString();
-                });
+                var y_points = solve(_.parse(b, knownVariable(x, solve(_.parse(a), x)[0])), y).map(function (x) {});
 
                 // Since we now know y we can get the two x points from the first equation
killedBy: Solve should solve circle equations
statusReason: Expected 'x,-(-1+undefined),y,,' to equal 'x,1,0,y,0,1'.

[Killed] ConditionalExpression
Solve.js:383:20
                     solve(_.parse(a, knownVariable(y, y_points[0])))[0].toString()
                 ];
 
-                if(y_points[1]) {
+                if(false) {
                     x_points.push(solve(_.parse(a, knownVariable(y, y_points[1])))[0].toString());
                 }
killedBy: Solve should solve circle equations
statusReason: Expected 'x,1,y,0,1' to equal 'x,1,0,y,0,1'.

[Killed] BlockStatement
Solve.js:383:33
                     solve(_.parse(a, knownVariable(y, y_points[0])))[0].toString()
                 ];
 
-                if(y_points[1]) {
-                    x_points.push(solve(_.parse(a, knownVariable(y, y_points[1])))[0].toString());
-                }
+                if(y_points[1]) {}
 
                 if(Settings.SOLUTIONS_AS_OBJECT) {
killedBy: Solve should solve circle equations
statusReason: Expected 'x,1,y,0,1' to equal 'x,1,0,y,0,1'.

[Killed] ConditionalExpression
Solve.js:387:20
                     x_points.push(solve(_.parse(a, knownVariable(y, y_points[1])))[0].toString());
                 }
 
-                if(Settings.SOLUTIONS_AS_OBJECT) {
+                if(true) {
                     var solutions = {};
                     solutions[x] = x_points;
killedBy: Solve should solve circle equations
statusReason: Expected '[object Object]' to equal 'x,1,0,y,0,1'.

[NoCoverage] BlockStatement
Solve.js:387:50
                     x_points.push(solve(_.parse(a, knownVariable(y, y_points[1])))[0].toString());
                 }
 
-                if(Settings.SOLUTIONS_AS_OBJECT) {
-                    var solutions = {};
-                    solutions[x] = x_points;
-                    solutions[y] = y_points;
-                }
+                if(Settings.SOLUTIONS_AS_OBJECT) {}
                 else {
                     y_points.unshift(y);

[Killed] BlockStatement
Solve.js:392:22
                     solutions[x] = x_points;
                     solutions[y] = y_points;
                 }
-                else {
-                    y_points.unshift(y);
-                    x_points.unshift(x);
-                    solutions = [x_points, y_points];
-                }
+                else {}
             }
 
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] ArrayDeclaration
Solve.js:395:33
                 else {
                     y_points.unshift(y);
                     x_points.unshift(x);
-                    solutions = [x_points, y_points];
+                    solutions = [];
                 }
             }
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] ConditionalExpression
Solve.js:409:16
          * @returns {Array}
          */
         solveNonLinearSystem: function (eqns, tries, start) {
-            if(tries < 0) {
+            if(true) {
                 return [];//can't find a solution
             }
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2'.

[NoCoverage] BlockStatement
Solve.js:409:27
          * @returns {Array}
          */
         solveNonLinearSystem: function (eqns, tries, start) {
-            if(tries < 0) {
-                return [];//can't find a solution
-            }
+            if(tries < 0) {}
 
             start = typeof start === 'undefined' ? core.Settings.NON_LINEAR_START : start;

[Killed] ConditionalExpression
Solve.js:413:21
                 return [];//can't find a solution
             }
 
-            start = typeof start === 'undefined' ? core.Settings.NON_LINEAR_START : start;
+            start = true ? core.Settings.NON_LINEAR_START : start;
 
             //the maximum number of times to jump
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2,z,3'.

[Killed] ConditionalExpression
Solve.js:413:21
                 return [];//can't find a solution
             }
 
-            start = typeof start === 'undefined' ? core.Settings.NON_LINEAR_START : start;
+            start = false ? core.Settings.NON_LINEAR_START : start;
 
             //the maximum number of times to jump
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,NaN,y,NaN' to equal 'x,1,y,2'.

[Killed] ArithmeticOperator
Solve.js:419:38
             var max_tries = core.Settings.MAX_NON_LINEAR_TRIES;
 
             //halfway through the tries
-            var halfway = Math.floor(max_tries / 2);
+            var halfway = Math.floor(max_tries * 2);
 
             //initialize the number of tries to 10 if not specified
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2,z,3'.

[Killed] ConditionalExpression
Solve.js:422:21
             var halfway = Math.floor(max_tries / 2);
 
             //initialize the number of tries to 10 if not specified
-            tries = typeof tries === 'undefined' ? max_tries : tries;
+            tries = false ? max_tries : tries;
 
             //a point at which we check to see if we're converging. By inspection it seems that we can
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,7,y,-4,z,3' to equal 'x,1,y,2,z,3'.

[Survived] ConditionalExpression
Solve.js:422:21
             var halfway = Math.floor(max_tries / 2);
 
             //initialize the number of tries to 10 if not specified
-            tries = typeof tries === 'undefined' ? max_tries : tries;
+            tries = true ? max_tries : tries;
 
             //a point at which we check to see if we're converging. By inspection it seems that we can

[Killed] BooleanLiteral
Solve.js:432:25
             var jump = core.Settings.NON_LINEAR_JUMP_SIZE;
 
             //used to check if we actually found a solution or if we gave up. Assume we will find a solution.
-            var found = true;
+            var found = false;
 
             var create_subs = function (vars, matrix) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:434:55
             //used to check if we actually found a solution or if we gave up. Assume we will find a solution.
             var found = true;
 
-            var create_subs = function (vars, matrix) {
-                return vars.map(function (x, i) {
-                    return Number(matrix.get(i, 0));
-                });
-            };
+            var create_subs = function (vars, matrix) {};
 
             var vars = core.Utils.arrayGetVariables(eqns);
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,NaN,y,NaN' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:435:49
             var found = true;
 
             var create_subs = function (vars, matrix) {
-                return vars.map(function (x, i) {
-                    return Number(matrix.get(i, 0));
-                });
+                return vars.map(function (x, i) {});
             };
 
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,NaN,y,NaN' to equal 'x,1,y,2'.

[NoCoverage] BlockStatement
Solve.js:441:74
             };
 
             var vars = core.Utils.arrayGetVariables(eqns);
-            var jacobian = core.Matrix.jacobian(eqns, vars, function (x) {
-                return build(x, vars);
-            }, true);
+            var jacobian = core.Matrix.jacobian(eqns, vars, function (x) {}, true);
 
             var max_iter = core.Settings.MAX_NEWTON_ITERATIONS;

[Survived] BooleanLiteral
Solve.js:443:16
             var vars = core.Utils.arrayGetVariables(eqns);
             var jacobian = core.Matrix.jacobian(eqns, vars, function (x) {
                 return build(x, vars);
-            }, true);
+            }, false);
 
             var max_iter = core.Settings.MAX_NEWTON_ITERATIONS;

[Killed] BlockStatement
Solve.js:448:49
             var max_iter = core.Settings.MAX_NEWTON_ITERATIONS;
             var o, y, iters, xn1, norm, lnorm, xn, d;
 
-            var f_eqns = eqns.map(function (eq) {
-                return build(eq, vars);
-            });
+            var f_eqns = eqns.map(function (eq) {});
 
             var J = jacobian.map(function (e) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:452:47
                 return build(eq, vars);
             });
 
-            var J = jacobian.map(function (e) {
-                return build(e, vars);
-            }, true);
+            var J = jacobian.map(function (e) {}, true);
             //initial values
             xn1 = core.Matrix.cMatrix(0, vars);
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BooleanLiteral
Solve.js:454:16
 
             var J = jacobian.map(function (e) {
                 return build(e, vars);
-            }, true);
+            }, false);
             //initial values
             xn1 = core.Matrix.cMatrix(0, vars);
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] ConditionalExpression
Solve.js:466:20
             //start of algorithm
             do {
                 //if we've reached the max iterations then exit
-                if(iters > max_iter) {
+                if(true) {
                     break;
                     found = false;
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,0.01,y,0.01' to equal 'x,1,y,2'.

[Timeout] ConditionalExpression
Solve.js:466:20
             //start of algorithm
             do {
                 //if we've reached the max iterations then exit
-                if(iters > max_iter) {
+                if(false) {
                     break;
                     found = false;

[NoCoverage] BooleanLiteral
Solve.js:468:29
                 //if we've reached the max iterations then exit
                 if(iters > max_iter) {
                     break;
-                    found = false;
+                    found = true;
                 }
 

[Killed] BlockStatement
Solve.js:478:48
                 xn = c.clone();
 
                 //make all the substitutions for each of the equations
-                f_eqns.forEach(function (f, i) {
-                    c.set(i, 0, f.apply(null, o));
-                });
+                f_eqns.forEach(function (f, i) {});
 
                 var m = new core.Matrix();
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-0.00884777227959,y,-0.01055065057615' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:483:44
                 });
 
                 var m = new core.Matrix();
-                J.each(function (fn, i, j) {
-                    var ans = fn.apply(null, o);
-                    m.set(i, j, ans);
-                });
+                J.each(function (fn, i, j) {});
 
                 m = m.invert();
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:496:50
                 //the callback is to avoid overflow in the coeffient denonimator
                 //it converts it to a decimal and then back to a fraction. Some precision
                 //is lost be it's better than overflow. 
-                d = y.subtract(xn1, function (x) {
-                    return _.parse(Number(x));
-                });
+                d = y.subtract(xn1, function (x) {});
 
                 xn1 = xn.add(y, function (x) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-6.99700289913026,y,9.99700289913026' to equal 'x,1,y,2'.
