[Killed] BlockStatement
Algebra.js:4023:59
                     o.depth++;
                 });
             }
-            else if(g === EX && symbol.value === v.value) {
-                o.sd.push(symbol.power.clone());
-            }
+            else if(g === EX && symbol.value === v.value) {}
             else if(g === S && symbol.value === v.value) {
                 o.nd.push(_.parse(symbol.power));
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected '2' to equal 'max(2,x)'.

[Killed] BlockStatement
Algebra.js:4026:58
             else if(g === EX && symbol.value === v.value) {
                 o.sd.push(symbol.power.clone());
             }
-            else if(g === S && symbol.value === v.value) {
-                o.nd.push(_.parse(symbol.power));
-            }
+            else if(g === S && symbol.value === v.value) {}
             else
                 o.nd.push(new Symbol(0));
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'undefined' to equal '5'.

[Killed] ConditionalExpression
Algebra.js:4026:21
             else if(g === EX && symbol.value === v.value) {
                 o.sd.push(symbol.power.clone());
             }
-            else if(g === S && symbol.value === v.value) {
+            else if(false) {
                 o.nd.push(_.parse(symbol.power));
             }
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected '0' to equal '5'.

[Killed] ConditionalExpression
Algebra.js:4033:23
                 o.nd.push(new Symbol(0));
 
             //get the max out of the array
-            var deg = o.nd.length > 0 ? core.Utils.arrayMax(o.nd) : undefined;
+            var deg = false ? core.Utils.arrayMax(o.nd) : undefined;
 
             if(o.depth === 0 && o.sd.length > 0) {
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'undefined' to equal '5'.

[Killed] ConditionalExpression
Algebra.js:4033:23
                 o.nd.push(new Symbol(0));
 
             //get the max out of the array
-            var deg = o.nd.length > 0 ? core.Utils.arrayMax(o.nd) : undefined;
+            var deg = true ? core.Utils.arrayMax(o.nd) : undefined;
 
             if(o.depth === 0 && o.sd.length > 0) {
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'max(-Infinity,a,b,c)' to equal 'max(a,b,c)'.

[Killed] ConditionalExpression
Algebra.js:4035:16
             //get the max out of the array
             var deg = o.nd.length > 0 ? core.Utils.arrayMax(o.nd) : undefined;
 
-            if(o.depth === 0 && o.sd.length > 0) {
+            if(true) {
                 if(deg !== undefined)
                     o.sd.unshift(deg);
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'max(5,5,2,1)' to equal '5'.

[Killed] ConditionalExpression
Algebra.js:4035:16
             //get the max out of the array
             var deg = o.nd.length > 0 ? core.Utils.arrayMax(o.nd) : undefined;
 
-            if(o.depth === 0 && o.sd.length > 0) {
+            if(true && o.sd.length > 0) {
                 if(deg !== undefined)
                     o.sd.unshift(deg);
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'max(2,2,x)' to equal 'max(2,x)'.

[Killed] ConditionalExpression
Algebra.js:4036:20
             var deg = o.nd.length > 0 ? core.Utils.arrayMax(o.nd) : undefined;
 
             if(o.depth === 0 && o.sd.length > 0) {
-                if(deg !== undefined)
+                if(true)
                     o.sd.unshift(deg);
                 return _.symfunction('max', o.sd);
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'max(,a,b,c)' to equal 'max(a,b,c)'.

[Killed] ConditionalExpression
Algebra.js:4036:20
             var deg = o.nd.length > 0 ? core.Utils.arrayMax(o.nd) : undefined;
 
             if(o.depth === 0 && o.sd.length > 0) {
-                if(deg !== undefined)
+                if(false)
                     o.sd.unshift(deg);
                 return _.symfunction('max', o.sd);
killedBy: Algebra should correctly determine the polynomial degree
statusReason: Expected 'max(x)' to equal 'max(2,x)'.

[Killed] StringLiteral
Algebra.js:4038:38
             if(o.depth === 0 && o.sd.length > 0) {
                 if(deg !== undefined)
                     o.sd.unshift(deg);
-                return _.symfunction('max', o.sd);
+                return _.symfunction("", o.sd);
             }
             if(!core.Utils.isSymbol(deg))
killedBy: Algebra should correctly determine the polynomial degree
statusReason: ParseError:  is not a valid variable name: 1

[Killed] BooleanLiteral
Algebra.js:4040:16
                     o.sd.unshift(deg);
                 return _.symfunction('max', o.sd);
             }
-            if(!core.Utils.isSymbol(deg))
+            if(core.Utils.isSymbol(deg))
                 deg = _.parse(deg);
             //return the degree
killedBy: Algebra should correctly determine the polynomial degree
statusReason: ParseError: Unexpected token!: 1

[Killed] ConditionalExpression
Algebra.js:4040:16
                     o.sd.unshift(deg);
                 return _.symfunction('max', o.sd);
             }
-            if(!core.Utils.isSymbol(deg))
+            if(false)
                 deg = _.parse(deg);
             //return the degree
killedBy: Algebra should correctly determine the polynomial degree
statusReason: ParseError: Unexpected token!: 1

[Killed] ConditionalExpression
Algebra.js:4054:16
          * @returns {Object|Symbol[]}
          */
         sqComplete: function (symbol, v, raw) {
-            if(!core.Utils.isSymbol(v))
+            if(false)
                 v = _.parse(v);
             var stop = function (msg) {
killedBy: Algebra should complete the square
statusReason: Expected '-18*x+9*x^2+17' to equal '(-3+3*x)^2+8'.

[Killed] BooleanLiteral
Algebra.js:4054:16
          * @returns {Object|Symbol[]}
          */
         sqComplete: function (symbol, v, raw) {
-            if(!core.Utils.isSymbol(v))
+            if(core.Utils.isSymbol(v))
                 v = _.parse(v);
             var stop = function (msg) {
killedBy: Algebra should complete the square
statusReason: Expected '-18*x+9*x^2+17' to equal '(-3+3*x)^2+8'.

[NoCoverage] BlockStatement
Algebra.js:4056:39
         sqComplete: function (symbol, v, raw) {
             if(!core.Utils.isSymbol(v))
                 v = _.parse(v);
-            var stop = function (msg) {
-                msg = msg || 'Stopping';
-                throw new core.exceptions.ValueLimitExceededError(msg);
-            };
+            var stop = function (msg) {};
             //if not CP then nothing to do
             if(!symbol.isPoly(true))

[NoCoverage] ConditionalExpression
Algebra.js:4057:23
             if(!core.Utils.isSymbol(v))
                 v = _.parse(v);
             var stop = function (msg) {
-                msg = msg || 'Stopping';
+                msg = false;
                 throw new core.exceptions.ValueLimitExceededError(msg);
             };

[NoCoverage] LogicalOperator
Algebra.js:4057:23
             if(!core.Utils.isSymbol(v))
                 v = _.parse(v);
             var stop = function (msg) {
-                msg = msg || 'Stopping';
+                msg = msg && 'Stopping';
                 throw new core.exceptions.ValueLimitExceededError(msg);
             };

[Killed] ConditionalExpression
Algebra.js:4061:16
                 throw new core.exceptions.ValueLimitExceededError(msg);
             };
             //if not CP then nothing to do
-            if(!symbol.isPoly(true))
+            if(true)
                 stop('Must be a polynomial!');
 
killedBy: Algebra should complete the square
statusReason: Expected '-11*c+a*x^2+b*x' to equal '((1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c'.

[Killed] BooleanLiteral
Algebra.js:4061:16
                 throw new core.exceptions.ValueLimitExceededError(msg);
             };
             //if not CP then nothing to do
-            if(!symbol.isPoly(true))
+            if(symbol.isPoly(true))
                 stop('Must be a polynomial!');
 
killedBy: Algebra should complete the square
statusReason: Expected '-11*c+a*x^2+b*x' to equal '((1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c'.

[Killed] BooleanLiteral
Algebra.js:4072:16
             symbol = symbol.clone();
             deg = core.Algebra.degree(symbol, v); //get the degree of polynomial
             //must be in form ax^2 +/- bx +/- c
-            if(!deg.equals(2))
+            if(deg.equals(2))
                 stop('Cannot complete square for degree ' + deg);
             //get the coeffs
killedBy: Algebra should complete the square
statusReason: Expected '-11*c+a*x^2+b*x' to equal '((1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c'.

[Killed] ConditionalExpression
Algebra.js:4072:16
             symbol = symbol.clone();
             deg = core.Algebra.degree(symbol, v); //get the degree of polynomial
             //must be in form ax^2 +/- bx +/- c
-            if(!deg.equals(2))
+            if(true)
                 stop('Cannot complete square for degree ' + deg);
             //get the coeffs
killedBy: Algebra should complete the square
statusReason: Expected '-11*c+a*x^2+b*x' to equal '((1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c'.

[NoCoverage] StringLiteral
Algebra.js:4073:22
             deg = core.Algebra.degree(symbol, v); //get the degree of polynomial
             //must be in form ax^2 +/- bx +/- c
             if(!deg.equals(2))
-                stop('Cannot complete square for degree ' + deg);
+                stop("" + deg);
             //get the coeffs
             coeffs = core.Algebra.coeffs(symbol, v);

[Killed] ConditionalExpression
Algebra.js:4083:16
             b = _.divide(coeffs[1], new Symbol(2));
             //add the difference to the constant
             c = _.pow(b.clone(), new Symbol(2));
-            if(raw)
+            if(true)
                 return [a, b, d];
             sqrt_a = math.sqrt(a);
killedBy: Algebra should complete the square
statusReason: ParseError: Unexpected token!: 1

[Survived] ConditionalExpression
Algebra.js:4083:16
             b = _.divide(coeffs[1], new Symbol(2));
             //add the difference to the constant
             c = _.pow(b.clone(), new Symbol(2));
-            if(raw)
+            if(false)
                 return [a, b, d];
             sqrt_a = math.sqrt(a);

[NoCoverage] ArrayDeclaration
Algebra.js:4084:24
             //add the difference to the constant
             c = _.pow(b.clone(), new Symbol(2));
             if(raw)
-                return [a, b, d];
+                return [];
             sqrt_a = math.sqrt(a);
             e = _.divide(math.sqrt(c), sqrt_a.clone());

[Killed] ConditionalExpression
Algebra.js:4090:58
             //calculate d which is the constant
             d = _.subtract(coeffs[0], _.pow(e.clone(), new Symbol(2)));
             //compute the square part
-            sym = _.parse(br(sqrt_a.clone() + '*' + v + (sign < 0 ? '-' : '+') + e));
+            sym = _.parse(br(sqrt_a.clone() + '*' + v + (true ? '-' : '+') + e));
             return {
                 a: sym,
killedBy: Algebra should complete the square
statusReason: Expected '((-1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c' to equal '((1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c'.

[Killed] ArithmeticOperator
Algebra.js:4090:30
             //calculate d which is the constant
             d = _.subtract(coeffs[0], _.pow(e.clone(), new Symbol(2)));
             //compute the square part
-            sym = _.parse(br(sqrt_a.clone() + '*' + v + (sign < 0 ? '-' : '+') + e));
+            sym = _.parse(br(sqrt_a.clone() + '*' + v + (sign < 0 ? '-' : '+') - e));
             return {
                 a: sym,
killedBy: Algebra should complete the square
statusReason: Expected '(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c+NaN^2' to equal '((1/2)*abs(b)*sqrt(a)^(-1)+sqrt(a)*x)^2+(-1/4)*(abs(b)*sqrt(a)^(-1))^2-11*c'.

[Killed] BlockStatement
Algebra.js:4098:38
             };
         },
         Simplify: {
-            strip: function (symbol) {
-                var c = _.parse(symbol.multiplier);
-                symbol.toUnitMultiplier();
-                var p = _.parse(symbol.power);
-                symbol.toLinear();
-                return [c, p, symbol];
-            },
+            strip: function (symbol) {},
             unstrip: function (cp, symbol) {
                 var c = cp[0];
killedBy: Algebra should factor correctly
statusReason: Expected '(-2*x+12*x^3+6*x^2)^(-1)*(4*x^2+7*x^3+x)' to equal '(1/2)*(-1+3*x+6*x^2)^(-1)*(1+4*x+7*x^2)'.

[Killed] ArrayDeclaration
Algebra.js:4103:24
                 symbol.toUnitMultiplier();
                 var p = _.parse(symbol.power);
                 symbol.toLinear();
-                return [c, p, symbol];
+                return [];
             },
             unstrip: function (cp, symbol) {
killedBy: Algebra should factor correctly
statusReason: Expected '(-2*x+12*x^3+6*x^2)^(-1)*(4*x^2+7*x^3+x)' to equal '(1/2)*(-1+3*x+6*x^2)^(-1)*(1+4*x+7*x^2)'.

[Killed] BlockStatement
Algebra.js:4105:44
                 symbol.toLinear();
                 return [c, p, symbol];
             },
-            unstrip: function (cp, symbol) {
-                var c = cp[0];
-                var p = cp[1];
-                return _.multiply(c, _.pow(symbol, p));
-            },
+            unstrip: function (cp, symbol) {},
             complexSimp: function (num, den) {
                 var ac, bd, bc, ad, cd, r1, r2, i1, i2;
killedBy: Algebra should factor correctly
statusReason: ParseError: Cannot read property 'equals' of undefined: 1

[Killed] BlockStatement
Algebra.js:4110:46
                 var p = cp[1];
                 return _.multiply(c, _.pow(symbol, p));
             },
-            complexSimp: function (num, den) {
-                var ac, bd, bc, ad, cd, r1, r2, i1, i2;
-                r1 = num.realpart();
-                i1 = num.imagpart();
-                r2 = den.realpart();
-                i2 = den.imagpart();
-                //apply complex arithmatic rule
-                ac = _.multiply(r1.clone(), r2.clone());
-                bd = _.multiply(i1.clone(), i2.clone());
-                bc = _.multiply(r2.clone(), i1);
-                ad = _.multiply(r1, i2.clone());
-                cd = _.add(_.pow(r2, new Symbol(2)), _.pow(i2, new Symbol(2)));
-
-                return _.divide(_.add(_.add(ac, bd), _.multiply(_.subtract(bc, ad), Symbol.imaginary())), cd);
-            },
+            complexSimp: function (num, den) {},
             trigSimp: function (symbol) {
                 if(symbol.containsFunction(['cos', 'sin', 'tan'])) {
killedBy: Algebra should simplify correctly
statusReason: ParseError: Cannot read property 'equals' of undefined: 1

[Killed] ConditionalExpression
Algebra.js:4126:20
                 return _.divide(_.add(_.add(ac, bd), _.multiply(_.subtract(bc, ad), Symbol.imaginary())), cd);
             },
             trigSimp: function (symbol) {
-                if(symbol.containsFunction(['cos', 'sin', 'tan'])) {
+                if(false) {
                     symbol = symbol.clone();
                     //remove power and multiplier
killedBy: Algebra should simplify correctly
statusReason: Expected 'cos(x)^2+sin(x)^2' to equal '1'.

[Survived] ConditionalExpression
Algebra.js:4126:20
                 return _.divide(_.add(_.add(ac, bd), _.multiply(_.subtract(bc, ad), Symbol.imaginary())), cd);
             },
             trigSimp: function (symbol) {
-                if(symbol.containsFunction(['cos', 'sin', 'tan'])) {
+                if(true) {
                     symbol = symbol.clone();
                     //remove power and multiplier

[Killed] ConditionalExpression
Algebra.js:4135:24
                     var retval = symbol.clone();
 
                     //rewrite the symbol
-                    if(symbol.group === CP) {
+                    if(true) {
                         var sym = new Symbol(0);
                         symbol.each(function (x) {
killedBy: Algebra should simplify correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Killed] BlockStatement
Algebra.js:4135:45
                     var retval = symbol.clone();
 
                     //rewrite the symbol
-                    if(symbol.group === CP) {
-                        var sym = new Symbol(0);
-                        symbol.each(function (x) {
-                            //rewrite the function
-                            var tr = __.Simplify.trigSimp(x.fnTransform());
-                            sym = _.add(sym, tr);
-                        }, true);
-
-                        //put back the power and multiplier and return
-                        retval = _.pow(_.multiply(new Symbol(symbol.multiplier), sym), new Symbol(symbol.power));
-                    }
+                    if(symbol.group === CP) {}
                     else if(symbol.group === CB) {
 
killedBy: Algebra should simplify correctly
statusReason: Expected 'cos(x)^2+sin(x)^2' to equal '1'.

[Killed] BlockStatement
Algebra.js:4137:50
                     //rewrite the symbol
                     if(symbol.group === CP) {
                         var sym = new Symbol(0);
-                        symbol.each(function (x) {
-                            //rewrite the function
-                            var tr = __.Simplify.trigSimp(x.fnTransform());
-                            sym = _.add(sym, tr);
-                        }, true);
+                        symbol.each(function (x) {}, true);
 
                         //put back the power and multiplier and return
killedBy: Algebra should simplify correctly
statusReason: Expected '0' to equal '1'.

[Survived] BooleanLiteral
Algebra.js:4141:28
                             //rewrite the function
                             var tr = __.Simplify.trigSimp(x.fnTransform());
                             sym = _.add(sym, tr);
-                        }, true);
+                        }, false);
 
                         //put back the power and multiplier and return

[Killed] BlockStatement
Algebra.js:4146:50
                         //put back the power and multiplier and return
                         retval = _.pow(_.multiply(new Symbol(symbol.multiplier), sym), new Symbol(symbol.power));
                     }
-                    else if(symbol.group === CB) {
-
-                        var n = symbol.getNum();
-                        var d = symbol.getDenom();
-
-                        //try for tangent
-                        if(n.fname === 'sin' && d.fname === 'cos' && n.args[0].equals(d.args[0]) && n.power.equals(d.power)) {
-                            retval = _.parse(core.Utils.format('({0})*({1})*tan({2})^({3})', d.multiplier, n.multiplier, n.args[0], n.power));
-                        }
-                        if(retval.group === CB) {
-                            var t = new Symbol(1);
-                            retval.each(function (x) {
-                                if(x.fname === 'tan') {
-                                    x = _.parse(core.Utils.format('({0})*sin({1})^({2})/cos({1})^({2})', x.multiplier, __.Simplify.simplify(x.args[0]), x.power));
-                                }
-                                t = _.multiply(t, x);
-                            });
-                            retval = t;
-                        }
-                    }
+                    else if(symbol.group === CB) {}
 
 
killedBy: calculus should calculate limits correctly
statusReason: Expected '1' to equal '1/3'.

[Killed] ConditionalExpression
Algebra.js:4152:28
                         var d = symbol.getDenom();
 
                         //try for tangent
-                        if(n.fname === 'sin' && d.fname === 'cos' && n.args[0].equals(d.args[0]) && n.power.equals(d.power)) {
+                        if(true) {
                             retval = _.parse(core.Utils.format('({0})*({1})*tan({2})^({3})', d.multiplier, n.multiplier, n.args[0], n.power));
                         }
killedBy: calculus should calculate limits correctly
statusReason: Expected 'limit(tan(x),x,(1/2)*pi)' to equal '1/3'.

[Killed] ConditionalExpression
Algebra.js:4152:28
                         var d = symbol.getDenom();
 
                         //try for tangent
-                        if(n.fname === 'sin' && d.fname === 'cos' && n.args[0].equals(d.args[0]) && n.power.equals(d.power)) {
+                        if(true && n.power.equals(d.power)) {
                             retval = _.parse(core.Utils.format('({0})*({1})*tan({2})^({3})', d.multiplier, n.multiplier, n.args[0], n.power));
                         }
killedBy: calculus should calculate limits correctly
statusReason: Expected 'limit(tan(x),x,(1/2)*pi)' to equal '1/3'.

[Killed] BlockStatement
Algebra.js:4155:49
                         if(n.fname === 'sin' && d.fname === 'cos' && n.args[0].equals(d.args[0]) && n.power.equals(d.power)) {
                             retval = _.parse(core.Utils.format('({0})*({1})*tan({2})^({3})', d.multiplier, n.multiplier, n.args[0], n.power));
                         }
-                        if(retval.group === CB) {
-                            var t = new Symbol(1);
-                            retval.each(function (x) {
-                                if(x.fname === 'tan') {
-                                    x = _.parse(core.Utils.format('({0})*sin({1})^({2})/cos({1})^({2})', x.multiplier, __.Simplify.simplify(x.args[0]), x.power));
-                                }
-                                t = _.multiply(t, x);
-                            });
-                            retval = t;
-                        }
+                        if(retval.group === CB) {}
                     }
 
killedBy: calculus should calculate limits correctly
statusReason: Expected '1' to equal '1/3'.

[Killed] ConditionalExpression
Algebra.js:4155:28
                         if(n.fname === 'sin' && d.fname === 'cos' && n.args[0].equals(d.args[0]) && n.power.equals(d.power)) {
                             retval = _.parse(core.Utils.format('({0})*({1})*tan({2})^({3})', d.multiplier, n.multiplier, n.args[0], n.power));
                         }
-                        if(retval.group === CB) {
+                        if(false) {
                             var t = new Symbol(1);
                             retval.each(function (x) {
killedBy: calculus should calculate limits correctly
statusReason: Expected '1' to equal '1/3'.

[Killed] BlockStatement
Algebra.js:4157:54
                         }
                         if(retval.group === CB) {
                             var t = new Symbol(1);
-                            retval.each(function (x) {
-                                if(x.fname === 'tan') {
-                                    x = _.parse(core.Utils.format('({0})*sin({1})^({2})/cos({1})^({2})', x.multiplier, __.Simplify.simplify(x.args[0]), x.power));
-                                }
-                                t = _.multiply(t, x);
-                            });
+                            retval.each(function (x) {});
                             retval = t;
                         }
killedBy: calculus should calculate limits correctly
statusReason: Expected '1' to equal '1/3'.

[Killed] ConditionalExpression
Algebra.js:4158:36
                         if(retval.group === CB) {
                             var t = new Symbol(1);
                             retval.each(function (x) {
-                                if(x.fname === 'tan') {
+                                if(true) {
                                     x = _.parse(core.Utils.format('({0})*sin({1})^({2})/cos({1})^({2})', x.multiplier, __.Simplify.simplify(x.args[0]), x.power));
                                 }
killedBy: calculus should calculate limits correctly
statusReason: Expected '1' to equal '1/3'.

[Killed] BlockStatement
Algebra.js:4158:55
                         if(retval.group === CB) {
                             var t = new Symbol(1);
                             retval.each(function (x) {
-                                if(x.fname === 'tan') {
-                                    x = _.parse(core.Utils.format('({0})*sin({1})^({2})/cos({1})^({2})', x.multiplier, __.Simplify.simplify(x.args[0]), x.power));
-                                }
+                                if(x.fname === 'tan') {}
                                 t = _.multiply(t, x);
                             });
killedBy: calculus should calculate limits correctly
statusReason: Expected '1' to equal '1/3'.

[Killed] ConditionalExpression
Algebra.js:4180:20
                 var den = symbol.getDenom();
                 var num = symbol.getNum();
 
-                if(num.isImaginary() && den.isImaginary())
+                if(true)
                     symbol = __.Simplify.complexSimp(num, den);
 
killedBy: Algebra should simplify correctly
statusReason: Expected '-10+3*i' to equal '(-9/82)*i-125/164'.

[Killed] LogicalOperator
Algebra.js:4180:20
                 var den = symbol.getDenom();
                 var num = symbol.getNum();
 
-                if(num.isImaginary() && den.isImaginary())
+                if(num.isImaginary() || den.isImaginary())
                     symbol = __.Simplify.complexSimp(num, den);
 
killedBy: Algebra should simplify correctly
statusReason: Expected '-10+3*i' to equal '(-9/82)*i-125/164'.

[Killed] ConditionalExpression
Algebra.js:4183:20
                 if(num.isImaginary() && den.isImaginary())
                     symbol = __.Simplify.complexSimp(num, den);
 
-                if(symbol.isComposite()) {
+                if(false) {
                     if(symbol.power > 1) {
                         symbol = _.expand(symbol);
killedBy: Algebra should simplify correctly
statusReason: Expected '(17/2)*(-10+8*i)^(-1)+(25/82)*i-10/41' to equal '(-9/82)*i-125/164'.

[Timeout] ConditionalExpression
Algebra.js:4183:20
                 if(num.isImaginary() && den.isImaginary())
                     symbol = __.Simplify.complexSimp(num, den);
 
-                if(symbol.isComposite()) {
+                if(true) {
                     if(symbol.power > 1) {
                         symbol = _.expand(symbol);

[Killed] ConditionalExpression
Algebra.js:4184:24
                     symbol = __.Simplify.complexSimp(num, den);
 
                 if(symbol.isComposite()) {
-                    if(symbol.power > 1) {
+                    if(false) {
                         symbol = _.expand(symbol);
                     }
killedBy: Algebra should simplify correctly
statusReason: Expected '(a+b)*c^(-1)' to equal '(a+b)^2*c^(-1)'.

[Killed] BlockStatement
Algebra.js:4184:42
                     symbol = __.Simplify.complexSimp(num, den);
 
                 if(symbol.isComposite()) {
-                    if(symbol.power > 1) {
-                        symbol = _.expand(symbol);
-                    }
+                    if(symbol.power > 1) {}
 
                     var symbols = symbol.collectSymbols();
killedBy: Algebra should simplify correctly
statusReason: Expected '(a+b)*c^(-1)' to equal '(a+b)^2*c^(-1)'.

[Killed] ConditionalExpression
Algebra.js:4194:27
                     var retval, a, b, d1, d2, n1, n2, s, x, y, c, den, num;
                     a = symbols.pop(); //grab the first symbol
                     //loop through each term and make denominator common
-                    while(symbols.length) {
+                    while(false) {
                         b = symbols.pop(); //grab the second symbol
                         d1 = _.parse(a.getDenom());
killedBy: Algebra should simplify correctly
statusReason: Expected 'sin(x)^2' to equal '1'.

[Timeout] BlockStatement
Algebra.js:4194:43
                     var retval, a, b, d1, d2, n1, n2, s, x, y, c, den, num;
                     a = symbols.pop(); //grab the first symbol
                     //loop through each term and make denominator common
-                    while(symbols.length) {
-                        b = symbols.pop(); //grab the second symbol
-                        d1 = _.parse(a.getDenom());
-                        d2 = _.parse(b.getDenom());
-                        n1 = a.getNum();
-                        n2 = b.getNum();
-                        c = _.multiply(d1.clone(), d2.clone());
-                        x = _.multiply(n1, d2);
-                        y = _.multiply(n2, d1);
-                        s = _.add(x, y);
-                        a = _.divide(s, c);
-                    }
+                    while(symbols.length) {}
                     den = _.expand(a.getDenom());
                     num = _.expand(a.getNum());

[Killed] BlockStatement
Algebra.js:4209:64
                     den = _.expand(a.getDenom());
                     num = _.expand(a.getNum());
                     //simplify imaginary
-                    if(num.isImaginary() && den.isImaginary()) {
-                        retval = __.Simplify.complexSimp(num, den);
-                    }
+                    if(num.isImaginary() && den.isImaginary()) {}
                     else {
                         retval = _.divide(num, den);
killedBy: Algebra should simplify correctly
statusReason: ParseError: Cannot read property 'equals' of undefined: 1
