[NoCoverage] BooleanLiteral
Calculus.js:209:16
             var numerator = new Symbol(0);
             symbol.each(function (x) {
                 denominator = _.multiply(denominator, x.getDenom());
-            }, true);
+            }, false);
 
             //remove the denomitor in each term

[NoCoverage] BlockStatement
Calculus.js:212:38
             }, true);
 
             //remove the denomitor in each term
-            symbol.each(function (x) {
-                var num = x.getNum();
-                var den = x.getDenom();
-                var factor = _.multiply(num, _.divide(denominator.clone(), den));
-                numerator = _.add(numerator, factor);
-            });
+            symbol.each(function (x) {});
             var retval = _.multiply(m, core.Algebra.divide(_.expand(numerator), _.expand(denominator)));
             return retval;

[Killed] BlockStatement
Calculus.js:224:47
         return symbol;
     };
     //A function to check if a function name is an inverse trig function
-    core.Utils.in_inverse_trig = function (x) {
-        var inv_trig_fns = [ASIN, ACOS, ATAN, ACSC, ASEC, ACOT];
-        return inv_trig_fns.indexOf(x) !== -1;
-    };
+    core.Utils.in_inverse_trig = function (x) {};
     //A function to check if a function name is a trig function
     core.Utils.in_trig = function (x) {
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(asin(a*x),x)' to equal 'a^(-1)*sqrt(-a^2*x^2+1)+asin(a*x)*x'.

[Killed] ConditionalExpression
Calculus.js:226:16
     //A function to check if a function name is an inverse trig function
     core.Utils.in_inverse_trig = function (x) {
         var inv_trig_fns = [ASIN, ACOS, ATAN, ACSC, ASEC, ACOT];
-        return inv_trig_fns.indexOf(x) !== -1;
+        return false;
     };
     //A function to check if a function name is a trig function
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(asin(a*x),x)' to equal 'a^(-1)*sqrt(-a^2*x^2+1)+asin(a*x)*x'.

[Survived] UnaryOperator
Calculus.js:226:44
     //A function to check if a function name is an inverse trig function
     core.Utils.in_inverse_trig = function (x) {
         var inv_trig_fns = [ASIN, ACOS, ATAN, ACSC, ASEC, ACOT];
-        return inv_trig_fns.indexOf(x) !== -1;
+        return inv_trig_fns.indexOf(x) !== +1;
     };
     //A function to check if a function name is a trig function

[Killed] BlockStatement
Calculus.js:229:39
         return inv_trig_fns.indexOf(x) !== -1;
     };
     //A function to check if a function name is a trig function
-    core.Utils.in_trig = function (x) {
-        var trig_fns = [COS, SIN, TAN, SEC, CSC, COT];
-        return trig_fns.indexOf(x) !== -1;
-    };
+    core.Utils.in_trig = function (x) {};
 
     core.Utils.in_htrig = function (x) {
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sin(x)*x^2,x)' to equal '-cos(x)*x^2+2*cos(x)+2*sin(x)*x'.

[Killed] ArrayDeclaration
Calculus.js:230:24
     };
     //A function to check if a function name is a trig function
     core.Utils.in_trig = function (x) {
-        var trig_fns = [COS, SIN, TAN, SEC, CSC, COT];
+        var trig_fns = [];
         return trig_fns.indexOf(x) !== -1;
     };
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sin(x)*x^2,x)' to equal '-cos(x)*x^2+2*cos(x)+2*sin(x)*x'.

[Killed] UnaryOperator
Calculus.js:231:40
     //A function to check if a function name is a trig function
     core.Utils.in_trig = function (x) {
         var trig_fns = [COS, SIN, TAN, SEC, CSC, COT];
-        return trig_fns.indexOf(x) !== -1;
+        return trig_fns.indexOf(x) !== +1;
     };
 
killedBy: calculus should integrate properly
statusReason: Expected '-15*x^4-243*integrate(-x^3,x)-243*integrate(log(x)*x^3,x)+61*(-x+log(x)*x)*x^3' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.

[Killed] ConditionalExpression
Calculus.js:231:16
     //A function to check if a function name is a trig function
     core.Utils.in_trig = function (x) {
         var trig_fns = [COS, SIN, TAN, SEC, CSC, COT];
-        return trig_fns.indexOf(x) !== -1;
+        return true;
     };
 
killedBy: calculus should integrate properly
statusReason: Expected '-15*x^4-243*integrate(-x^3,x)-243*integrate(log(x)*x^3,x)+61*(-x+log(x)*x)*x^3' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.

[Killed] BlockStatement
Calculus.js:234:40
         return trig_fns.indexOf(x) !== -1;
     };
 
-    core.Utils.in_htrig = function (x) {
-        var trig_fns = [SINH, COSH, TANH, ACSCH, ASECH, ACOTH];
-        return trig_fns.indexOf(x) !== -1;
-    };
+    core.Utils.in_htrig = function (x) {};
 
     // Matrix functions
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sinh(x)*x,x)' to equal '-sinh(x)+cosh(x)*x'.

[Killed] ConditionalExpression
Calculus.js:236:16
 
     core.Utils.in_htrig = function (x) {
         var trig_fns = [SINH, COSH, TANH, ACSCH, ASECH, ACOTH];
-        return trig_fns.indexOf(x) !== -1;
+        return false;
     };
 
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sinh(x)*x,x)' to equal '-sinh(x)+cosh(x)*x'.

[Killed] ConditionalExpression
Calculus.js:236:16
 
     core.Utils.in_htrig = function (x) {
         var trig_fns = [SINH, COSH, TANH, ACSCH, ASECH, ACOTH];
-        return trig_fns.indexOf(x) !== -1;
+        return true;
     };
 
killedBy: calculus should integrate properly
statusReason: Expected '-15*x^4-243*integrate(-x^3,x)-243*integrate(log(x)*x^3,x)+61*(-x+log(x)*x)*x^3' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.

[Killed] BlockStatement
Calculus.js:240:50
     };
 
     // Matrix functions
-    core.Matrix.jacobian = function (eqns, vars) {
-        var jacobian = new core.Matrix();
-        //get the variables if not supplied
-        if(!vars) {
-            vars = core.Utils.arrayGetVariables(eqns);
-        }
-
-        vars.forEach(function (v, i) {
-            eqns.forEach(function (eq, j) {
-                var e = core.Calculus.diff(eq.clone(), v);
-                jacobian.set(j, i, e);
-            });
-        });
-
-        return jacobian;
-    };
+    core.Matrix.jacobian = function (eqns, vars) {};
 
     core.Matrix.prototype.max = function () {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Survived] ConditionalExpression
Calculus.js:243:12
     core.Matrix.jacobian = function (eqns, vars) {
         var jacobian = new core.Matrix();
         //get the variables if not supplied
-        if(!vars) {
+        if(true) {
             vars = core.Utils.arrayGetVariables(eqns);
         }

[NoCoverage] BlockStatement
Calculus.js:243:19
     core.Matrix.jacobian = function (eqns, vars) {
         var jacobian = new core.Matrix();
         //get the variables if not supplied
-        if(!vars) {
-            vars = core.Utils.arrayGetVariables(eqns);
-        }
+        if(!vars) {}
 
         vars.forEach(function (v, i) {

[Killed] BlockStatement
Calculus.js:247:38
             vars = core.Utils.arrayGetVariables(eqns);
         }
 
-        vars.forEach(function (v, i) {
-            eqns.forEach(function (eq, j) {
-                var e = core.Calculus.diff(eq.clone(), v);
-                jacobian.set(j, i, e);
-            });
-        });
+        vars.forEach(function (v, i) {});
 
         return jacobian;
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Calculus.js:248:43
         }
 
         vars.forEach(function (v, i) {
-            eqns.forEach(function (eq, j) {
-                var e = core.Calculus.diff(eq.clone(), v);
-                jacobian.set(j, i, e);
-            });
+            eqns.forEach(function (eq, j) {});
         });
 
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Calculus.js:257:45
         return jacobian;
     };
 
-    core.Matrix.prototype.max = function () {
-        var max = new Symbol(0);
-        this.each(function (x) {
-            var e = x.abs();
-            if(e.gt(max))
-                max = e;
-        });
-        return max;
-    };
+    core.Matrix.prototype.max = function () {};
 
     core.Matrix.cMatrix = function (value, vars) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-6.99700289913026,y,9.99700289913026' to equal 'x,1,y,2'.

[Killed] BlockStatement
Calculus.js:259:32
 
     core.Matrix.prototype.max = function () {
         var max = new Symbol(0);
-        this.each(function (x) {
-            var e = x.abs();
-            if(e.gt(max))
-                max = e;
-        });
+        this.each(function (x) {});
         return max;
     };
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-6.99700289913026,y,9.99700289913026' to equal 'x,1,y,2'.

[Killed] ConditionalExpression
Calculus.js:261:16
         var max = new Symbol(0);
         this.each(function (x) {
             var e = x.abs();
-            if(e.gt(max))
+            if(false)
                 max = e;
         });
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-6.99700289913026,y,9.99700289913026' to equal 'x,1,y,2'.

[Survived] ConditionalExpression
Calculus.js:261:16
         var max = new Symbol(0);
         this.each(function (x) {
             var e = x.abs();
-            if(e.gt(max))
+            if(true)
                 max = e;
         });

[Killed] BlockStatement
Calculus.js:267:50
         return max;
     };
 
-    core.Matrix.cMatrix = function (value, vars) {
-        var m = new core.Matrix();
-        //make an initial guess
-        vars.forEach(function (v, i) {
-            m.set(i, 0, _.parse(value));
-        });
-        return m;
-    };
+    core.Matrix.cMatrix = function (value, vars) {};
 
     var all_functions = core.Utils.all_functions = function (arr) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Calculus.js:270:38
     core.Matrix.cMatrix = function (value, vars) {
         var m = new core.Matrix();
         //make an initial guess
-        vars.forEach(function (v, i) {
-            m.set(i, 0, _.parse(value));
-        });
+        vars.forEach(function (v, i) {});
         return m;
     };
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Calculus.js:276:67
         return m;
     };
 
-    var all_functions = core.Utils.all_functions = function (arr) {
-        for(var i = 0, l = arr.length; i < l; i++)
-            if(arr[i].group !== FN)
-                return false;
-        return true;
-    },
+    var all_functions = core.Utils.all_functions = function (arr) {},
             cosAsinBtransform = core.Utils.cosAsinBtranform = function (symbol1, symbol2) {
                 var a, b;
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(cos(x)*sin(x)^2*tan(x),x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Killed] UpdateOperator
Calculus.js:277:47
     };
 
     var all_functions = core.Utils.all_functions = function (arr) {
-        for(var i = 0, l = arr.length; i < l; i++)
+        for(var i = 0, l = arr.length; i < l; i--)
             if(arr[i].group !== FN)
                 return false;
killedBy: calculus should integrate properly
statusReason: ParseError: Cannot read property 'group' of undefined: 1

[Survived] ConditionalExpression
Calculus.js:277:40
     };
 
     var all_functions = core.Utils.all_functions = function (arr) {
-        for(var i = 0, l = arr.length; i < l; i++)
+        for(var i = 0, l = arr.length; false; i++)
             if(arr[i].group !== FN)
                 return false;

[Killed] ConditionalExpression
Calculus.js:278:16
 
     var all_functions = core.Utils.all_functions = function (arr) {
         for(var i = 0, l = arr.length; i < l; i++)
-            if(arr[i].group !== FN)
+            if(true)
                 return false;
         return true;
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(cos(x)*sin(x)^2*tan(x),x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Survived] ConditionalExpression
Calculus.js:278:16
 
     var all_functions = core.Utils.all_functions = function (arr) {
         for(var i = 0, l = arr.length; i < l; i++)
-            if(arr[i].group !== FN)
+            if(false)
                 return false;
         return true;

[NoCoverage] BooleanLiteral
Calculus.js:279:24
     var all_functions = core.Utils.all_functions = function (arr) {
         for(var i = 0, l = arr.length; i < l; i++)
             if(arr[i].group !== FN)
-                return false;
+                return true;
         return true;
     },

[NoCoverage] BlockStatement
Calculus.js:282:91
                 return false;
         return true;
     },
-            cosAsinBtransform = core.Utils.cosAsinBtranform = function (symbol1, symbol2) {
-                var a, b;
-                a = symbol1.args[0];
-                b = symbol2.args[0];
-                return _.parse(format('(sin(({0})+({1}))-sin(({0})-({1})))/2', a, b));
-            },
+            cosAsinBtransform = core.Utils.cosAsinBtranform = function (symbol1, symbol2) {},
             cosAsinAtransform = core.Utils.cosAsinAtranform = function (symbol1, symbol2) {
                 //TODO: temporary fix for integrate(e^x*sin(x)*cos(x)^2).

[NoCoverage] BlockStatement
Calculus.js:288:91
                 b = symbol2.args[0];
                 return _.parse(format('(sin(({0})+({1}))-sin(({0})-({1})))/2', a, b));
             },
-            cosAsinAtransform = core.Utils.cosAsinAtranform = function (symbol1, symbol2) {
-                //TODO: temporary fix for integrate(e^x*sin(x)*cos(x)^2).
-                //we technically know how to do this transform but more is needed for correct output
-                if(Number(symbol2.power) !== 1)
-                    return _.multiply(symbol1, symbol2);
-                var a;
-                a = symbol1.args[0];
-                return _.parse(format('(sin(2*({0})))/2', a));
-            },
+            cosAsinAtransform = core.Utils.cosAsinAtranform = function (symbol1, symbol2) {},
             sinAsinBtransform = core.Utils.cosAsinBtranform = function (symbol1, symbol2) {
                 var a, b;

[NoCoverage] ConditionalExpression
Calculus.js:291:20
             cosAsinAtransform = core.Utils.cosAsinAtranform = function (symbol1, symbol2) {
                 //TODO: temporary fix for integrate(e^x*sin(x)*cos(x)^2).
                 //we technically know how to do this transform but more is needed for correct output
-                if(Number(symbol2.power) !== 1)
+                if(false)
                     return _.multiply(symbol1, symbol2);
                 var a;

[NoCoverage] ConditionalExpression
Calculus.js:291:20
             cosAsinAtransform = core.Utils.cosAsinAtranform = function (symbol1, symbol2) {
                 //TODO: temporary fix for integrate(e^x*sin(x)*cos(x)^2).
                 //we technically know how to do this transform but more is needed for correct output
-                if(Number(symbol2.power) !== 1)
+                if(true)
                     return _.multiply(symbol1, symbol2);
                 var a;

[NoCoverage] BlockStatement
Calculus.js:297:91
                 a = symbol1.args[0];
                 return _.parse(format('(sin(2*({0})))/2', a));
             },
-            sinAsinBtransform = core.Utils.cosAsinBtranform = function (symbol1, symbol2) {
-                var a, b;
-                a = symbol1.args[0];
-                b = symbol2.args[0];
-                return _.parse(format('(cos(({0})+({1}))-cos(({0})-({1})))/2', a, b));
-            },
+            sinAsinBtransform = core.Utils.cosAsinBtranform = function (symbol1, symbol2) {},
             trigTransform = core.Utils.trigTransform = function (arr) {
                 var map = {}, symbol, t,

[NoCoverage] ConditionalExpression
Calculus.js:306:48
             trigTransform = core.Utils.trigTransform = function (arr) {
                 var map = {}, symbol, t,
                         retval = new Symbol(1);
-                for(var i = 0, l = arr.length; i < l; i++) {
+                for(var i = 0, l = arr.length; false; i++) {
                     symbol = arr[i];
 

[NoCoverage] UpdateOperator
Calculus.js:306:55
             trigTransform = core.Utils.trigTransform = function (arr) {
                 var map = {}, symbol, t,
                         retval = new Symbol(1);
-                for(var i = 0, l = arr.length; i < l; i++) {
+                for(var i = 0, l = arr.length; i < l; i--) {
                     symbol = arr[i];
 

[NoCoverage] ConditionalExpression
Calculus.js:309:24
                 for(var i = 0, l = arr.length; i < l; i++) {
                     symbol = arr[i];
 
-                    if(symbol.group === FN) {
+                    if(false) {
                         var fname = symbol.fname;
 

[NoCoverage] ConditionalExpression
Calculus.js:312:28
                     if(symbol.group === FN) {
                         var fname = symbol.fname;
 
-                        if(fname === COS && map[SIN]) {
+                        if(false) {
 
                             if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {

[NoCoverage] LogicalOperator
Calculus.js:312:28
                     if(symbol.group === FN) {
                         var fname = symbol.fname;
 
-                        if(fname === COS && map[SIN]) {
+                        if(fname === COS || map[SIN]) {
 
                             if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {

[NoCoverage] ConditionalExpression
Calculus.js:314:32
 
                         if(fname === COS && map[SIN]) {
 
-                            if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
+                            if(true) {
                                 t = cosAsinBtransform(symbol, map[SIN]);
                             }

[NoCoverage] ConditionalExpression
Calculus.js:314:32
 
                         if(fname === COS && map[SIN]) {
 
-                            if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
+                            if(false) {
                                 t = cosAsinBtransform(symbol, map[SIN]);
                             }

[NoCoverage] BlockStatement
Calculus.js:317:34
                             if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
                                 t = cosAsinBtransform(symbol, map[SIN]);
                             }
-                            else {
-                                t = cosAsinAtransform(symbol, map[SIN]);
-                            }
+                            else {}
                             delete map[SIN];
 

[NoCoverage] ConditionalExpression
Calculus.js:324:33
 
                             retval = _.multiply(retval, t);
                         }
-                        else if(fname === SIN && map[COS]) {
+                        else if(false) {
                             if(map[COS].args[0].toString() !== symbol.args[0].toString()) {
                                 t = cosAsinBtransform(symbol, map[COS]);

[NoCoverage] LogicalOperator
Calculus.js:324:33
 
                             retval = _.multiply(retval, t);
                         }
-                        else if(fname === SIN && map[COS]) {
+                        else if(fname === SIN || map[COS]) {
                             if(map[COS].args[0].toString() !== symbol.args[0].toString()) {
                                 t = cosAsinBtransform(symbol, map[COS]);

[NoCoverage] ConditionalExpression
Calculus.js:325:32
                             retval = _.multiply(retval, t);
                         }
                         else if(fname === SIN && map[COS]) {
-                            if(map[COS].args[0].toString() !== symbol.args[0].toString()) {
+                            if(false) {
                                 t = cosAsinBtransform(symbol, map[COS]);
                             }

[NoCoverage] ConditionalExpression
Calculus.js:325:32
                             retval = _.multiply(retval, t);
                         }
                         else if(fname === SIN && map[COS]) {
-                            if(map[COS].args[0].toString() !== symbol.args[0].toString()) {
+                            if(true) {
                                 t = cosAsinBtransform(symbol, map[COS]);
                             }

[NoCoverage] BlockStatement
Calculus.js:328:34
                             if(map[COS].args[0].toString() !== symbol.args[0].toString()) {
                                 t = cosAsinBtransform(symbol, map[COS]);
                             }
-                            else {
-                                t = cosAsinAtransform(symbol, map[COS]);
-                            }
+                            else {}
                             delete map[COS];
 

[NoCoverage] LogicalOperator
Calculus.js:335:33
 
                             retval = _.multiply(retval, t);
                         }
-                        else if(fname === SIN && map[SIN]) {
+                        else if(fname === SIN || map[SIN]) {
                             if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
                                 t = sinAsinBtransform(symbol, map[SIN]);

[NoCoverage] BlockStatement
Calculus.js:335:60
 
                             retval = _.multiply(retval, t);
                         }
-                        else if(fname === SIN && map[SIN]) {
-                            if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
-                                t = sinAsinBtransform(symbol, map[SIN]);
-                                delete map[SIN];
-                            }
-                            else {
-                                //This should actually be redundant code but let's put just in case
-                                t = _.multiply(symbol, map[SIN]);
-                                delete map[SIN];
-                            }
-
-                            retval = t;
-                        }
+                        else if(fname === SIN && map[SIN]) {}
                         else {
                             map[fname] = symbol;

[NoCoverage] ConditionalExpression
Calculus.js:336:32
                             retval = _.multiply(retval, t);
                         }
                         else if(fname === SIN && map[SIN]) {
-                            if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
+                            if(false) {
                                 t = sinAsinBtransform(symbol, map[SIN]);
                                 delete map[SIN];

[NoCoverage] ConditionalExpression
Calculus.js:336:32
                             retval = _.multiply(retval, t);
                         }
                         else if(fname === SIN && map[SIN]) {
-                            if(map[SIN].args[0].toString() !== symbol.args[0].toString()) {
+                            if(true) {
                                 t = sinAsinBtransform(symbol, map[SIN]);
                                 delete map[SIN];

[NoCoverage] BlockStatement
Calculus.js:340:34
                                 t = sinAsinBtransform(symbol, map[SIN]);
                                 delete map[SIN];
                             }
-                            else {
-                                //This should actually be redundant code but let's put just in case
-                                t = _.multiply(symbol, map[SIN]);
-                                delete map[SIN];
-                            }
+                            else {}
 
                             retval = t;

[NoCoverage] BlockStatement
Calculus.js:348:30
 
                             retval = t;
                         }
-                        else {
-                            map[fname] = symbol;
-                        }
+                        else {}
                     }
                     else

[Killed] ConditionalExpression
Calculus.js:373:18
         version: '1.4.6',
 
         sum: function (fn, index, start, end) {
-            if(!(index.group === core.groups.S))
+            if(!(false))
                 throw new core.exceptions.NerdamerTypeError('Index must be symbol. ' + text(index) + ' provided');
             index = index.value;
killedBy: calculus should calculate sums correctly
statusReason: ParseError: Index must be symbol. x provided: 1

[Killed] BooleanLiteral
Calculus.js:373:16
         version: '1.4.6',
 
         sum: function (fn, index, start, end) {
-            if(!(index.group === core.groups.S))
+            if(index.group === core.groups.S)
                 throw new core.exceptions.NerdamerTypeError('Index must be symbol. ' + text(index) + ' provided');
             index = index.value;
killedBy: calculus should calculate sums correctly
statusReason: ParseError: Index must be symbol. x provided: 1

[NoCoverage] StringLiteral
Calculus.js:374:102
 
         sum: function (fn, index, start, end) {
             if(!(index.group === core.groups.S))
-                throw new core.exceptions.NerdamerTypeError('Index must be symbol. ' + text(index) + ' provided');
+                throw new core.exceptions.NerdamerTypeError('Index must be symbol. ' + text(index) + "");
             index = index.value;
             var retval;

[Killed] ConditionalExpression
Calculus.js:377:16
                 throw new core.exceptions.NerdamerTypeError('Index must be symbol. ' + text(index) + ' provided');
             index = index.value;
             var retval;
-            if(core.Utils.isNumericSymbol(start) && core.Utils.isNumericSymbol(end)) {
+            if(true) {
                 var modifier = end - start < 200 ? '' : 'PARSE2NUMBER';
                 start = Number(start);
killedBy: TeX features should render TeX output correctly
statusReason: Expected '0' to equal '\sum\limits_{{b}={c}}^{\infty} {a}'.

[Killed] ConditionalExpression
Calculus.js:377:16
                 throw new core.exceptions.NerdamerTypeError('Index must be symbol. ' + text(index) + ' provided');
             index = index.value;
             var retval;
-            if(core.Utils.isNumericSymbol(start) && core.Utils.isNumericSymbol(end)) {
+            if(false) {
                 var modifier = end - start < 200 ? '' : 'PARSE2NUMBER';
                 start = Number(start);
killedBy: calculus should calculate sums correctly
statusReason: Expected 'sum(x+y,x,0,3)' to equal '4*y+6'.

[Killed] ConditionalExpression
Calculus.js:378:32
             index = index.value;
             var retval;
             if(core.Utils.isNumericSymbol(start) && core.Utils.isNumericSymbol(end)) {
-                var modifier = end - start < 200 ? '' : 'PARSE2NUMBER';
+                var modifier = false ? '' : 'PARSE2NUMBER';
                 start = Number(start);
                 end = Number(end);
killedBy: calculus should calculate sums correctly
statusReason: Expected '678593259/325910035' to equal '775334583/372372283'.

[Survived] ArithmeticOperator
Calculus.js:378:32
             index = index.value;
             var retval;
             if(core.Utils.isNumericSymbol(start) && core.Utils.isNumericSymbol(end)) {
-                var modifier = end - start < 200 ? '' : 'PARSE2NUMBER';
+                var modifier = end + start < 200 ? '' : 'PARSE2NUMBER';
                 start = Number(start);
                 end = Number(end);

[Killed] BlockStatement
Calculus.js:381:65
                 var modifier = end - start < 200 ? '' : 'PARSE2NUMBER';
                 start = Number(start);
                 end = Number(end);
-                retval = core.Utils.block(modifier, function () {
-                    var f = fn.text(),
-                            subs = {'~': true}, //lock subs. Is this even being used?
-                            retval = new core.Symbol(0);
-
-                    for(var i = start; i <= end; i++) {
-                        subs[index] = new Symbol(i);
-                        var ans = _.parse(f, subs);
-                        retval = _.add(retval, ans);
-                    }
-                    return retval;
-                });
+                retval = core.Utils.block(modifier, function () {});
             }
             else {
killedBy: calculus should calculate sums correctly
statusReason: ParseError: Unexpected token!: 1

[Survived] BooleanLiteral
Calculus.js:383:42
                 end = Number(end);
                 retval = core.Utils.block(modifier, function () {
                     var f = fn.text(),
-                            subs = {'~': true}, //lock subs. Is this even being used?
+                            subs = {'~': false}, //lock subs. Is this even being used?
                             retval = new core.Symbol(0);
 

[Survived] ObjectLiteral
Calculus.js:383:36
                 end = Number(end);
                 retval = core.Utils.block(modifier, function () {
                     var f = fn.text(),
-                            subs = {'~': true}, //lock subs. Is this even being used?
+                            subs = {}, //lock subs. Is this even being used?
                             retval = new core.Symbol(0);
 
