[Killed] BlockStatement
Solve.js:500:46
                     return _.parse(Number(x));
                 });
 
-                xn1 = xn.add(y, function (x) {
-                    return _.parse(Number(x));
-                });
+                xn1 = xn.add(y, function (x) {});
 
                 //move c is now xn1
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,NaN,y,NaN' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:511:38
 
                 //the expectation is that we're converging to some answer as this point regardless of where we start
                 //this may have to be adjusted at some point because of erroneous assumptions
-                if(iters >= jump_at) {
-                    //check the norm. If the norm is greater than one then it's time to try another point
-                    if(norm > 1) {
-                        //reset the start point at halway
-                        if(tries === halfway)
-                            start = 0;
-                        var sign = tries > halfway ? 1 : -1; //which side are we incrementing
-                        //we increment +n at one side and -n at the other. 
-                        n = (tries % Math.floor(halfway)) + 1;
-                        //adjust the start point
-                        start += (sign * n * jump);
-                        //call restart
-                        return __.solveNonLinearSystem(eqns, --tries, start);
-                    }
-                }
+                if(iters >= jump_at) {}
                 lnorm = norm;
                 iters++;
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2.09193783424198,y,12.54333217541145,z,-4.45139434116947' to equal 'x,1,y,2,z,3'.

[Killed] ConditionalExpression
Solve.js:511:20
 
                 //the expectation is that we're converging to some answer as this point regardless of where we start
                 //this may have to be adjusted at some point because of erroneous assumptions
-                if(iters >= jump_at) {
+                if(true) {
                     //check the norm. If the norm is greater than one then it's time to try another point
                     if(norm > 1) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2'.

[Killed] ConditionalExpression
Solve.js:513:24
                 //this may have to be adjusted at some point because of erroneous assumptions
                 if(iters >= jump_at) {
                     //check the norm. If the norm is greater than one then it's time to try another point
-                    if(norm > 1) {
+                    if(true) {
                         //reset the start point at halway
                         if(tries === halfway)
killedBy: Solve should solve nonlinear system of equations with multiple parameter functions
statusReason: Expected '' to equal 'j,2935.601831019821,x,1334.3644686453729,y,2668.7289372907458,z,2935.601831019821'.

[Killed] ConditionalExpression
Solve.js:513:24
                 //this may have to be adjusted at some point because of erroneous assumptions
                 if(iters >= jump_at) {
                     //check the norm. If the norm is greater than one then it's time to try another point
-                    if(norm > 1) {
+                    if(false) {
                         //reset the start point at halway
                         if(tries === halfway)
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2.09193783424198,y,12.54333217541145,z,-4.45139434116947' to equal 'x,1,y,2,z,3'.

[Survived] ConditionalExpression
Solve.js:515:28
                     //check the norm. If the norm is greater than one then it's time to try another point
                     if(norm > 1) {
                         //reset the start point at halway
-                        if(tries === halfway)
+                        if(true)
                             start = 0;
                         var sign = tries > halfway ? 1 : -1; //which side are we incrementing

[Survived] ConditionalExpression
Solve.js:515:28
                     //check the norm. If the norm is greater than one then it's time to try another point
                     if(norm > 1) {
                         //reset the start point at halway
-                        if(tries === halfway)
+                        if(false)
                             start = 0;
                         var sign = tries > halfway ? 1 : -1; //which side are we incrementing

[Killed] ConditionalExpression
Solve.js:517:36
                         //reset the start point at halway
                         if(tries === halfway)
                             start = 0;
-                        var sign = tries > halfway ? 1 : -1; //which side are we incrementing
+                        var sign = false ? 1 : -1; //which side are we incrementing
                         //we increment +n at one side and -n at the other. 
                         n = (tries % Math.floor(halfway)) + 1;
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2,z,3'.

[Survived] ConditionalExpression
Solve.js:517:36
                         //reset the start point at halway
                         if(tries === halfway)
                             start = 0;
-                        var sign = tries > halfway ? 1 : -1; //which side are we incrementing
+                        var sign = true ? 1 : -1; //which side are we incrementing
                         //we increment +n at one side and -n at the other. 
                         n = (tries % Math.floor(halfway)) + 1;

[Survived] ArithmeticOperator
Solve.js:519:29
                             start = 0;
                         var sign = tries > halfway ? 1 : -1; //which side are we incrementing
                         //we increment +n at one side and -n at the other. 
-                        n = (tries % Math.floor(halfway)) + 1;
+                        n = tries % Math.floor(halfway) - 1;
                         //adjust the start point
                         start += (sign * n * jump);

[Survived] ArithmeticOperator
Solve.js:519:30
                             start = 0;
                         var sign = tries > halfway ? 1 : -1; //which side are we incrementing
                         //we increment +n at one side and -n at the other. 
-                        n = (tries % Math.floor(halfway)) + 1;
+                        n = (tries * Math.floor(halfway)) + 1;
                         //adjust the start point
                         start += (sign * n * jump);

[Killed] ArithmeticOperator
Solve.js:521:35
                         //we increment +n at one side and -n at the other. 
                         n = (tries % Math.floor(halfway)) + 1;
                         //adjust the start point
-                        start += (sign * n * jump);
+                        start += (sign * n / jump);
                         //call restart
                         return __.solveNonLinearSystem(eqns, --tries, start);
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2,z,3'.

[Survived] ArithmeticOperator
Solve.js:521:35
                         //we increment +n at one side and -n at the other. 
                         n = (tries % Math.floor(halfway)) + 1;
                         //adjust the start point
-                        start += (sign * n * jump);
+                        start += (sign / n * jump);
                         //call restart
                         return __.solveNonLinearSystem(eqns, --tries, start);

[Survived] UpdateOperator
Solve.js:523:62
                         //adjust the start point
                         start += (sign * n * jump);
                         //call restart
-                        return __.solveNonLinearSystem(eqns, --tries, start);
+                        return __.solveNonLinearSystem(eqns, ++tries, start);
                     }
                 }

[Timeout] UpdateOperator
Solve.js:527:17
                     }
                 }
                 lnorm = norm;
-                iters++;
+                iters--;
                 norm = d.max();
 

[Killed] ConditionalExpression
Solve.js:531:20
                 norm = d.max();
 
                 //exit early. Revisit if we get bugs
-                if(Number(norm) === Number(lnorm)) {
+                if(true) {
                     break;
                 }
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-6.99700289913026,y,9.99700289913026' to equal 'x,1,y,2'.

[Survived] ConditionalExpression
Solve.js:531:20
                 norm = d.max();
 
                 //exit early. Revisit if we get bugs
-                if(Number(norm) === Number(lnorm)) {
+                if(false) {
                     break;
                 }

[Killed] ConditionalExpression
Solve.js:535:19
                     break;
                 }
             }
-            while(Number(norm) >= Number.EPSILON)
+            while(false)
 
             //return a blank set if nothing was found;
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-6.99700289913026,y,9.99700289913026' to equal 'x,1,y,2'.

[Killed] ConditionalExpression
Solve.js:538:16
             while(Number(norm) >= Number.EPSILON)
 
             //return a blank set if nothing was found;
-            if(!found)
+            if(true)
                 return [];
 
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2'.

[Killed] BooleanLiteral
Solve.js:538:16
             while(Number(norm) >= Number.EPSILON)
 
             //return a blank set if nothing was found;
-            if(!found)
+            if(found)
                 return [];
 
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,1,y,2'.

[NoCoverage] ArrayDeclaration
Solve.js:539:24
 
             //return a blank set if nothing was found;
             if(!found)
-                return [];
+                return ["Stryker was here"];
 
             //return c since that's the answer

[Killed] BlockStatement
Solve.js:542:67
                 return [];
 
             //return c since that's the answer
-            return __.systemSolutions(c, vars, true, function (x) {
-                return core.Utils.round(Number(x), 14);
-            });
+            return __.systemSolutions(c, vars, true, function (x) {});
         },
         systemSolutions: function (result, vars, expand_result, callback) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,,y,' to equal 'x,1,y,2'.

[Survived] BooleanLiteral
Solve.js:542:48
                 return [];
 
             //return c since that's the answer
-            return __.systemSolutions(c, vars, true, function (x) {
+            return __.systemSolutions(c, vars, false, function (x) {
                 return core.Utils.round(Number(x), 14);
             });

[Killed] BlockStatement
Solve.js:546:75
                 return core.Utils.round(Number(x), 14);
             });
         },
-        systemSolutions: function (result, vars, expand_result, callback) {
-            var solutions = core.Settings.SOLUTIONS_AS_OBJECT ? {} : [];
-
-            result.each(function (e, idx) {
-                var solution = (expand_result ? _.expand(e) : e).valueOf();
-                if(callback)
-                    solution = callback.call(e, solution);
-                var variable = vars[idx];
-                if(core.Settings.SOLUTIONS_AS_OBJECT) {
-                    solutions[variable] = solution;
-                }
-                else
-                    solutions.push([variable, solution]); /*NO*/
-            });
-            //done
-            return solutions;
-        },
+        systemSolutions: function (result, vars, expand_result, callback) {},
         /**
          * Solves a system of equations by substitution. This is useful when
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'toString' of undefined

[Killed] BlockStatement
Solve.js:549:43
         systemSolutions: function (result, vars, expand_result, callback) {
             var solutions = core.Settings.SOLUTIONS_AS_OBJECT ? {} : [];
 
-            result.each(function (e, idx) {
-                var solution = (expand_result ? _.expand(e) : e).valueOf();
-                if(callback)
-                    solution = callback.call(e, solution);
-                var variable = vars[idx];
-                if(core.Settings.SOLUTIONS_AS_OBJECT) {
-                    solutions[variable] = solution;
-                }
-                else
-                    solutions.push([variable, solution]); /*NO*/
-            });
+            result.each(function (e, idx) {});
             //done
             return solutions;
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,3,y,-2,z,2'.

[Killed] ConditionalExpression
Solve.js:551:20
 
             result.each(function (e, idx) {
                 var solution = (expand_result ? _.expand(e) : e).valueOf();
-                if(callback)
+                if(false)
                     solution = callback.call(e, solution);
                 var variable = vars[idx];
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,1.0000000000000002,y,1.9999999999999996,z,2.9999999999999996' to equal 'x,1,y,2,z,3'.

[Killed] ConditionalExpression
Solve.js:551:20
 
             result.each(function (e, idx) {
                 var solution = (expand_result ? _.expand(e) : e).valueOf();
-                if(callback)
+                if(true)
                     solution = callback.call(e, solution);
                 var variable = vars[idx];
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'call' of undefined

[Killed] ConditionalExpression
Solve.js:554:20
                 if(callback)
                     solution = callback.call(e, solution);
                 var variable = vars[idx];
-                if(core.Settings.SOLUTIONS_AS_OBJECT) {
+                if(true) {
                     solutions[variable] = solution;
                 }
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,3,y,-2,z,2'.

[Survived] ConditionalExpression
Solve.js:554:20
                 if(callback)
                     solution = callback.call(e, solution);
                 var variable = vars[idx];
-                if(core.Settings.SOLUTIONS_AS_OBJECT) {
+                if(false) {
                     solutions[variable] = solution;
                 }

[Killed] ArrayDeclaration
Solve.js:558:36
                     solutions[variable] = solution;
                 }
                 else
-                    solutions.push([variable, solution]); /*NO*/
+                    solutions.push([]); /*NO*/
             });
             //done
killedBy: Solve should solve system of equations correctly
statusReason: Expected ',,' to equal 'x,3,y,-2,z,2'.

[Killed] BlockStatement
Solve.js:569:52
          * @param {Array} eqns
          * @returns {Array}
          */
-        solveSystemBySubstitution: function (eqns) {
-            // Assume at least 2 equations. The function variables will just return an empty array if undefined is provided
-            var vars_a = variables(eqns[0]);
-            var vars_b = variables(eqns[1]);
-            // Check if it's a circle equation
-            if(eqns.length === 2 && vars_a.length === 2 && core.Utils.arrayEqual(vars_a, vars_b)) {
-                return __.solveCircle(eqns, vars_a);
-            }
-
-            return []; // return an empty set
-        },
+        solveSystemBySubstitution: function (eqns) {},
 
         //https://www.lakeheadu.ca/sites/default/files/uploads/77/docs/RemaniFinal.pdf
killedBy: Solve should solve circle equations
statusReason: TypeError: Cannot read property 'toString' of undefined

[Killed] ConditionalExpression
Solve.js:574:16
             var vars_a = variables(eqns[0]);
             var vars_b = variables(eqns[1]);
             // Check if it's a circle equation
-            if(eqns.length === 2 && vars_a.length === 2 && core.Utils.arrayEqual(vars_a, vars_b)) {
+            if(false) {
                 return __.solveCircle(eqns, vars_a);
             }
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[Killed] BlockStatement
Solve.js:574:99
             var vars_a = variables(eqns[0]);
             var vars_b = variables(eqns[1]);
             // Check if it's a circle equation
-            if(eqns.length === 2 && vars_a.length === 2 && core.Utils.arrayEqual(vars_a, vars_b)) {
-                return __.solveCircle(eqns, vars_a);
-            }
+            if(eqns.length === 2 && vars_a.length === 2 && core.Utils.arrayEqual(vars_a, vars_b)) {}
 
             return []; // return an empty set
killedBy: Solve should solve circle equations
statusReason: Expected '' to equal 'x,1,0,y,0,1'.

[NoCoverage] ArrayDeclaration
Solve.js:578:20
                 return __.solveCircle(eqns, vars_a);
             }
 
-            return []; // return an empty set
+            return ["Stryker was here"]; // return an empty set
         },
 

[Killed] UpdateOperator
Solve.js:592:45
             //check if a var_array was specified
             //nerdamer.clearVars();// this deleted ALL variables: not what we want
             //parse all the equations to LHS. Remember that they come in as strings
-            for(var i = 0; i < eqns.length; i++)
+            for(var i = 0; i < eqns.length; i--)
                 eqns[i] = __.toLHS(eqns[i]);
 
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'split' of undefined

[Killed] ConditionalExpression
Solve.js:592:28
             //check if a var_array was specified
             //nerdamer.clearVars();// this deleted ALL variables: not what we want
             //parse all the equations to LHS. Remember that they come in as strings
-            for(var i = 0; i < eqns.length; i++)
+            for(var i = 0; false; i++)
                 eqns[i] = __.toLHS(eqns[i]);
 
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: _.expand(...).collectSymbols is not a function

[Survived] BooleanLiteral
Solve.js:598:37
             var l = eqns.length,
                     m = new core.Matrix(),
                     c = new core.Matrix(),
-                    expand_result = false,
+                    expand_result = true,
                     vars;
 

[Killed] ConditionalExpression
Solve.js:601:16
                     expand_result = false,
                     vars;
 
-            if(typeof var_array === 'undefined') {
+            if(true) {
                 //check to make sure that all the equations are linear
                 if(!_A.allLinear(eqns)) {
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] ConditionalExpression
Solve.js:601:16
                     expand_result = false,
                     vars;
 
-            if(typeof var_array === 'undefined') {
+            if(false) {
                 //check to make sure that all the equations are linear
                 if(!_A.allLinear(eqns)) {
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
Solve.js:603:20
 
             if(typeof var_array === 'undefined') {
                 //check to make sure that all the equations are linear
-                if(!_A.allLinear(eqns)) {
+                if(false) {
                     try {
                         return __.solveNonLinearSystem(eqns);
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:603:41
 
             if(typeof var_array === 'undefined') {
                 //check to make sure that all the equations are linear
-                if(!_A.allLinear(eqns)) {
-                    try {
-                        return __.solveNonLinearSystem(eqns);
-                    }
-                    catch(e) {
-                        if(e instanceof core.exceptions.DivisionByZero) {
-                            return __.solveSystemBySubstitution(eqns);
-                        }
-                    }
-                }
+                if(!_A.allLinear(eqns)) {}
 
                 vars = core.Utils.arrayGetVariables(eqns);
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:604:25
             if(typeof var_array === 'undefined') {
                 //check to make sure that all the equations are linear
                 if(!_A.allLinear(eqns)) {
-                    try {
-                        return __.solveNonLinearSystem(eqns);
-                    }
+                    try {}
                     catch(e) {
                         if(e instanceof core.exceptions.DivisionByZero) {
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-2,y,5' to equal 'x,1,y,2'.

[Killed] BlockStatement
Solve.js:607:30
                     try {
                         return __.solveNonLinearSystem(eqns);
                     }
-                    catch(e) {
-                        if(e instanceof core.exceptions.DivisionByZero) {
-                            return __.solveSystemBySubstitution(eqns);
-                        }
-                    }
+                    catch(e) {}
                 }
 
killedBy: Solve should solve circle equations
statusReason: SolveError: System does not have a distinct solution

[Killed] ConditionalExpression
Solve.js:608:28
                         return __.solveNonLinearSystem(eqns);
                     }
                     catch(e) {
-                        if(e instanceof core.exceptions.DivisionByZero) {
+                        if(true) {
                             return __.solveSystemBySubstitution(eqns);
                         }
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,0'.

[Killed] ConditionalExpression
Solve.js:608:28
                         return __.solveNonLinearSystem(eqns);
                     }
                     catch(e) {
-                        if(e instanceof core.exceptions.DivisionByZero) {
+                        if(false) {
                             return __.solveSystemBySubstitution(eqns);
                         }
killedBy: Solve should solve circle equations
statusReason: SolveError: System does not have a distinct solution

[Killed] ConditionalExpression
Solve.js:619:20
                 // If the system only has one variable then we solve for the first one and 
                 // then test the remaining equations with that solution. If any of the remaining
                 // equation fails then the system has no solution
-                if(vars.length === 1) {
+                if(true) {
                     var n = 0,
                         sol, e;
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,3,y,-2,z,2'.

[Killed] ConditionalExpression
Solve.js:619:20
                 // If the system only has one variable then we solve for the first one and 
                 // then test the remaining equations with that solution. If any of the remaining
                 // equation fails then the system has no solution
-                if(vars.length === 1) {
+                if(false) {
                     var n = 0,
                         sol, e;
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property '1' of undefined

[Killed] BlockStatement
Solve.js:622:24
                 if(vars.length === 1) {
                     var n = 0,
                         sol, e;
-                    do {
-                        var e = eqns[n].clone();
-                        
-                        if(n > 0) {
-                            e = e.sub(vars[0], sol[0]);
-                        }
-
-                        sol = solve(e, vars[0]);
-                        // Skip the first one
-                        if(n === 0) 
-                            continue;
-                    }
+                    do {}
                     while(++n < eqns.length)
                         
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
Solve.js:625:28
                     do {
                         var e = eqns[n].clone();
                         
-                        if(n > 0) {
+                        if(true) {
                             e = e.sub(vars[0], sol[0]);
                         }
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property '0' of undefined

[Survived] ConditionalExpression
Solve.js:625:28
                     do {
                         var e = eqns[n].clone();
                         
-                        if(n > 0) {
+                        if(false) {
                             e = e.sub(vars[0], sol[0]);
                         }

[Survived] ConditionalExpression
Solve.js:631:28
 
                         sol = solve(e, vars[0]);
                         // Skip the first one
-                        if(n === 0) 
+                        if(false) 
                             continue;
                     }

[Survived] ConditionalExpression
Solve.js:631:28
 
                         sol = solve(e, vars[0]);
                         // Skip the first one
-                        if(n === 0) 
+                        if(true) 
                             continue;
                     }

[Killed] UpdateOperator
Solve.js:634:27
                         if(n === 0) 
                             continue;
                     }
-                    while(++n < eqns.length)
+                    while(--n < eqns.length)
                         
                     // Format the output
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'clone' of undefined

[Survived] ConditionalExpression
Solve.js:634:27
                         if(n === 0) 
                             continue;
                     }
-                    while(++n < eqns.length)
+                    while(false)
                         
                     // Format the output

[Killed] ConditionalExpression
Solve.js:638:24
                         
                     // Format the output
                     var solutions;
-                    if(Settings.SOLUTIONS_AS_OBJECT) {
+                    if(true) {
                         solutions = {};
                         solutions[vars[0]] = sol;
killedBy: Solve should solve system of equations correctly
statusReason: Expected '[object Object]' to equal 'x,0'.

[Survived] ConditionalExpression
Solve.js:638:24
                         
                     // Format the output
                     var solutions;
-                    if(Settings.SOLUTIONS_AS_OBJECT) {
+                    if(false) {
                         solutions = {};
                         solutions[vars[0]] = sol;

[Killed] ConditionalExpression
Solve.js:642:29
                         solutions = {};
                         solutions[vars[0]] = sol;
                     }
-                    else if(sol.length === 0) {
+                    else if(true) {
                         solutions = sol; // No solutions
                     }
killedBy: Solve should solve system of equations correctly
statusReason: Expected '0' to equal 'x,0'.

[Survived] ConditionalExpression
Solve.js:642:29
                         solutions = {};
                         solutions[vars[0]] = sol;
                     }
-                    else if(sol.length === 0) {
+                    else if(false) {
                         solutions = sol; // No solutions
                     }

[Killed] BlockStatement
Solve.js:645:26
                     else if(sol.length === 0) {
                         solutions = sol; // No solutions
                     }
-                    else {
-                        solutions = [vars[0], sol];
-                    }
+                    else {}
                         
                     return solutions;
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'toString' of undefined

[Killed] ArrayDeclaration
Solve.js:646:37
                         solutions = sol; // No solutions
                     }
                     else {
-                        solutions = [vars[0], sol];
+                        solutions = [];
                     }
                         
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,0'.
