[Killed] ConditionalExpression
Solve.js:657:20
                 // of variables. We then solve those and then evaluate the remaining equations
                 // with those solutions. If the all equal true then those are just redundant
                 // equations and we can return the solution set.
-                if(vars.length < eqns.length) {
+                if(true) {
                     var reduced = [];
                     var n = eqns.length;
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Survived] ConditionalExpression
Solve.js:657:20
                 // of variables. We then solve those and then evaluate the remaining equations
                 // with those solutions. If the all equal true then those are just redundant
                 // equations and we can return the solution set.
-                if(vars.length < eqns.length) {
+                if(false) {
                     var reduced = [];
                     var n = eqns.length;

[NoCoverage] ArrayDeclaration
Solve.js:658:35
                 // with those solutions. If the all equal true then those are just redundant
                 // equations and we can return the solution set.
                 if(vars.length < eqns.length) {
-                    var reduced = [];
+                    var reduced = ["Stryker was here"];
                     var n = eqns.length;
                     for(var i = 0; i < n - 1; i++) {

[NoCoverage] ArithmeticOperator
Solve.js:660:40
                 if(vars.length < eqns.length) {
                     var reduced = [];
                     var n = eqns.length;
-                    for(var i = 0; i < n - 1; i++) {
+                    for(var i = 0; i < n + 1; i++) {
                         reduced.push(_.parse(eqns[i]));
                     }

[NoCoverage] UpdateOperator
Solve.js:660:47
                 if(vars.length < eqns.length) {
                     var reduced = [];
                     var n = eqns.length;
-                    for(var i = 0; i < n - 1; i++) {
+                    for(var i = 0; i < n - 1; i--) {
                         reduced.push(_.parse(eqns[i]));
                     }

[NoCoverage] BlockStatement
Solve.js:667:50
                     var knowns = {};
                     var solutions = __.solveSystem(reduced, vars);
                     // The solutions may have come back as an array
-                    if(Array.isArray(solutions)) {
-                        solutions.forEach(function (sol) {
-                            knowns[sol[0]] = sol[1];
-                        });
-                    }
+                    if(Array.isArray(solutions)) {}
                     else {
                         knowns = solutions;

[NoCoverage] ConditionalExpression
Solve.js:667:24
                     var knowns = {};
                     var solutions = __.solveSystem(reduced, vars);
                     // The solutions may have come back as an array
-                    if(Array.isArray(solutions)) {
+                    if(false) {
                         solutions.forEach(function (sol) {
                             knowns[sol[0]] = sol[1];

[NoCoverage] BlockStatement
Solve.js:668:58
                     var solutions = __.solveSystem(reduced, vars);
                     // The solutions may have come back as an array
                     if(Array.isArray(solutions)) {
-                        solutions.forEach(function (sol) {
-                            knowns[sol[0]] = sol[1];
-                        });
+                        solutions.forEach(function (sol) {});
                     }
                     else {

[NoCoverage] BlockStatement
Solve.js:672:26
                             knowns[sol[0]] = sol[1];
                         });
                     }
-                    else {
-                        knowns = solutions;
-                    }
+                    else {}
 
                     // Start by assuming they will all evaluate to zero. If even one fails

[NoCoverage] BooleanLiteral
Solve.js:678:36
 
                     // Start by assuming they will all evaluate to zero. If even one fails
                     // then all zero will be false
-                    var all_zero = true;
+                    var all_zero = false;
                     // Check if the last solution evalutes to zero given these solutions
                     for(var i = n - 1; i < n; i++) {

[NoCoverage] UpdateOperator
Solve.js:680:47
                     // then all zero will be false
                     var all_zero = true;
                     // Check if the last solution evalutes to zero given these solutions
-                    for(var i = n - 1; i < n; i++) {
+                    for(var i = n - 1; i < n; i--) {
                         if(!_.parse(eqns[i], knowns).equals(0)) {
                             all_zero = false;

[NoCoverage] ConditionalExpression
Solve.js:680:40
                     // then all zero will be false
                     var all_zero = true;
                     // Check if the last solution evalutes to zero given these solutions
-                    for(var i = n - 1; i < n; i++) {
+                    for(var i = n - 1; false; i++) {
                         if(!_.parse(eqns[i], knowns).equals(0)) {
                             all_zero = false;

[NoCoverage] BooleanLiteral
Solve.js:681:28
                     var all_zero = true;
                     // Check if the last solution evalutes to zero given these solutions
                     for(var i = n - 1; i < n; i++) {
-                        if(!_.parse(eqns[i], knowns).equals(0)) {
+                        if(_.parse(eqns[i], knowns).equals(0)) {
                             all_zero = false;
                         }

[NoCoverage] BlockStatement
Solve.js:681:65
                     var all_zero = true;
                     // Check if the last solution evalutes to zero given these solutions
                     for(var i = n - 1; i < n; i++) {
-                        if(!_.parse(eqns[i], knowns).equals(0)) {
-                            all_zero = false;
-                        }
+                        if(!_.parse(eqns[i], knowns).equals(0)) {}
                     }
 

[NoCoverage] BooleanLiteral
Solve.js:682:40
                     // Check if the last solution evalutes to zero given these solutions
                     for(var i = n - 1; i < n; i++) {
                         if(!_.parse(eqns[i], knowns).equals(0)) {
-                            all_zero = false;
+                            all_zero = true;
                         }
                     }

[NoCoverage] ConditionalExpression
Solve.js:686:24
                         }
                     }
 
-                    if(all_zero) {
+                    if(true) {
                         return solutions;
                     }

[NoCoverage] ConditionalExpression
Solve.js:686:24
                         }
                     }
 
-                    if(all_zero) {
+                    if(false) {
                         return solutions;
                     }

[Survived] BlockStatement
Solve.js:692:54
                 }
 
                 // deletes only the variables of the linear equations in the nerdamer namespace
-                for(var i = 0; i < vars.length; i++) {
-                    nerdamer.setVar(vars[i], "delete");
-                }
+                for(var i = 0; i < vars.length; i++) {}
                 // TODO: move this to cMatrix or something similar
                 // populate the matrix

[Timeout] UpdateOperator
Solve.js:692:49
                 }
 
                 // deletes only the variables of the linear equations in the nerdamer namespace
-                for(var i = 0; i < vars.length; i++) {
+                for(var i = 0; i < vars.length; i--) {
                     nerdamer.setVar(vars[i], "delete");
                 }

[Killed] UpdateOperator
Solve.js:697:39
                 }
                 // TODO: move this to cMatrix or something similar
                 // populate the matrix
-                for(var i = 0; i < l; i++) {
+                for(var i = 0; i < l; i--) {
                     var e = eqns[i]; //store the expression
                     // Iterate over the columns
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'each' of undefined

[Killed] ConditionalExpression
Solve.js:697:32
                 }
                 // TODO: move this to cMatrix or something similar
                 // populate the matrix
-                for(var i = 0; i < l; i++) {
+                for(var i = 0; false; i++) {
                     var e = eqns[i]; //store the expression
                     // Iterate over the columns
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
Solve.js:700:58
                 for(var i = 0; i < l; i++) {
                     var e = eqns[i]; //store the expression
                     // Iterate over the columns
-                    for(var j = 0; j < vars.length; j++) {
-                        var v = vars[j];
-                        var coeffs = [];
-                        e.each(function (x) {
-                            if(x.contains(v)) {
-                                coeffs = coeffs.concat(x.coeffs());
-                            }
-                        });
-
-                        var cf = core.Utils.arraySum(coeffs);
-                        m.set(i, j, cf);
-                    }
+                    for(var j = 0; j < vars.length; j++) {}
 
                     //strip the variables from the symbol so we're left with only the zeroth coefficient
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
Solve.js:700:36
                 for(var i = 0; i < l; i++) {
                     var e = eqns[i]; //store the expression
                     // Iterate over the columns
-                    for(var j = 0; j < vars.length; j++) {
+                    for(var j = 0; false; j++) {
                         var v = vars[j];
                         var coeffs = [];
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
Solve.js:703:45
                     for(var j = 0; j < vars.length; j++) {
                         var v = vars[j];
                         var coeffs = [];
-                        e.each(function (x) {
-                            if(x.contains(v)) {
-                                coeffs = coeffs.concat(x.coeffs());
-                            }
-                        });
+                        e.each(function (x) {});
 
                         var cf = core.Utils.arraySum(coeffs);
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] BlockStatement
Solve.js:704:47
                         var v = vars[j];
                         var coeffs = [];
                         e.each(function (x) {
-                            if(x.contains(v)) {
-                                coeffs = coeffs.concat(x.coeffs());
-                            }
+                            if(x.contains(v)) {}
                         });
 
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] ConditionalExpression
Solve.js:704:32
                         var v = vars[j];
                         var coeffs = [];
                         e.each(function (x) {
-                            if(x.contains(v)) {
+                            if(true) {
                                 coeffs = coeffs.concat(x.coeffs());
                             }
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] BlockStatement
Solve.js:716:43
                     //strip the variables from the symbol so we're left with only the zeroth coefficient
                     //start with the symbol and remove each variable and its coefficient
                     var num = e.clone();
-                    vars.map(function (e) {
-                        num = num.stripVar(e, true);
-                    });
+                    vars.map(function (e) {});
                     c.set(i, 0, num.negate());
                 }
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,0.5*(-2*x+6),y,-2-y,z,-z+2' to equal 'x,3,y,-2,z,2'.

[Survived] BooleanLiteral
Solve.js:717:47
                     //start with the symbol and remove each variable and its coefficient
                     var num = e.clone();
                     vars.map(function (e) {
-                        num = num.stripVar(e, true);
+                        num = num.stripVar(e, false);
                     });
                     c.set(i, 0, num.negate());

[Survived] BooleanLiteral
Solve.js:730:33
                  * is we stop since it's not linear.
                  */
                 vars = var_array;
-                expand_result = true;
+                expand_result = false;
                 for(i = 0; i < l; i++) {
                     //prefill

[Killed] UpdateOperator
Solve.js:731:35
                  */
                 vars = var_array;
                 expand_result = true;
-                for(i = 0; i < l; i++) {
+                for(i = 0; i < l; i--) {
                     //prefill
                     c.set(i, 0, new Symbol(0));
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'group' of undefined

[Killed] ConditionalExpression
Solve.js:731:28
                  */
                 vars = var_array;
                 expand_result = true;
-                for(i = 0; i < l; i++) {
+                for(i = 0; false; i++) {
                     //prefill
                     c.set(i, 0, new Symbol(0));
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
Solve.js:736:63
                     c.set(i, 0, new Symbol(0));
                     var e = _.expand(eqns[i]).collectSymbols(); //expand and store
                     //go trough each of the variables
-                    for(var j = 0; j < var_array.length; j++) {
-                        m.set(i, j, new Symbol(0));
-                        var v = var_array[j];
-                        //go through the terms and sort the variables
-                        for(var k = 0; k < e.length; k++) {
-                            var term = e[k],
-                                    check = false;
-                            for(var z = 0; z < var_array.length; z++) {
-                                //check to see if terms contain multiple variables
-                                if(term.contains(var_array[z])) {
-                                    if(check)
-                                        core.err('Multiple variables found for term ' + term);
-                                    check = true;
-                                }
-                            }
-                            //we made sure that every term contains one variable so it's safe to assume that if the
-                            //variable is found then the remainder is the coefficient.
-                            if(term.contains(v)) {
-                                var tparts = explode(remove(e, k), v);
-                                m.set(i, j, _.add(m.get(i, j), tparts[0]));
-                            }
-                        }
-                    }
+                    for(var j = 0; j < var_array.length; j++) {}
                     //all the remaining terms go to the c matrix
                     for(k = 0; k < e.length; k++) {
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
Solve.js:736:36
                     c.set(i, 0, new Symbol(0));
                     var e = _.expand(eqns[i]).collectSymbols(); //expand and store
                     //go trough each of the variables
-                    for(var j = 0; j < var_array.length; j++) {
+                    for(var j = 0; false; j++) {
                         m.set(i, j, new Symbol(0));
                         var v = var_array[j];
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] UpdateOperator
Solve.js:740:54
                         m.set(i, j, new Symbol(0));
                         var v = var_array[j];
                         //go through the terms and sort the variables
-                        for(var k = 0; k < e.length; k++) {
+                        for(var k = 0; k < e.length; k--) {
                             var term = e[k],
                                     check = false;
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: Cannot read property 'contains' of undefined

[Killed] ConditionalExpression
Solve.js:740:40
                         m.set(i, j, new Symbol(0));
                         var v = var_array[j];
                         //go through the terms and sort the variables
-                        for(var k = 0; k < e.length; k++) {
+                        for(var k = 0; false; k++) {
                             var term = e[k],
                                     check = false;
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] BooleanLiteral
Solve.js:742:45
                         //go through the terms and sort the variables
                         for(var k = 0; k < e.length; k++) {
                             var term = e[k],
-                                    check = false;
+                                    check = true;
                             for(var z = 0; z < var_array.length; z++) {
                                 //check to see if terms contain multiple variables
killedBy: Solve should solve system of equations correctly
statusReason: Error: Multiple variables found for term x

[Timeout] UpdateOperator
Solve.js:743:66
                         for(var k = 0; k < e.length; k++) {
                             var term = e[k],
                                     check = false;
-                            for(var z = 0; z < var_array.length; z++) {
+                            for(var z = 0; z < var_array.length; z--) {
                                 //check to see if terms contain multiple variables
                                 if(term.contains(var_array[z])) {

[Survived] ConditionalExpression
Solve.js:743:44
                         for(var k = 0; k < e.length; k++) {
                             var term = e[k],
                                     check = false;
-                            for(var z = 0; z < var_array.length; z++) {
+                            for(var z = 0; false; z++) {
                                 //check to see if terms contain multiple variables
                                 if(term.contains(var_array[z])) {

[Killed] ConditionalExpression
Solve.js:745:36
                                     check = false;
                             for(var z = 0; z < var_array.length; z++) {
                                 //check to see if terms contain multiple variables
-                                if(term.contains(var_array[z])) {
+                                if(true) {
                                     if(check)
                                         core.err('Multiple variables found for term ' + term);
killedBy: Solve should solve system of equations correctly
statusReason: Error: Multiple variables found for term -a

[Survived] BlockStatement
Solve.js:745:65
                                     check = false;
                             for(var z = 0; z < var_array.length; z++) {
                                 //check to see if terms contain multiple variables
-                                if(term.contains(var_array[z])) {
-                                    if(check)
-                                        core.err('Multiple variables found for term ' + term);
-                                    check = true;
-                                }
+                                if(term.contains(var_array[z])) {}
                             }
                             //we made sure that every term contains one variable so it's safe to assume that if the

[Killed] ConditionalExpression
Solve.js:746:40
                             for(var z = 0; z < var_array.length; z++) {
                                 //check to see if terms contain multiple variables
                                 if(term.contains(var_array[z])) {
-                                    if(check)
+                                    if(true)
                                         core.err('Multiple variables found for term ' + term);
                                     check = true;
killedBy: Solve should solve system of equations correctly
statusReason: Error: Multiple variables found for term x

[Survived] ConditionalExpression
Solve.js:746:40
                             for(var z = 0; z < var_array.length; z++) {
                                 //check to see if terms contain multiple variables
                                 if(term.contains(var_array[z])) {
-                                    if(check)
+                                    if(false)
                                         core.err('Multiple variables found for term ' + term);
                                     check = true;

[Survived] BooleanLiteral
Solve.js:748:45
                                 if(term.contains(var_array[z])) {
                                     if(check)
                                         core.err('Multiple variables found for term ' + term);
-                                    check = true;
+                                    check = false;
                                 }
                             }

[Killed] ConditionalExpression
Solve.js:753:32
                             }
                             //we made sure that every term contains one variable so it's safe to assume that if the
                             //variable is found then the remainder is the coefficient.
-                            if(term.contains(v)) {
+                            if(true) {
                                 var tparts = explode(remove(e, k), v);
                                 m.set(i, j, _.add(m.get(i, j), tparts[0]));
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] ConditionalExpression
Solve.js:753:32
                             }
                             //we made sure that every term contains one variable so it's safe to assume that if the
                             //variable is found then the remainder is the coefficient.
-                            if(term.contains(v)) {
+                            if(false) {
                                 var tparts = explode(remove(e, k), v);
                                 m.set(i, j, _.add(m.get(i, j), tparts[0]));
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Killed] BlockStatement
Solve.js:760:51
                         }
                     }
                     //all the remaining terms go to the c matrix
-                    for(k = 0; k < e.length; k++) {
-                        c.set(i, 0, _.add(c.get(i, 0), e[k]));
-                    }
+                    for(k = 0; k < e.length; k++) {}
                 }
                 //consider case (a+b)*I+u
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,0,y,0,z,0' to equal 'x,0.5*a+0.5*b,y,-0.5*b+0.5*a,z,-0.5*a+0.5*b+c'.

[Killed] ConditionalExpression
Solve.js:760:32
                         }
                     }
                     //all the remaining terms go to the c matrix
-                    for(k = 0; k < e.length; k++) {
+                    for(k = 0; false; k++) {
                         c.set(i, 0, _.add(c.get(i, 0), e[k]));
                     }
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,0,y,0,z,0' to equal 'x,0.5*a+0.5*b,y,-0.5*b+0.5*a,z,-0.5*a+0.5*b+c'.

[Killed] ConditionalExpression
Solve.js:768:16
             }
 
             //check if the system has a distinct solution
-            if(vars.length !== eqns.length || m.determinant().equals(0)) {
+            if(true) {
                 // solve the system by hand
                 //return __.solveSystemBySubstitution(eqns, vars, m, c);
killedBy: Solve should solve system of equations correctly
statusReason: SolveError: System does not have a distinct solution

[Survived] ConditionalExpression
Solve.js:768:16
             }
 
             //check if the system has a distinct solution
-            if(vars.length !== eqns.length || m.determinant().equals(0)) {
+            if(false) {
                 // solve the system by hand
                 //return __.solveSystemBySubstitution(eqns, vars, m, c);

[NoCoverage] StringLiteral
Solve.js:771:54
             if(vars.length !== eqns.length || m.determinant().equals(0)) {
                 // solve the system by hand
                 //return __.solveSystemBySubstitution(eqns, vars, m, c);
-                throw new core.exceptions.SolveError('System does not have a distinct solution');
+                throw new core.exceptions.SolveError("");
             }
 

[Killed] ConditionalExpression
Solve.js:778:16
             m = m.invert();
             var result = m.multiply(c);
             //correct the sign as per issue #410
-            if(core.Utils.isArray(var_array))
+            if(true)
                 result.each(function (x) {
                     return x.negate();
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-3,y,2,z,-2' to equal 'x,3,y,-2,z,2'.

[Killed] ConditionalExpression
Solve.js:778:16
             m = m.invert();
             var result = m.multiply(c);
             //correct the sign as per issue #410
-            if(core.Utils.isArray(var_array))
+            if(false)
                 result.each(function (x) {
                     return x.negate();
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-0.5*a-0.5*b,y,-0.5*a+0.5*b,z,-0.5*b-c+0.5*a' to equal 'x,0.5*a+0.5*b,y,-0.5*b+0.5*a,z,-0.5*a+0.5*b+c'.

[Killed] BlockStatement
Solve.js:779:42
             var result = m.multiply(c);
             //correct the sign as per issue #410
             if(core.Utils.isArray(var_array))
-                result.each(function (x) {
-                    return x.negate();
-                });
+                result.each(function (x) {});
 
             return __.systemSolutions(result, vars, expand_result);
killedBy: Solve should solve system of equations correctly
statusReason: Expected 'x,-0.5*a-0.5*b,y,-0.5*a+0.5*b,z,-0.5*b-c+0.5*a' to equal 'x,0.5*a+0.5*b,y,-0.5*b+0.5*a,z,-0.5*a+0.5*b+c'.

[Killed] BlockStatement
Solve.js:792:34
          * @param {Symbol} a
          * @returns {Symbol}
          */
-        quad: function (c, b, a) {
-            var discriminant = _.subtract(_.pow(b.clone(), Symbol(2)), _.multiply(_.multiply(a.clone(), c.clone()), Symbol(4)))/*b^2 - 4ac*/;
-            // Fix for #608
-            discriminant = _.expand(discriminant);
-            var det = _.pow(discriminant, Symbol(0.5));
-            var den = _.parse(_.multiply(new Symbol(2), a.clone()));
-            var retval = [
-                _.parse(format('(-({0})+({1}))/({2})', b, det, den)),
-                _.parse(format('(-({0})-({1}))/({2})', b, det, den))
-            ];
-
-            return retval;
-        },
+        quad: function (c, b, a) {},
         /**
          * The cubic equation
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'group' of undefined: 1

[Killed] StringLiteral
Solve.js:800:32
             var den = _.parse(_.multiply(new Symbol(2), a.clone()));
             var retval = [
                 _.parse(format('(-({0})+({1}))/({2})', b, det, den)),
-                _.parse(format('(-({0})-({1}))/({2})', b, det, den))
+                _.parse(format("", b, det, den))
             ];
 
killedBy: Solve should solve correctly
statusReason: Expected '[i,0]' to equal '[i,-i]'.
