[Killed] StringLiteral
Calculus.js:551:46
                             symbol = _.parse('-(sqrt(1-(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
                         case ATAN:
-                            symbol = _.parse('(1+(' + text(symbol.args[0]) + ')^2)^(-1)');
+                            symbol = _.parse("" + text(symbol.args[0]) + ')^2)^(-1)');
                             break;
                         case ABS:
killedBy: calculus should integrate properly
statusReason: ParseError: Missing open bracket for bracket at: 2: 1

[Killed] ConditionalExpression
Calculus.js:553:25
                         case ATAN:
                             symbol = _.parse('(1+(' + text(symbol.args[0]) + ')^2)^(-1)');
                             break;
-                        case ABS:
-                            m = symbol.multiplier.clone();
-                            symbol.toUnitMultiplier();
-                            //depending on the complexity of the symbol it's easier to just parse it into a new symbol
-                            //this should really be readdressed soon
-                            b = symbol.args[0].clone();
-                            b.toUnitMultiplier();
-                            symbol = _.parse(inBrackets(text(symbol.args[0])) + '/abs' + inBrackets(text(b)));
-                            symbol.multiplier = m;
-                            break;
+                        case ABS:
                         case 'parens':
                             //see product rule: f'.g goes to zero since f' will return zero. This way we only get back
killedBy: calculus should differentiate correctly

[NoCoverage] ConditionalExpression
Calculus.js:563:25
                             symbol = _.parse(inBrackets(text(symbol.args[0])) + '/abs' + inBrackets(text(b)));
                             symbol.multiplier = m;
                             break;
-                        case 'parens':
-                            //see product rule: f'.g goes to zero since f' will return zero. This way we only get back
-                            //1*g'
-                            symbol = Symbol(1);
-                            break;
+                        case 'parens':
                         case 'cosh':
                             //cosh -> -sinh

[Survived] StringLiteral
Calculus.js:563:30
                             symbol = _.parse(inBrackets(text(symbol.args[0])) + '/abs' + inBrackets(text(b)));
                             symbol.multiplier = m;
                             break;
-                        case 'parens':
+                        case "":
                             //see product rule: f'.g goes to zero since f' will return zero. This way we only get back
                             //1*g'

[NoCoverage] ConditionalExpression
Calculus.js:568:25
                             //1*g'
                             symbol = Symbol(1);
                             break;
-                        case 'cosh':
-                            //cosh -> -sinh
-                            symbol.fname = 'sinh';
-                            break;
+                        case 'cosh':
                         case 'sinh':
                             //sinh -> cosh

[NoCoverage] StringLiteral
Calculus.js:570:44
                             break;
                         case 'cosh':
                             //cosh -> -sinh
-                            symbol.fname = 'sinh';
+                            symbol.fname = "";
                             break;
                         case 'sinh':

[Killed] ConditionalExpression
Calculus.js:572:25
                             //cosh -> -sinh
                             symbol.fname = 'sinh';
                             break;
-                        case 'sinh':
-                            //sinh -> cosh
-                            symbol.fname = 'cosh';
-                            break;
+                        case 'sinh':
                         case TANH:
                             //tanh -> sech^2
killedBy: calculus should differentiate correctly
statusReason: Expected '(-log(sinh(x^2))*sin(x)+2*cos(x)*sech(x^2)^2*sinh(x^2)^(-1)*x)*sinh(x^2)^cos(x)' to equal '(-log(sinh(x^2))*sin(x)+2*cos(x)*cosh(x^2)*sinh(x^2)^(-1)*x)*sinh(x^2)^cos(x)'.

[Killed] StringLiteral
Calculus.js:574:44
                             break;
                         case 'sinh':
                             //sinh -> cosh
-                            symbol.fname = 'cosh';
+                            symbol.fname = "";
                             break;
                         case TANH:
killedBy: calculus should differentiate correctly
statusReason: Expected '(-log(sinh(x^2))*sin(x)+2*(x^2)*cos(x)*sinh(x^2)^(-1)*x)*sinh(x^2)^cos(x)' to equal '(-log(sinh(x^2))*sin(x)+2*cos(x)*cosh(x^2)*sinh(x^2)^(-1)*x)*sinh(x^2)^cos(x)'.

[Killed] ConditionalExpression
Calculus.js:576:25
                             //sinh -> cosh
                             symbol.fname = 'cosh';
                             break;
-                        case TANH:
-                            //tanh -> sech^2
-                            symbol.fname = SECH;
-                            symbol.power = new Frac(2);
-                            break;
+                        case TANH:
                         case SECH:
                             // Use a clone if this gives errors
killedBy: calculus should differentiate correctly
statusReason: Expected '-tan(x)*tanh(x)^2+sec(x)^2*tanh(x)' to equal 'sec(x)^2*tanh(x)+sech(x)^2*tan(x)'.

[NoCoverage] ConditionalExpression
Calculus.js:581:25
                             symbol.fname = SECH;
                             symbol.power = new Frac(2);
                             break;
-                        case SECH:
-                            // Use a clone if this gives errors
-                            symbol = qdiff(symbol, '-tanh');
-                            break;
+                        case SECH:
                         case CSCH:
                             var arg = String(symbol.args[0]);

[NoCoverage] ConditionalExpression
Calculus.js:585:25
                             // Use a clone if this gives errors
                             symbol = qdiff(symbol, '-tanh');
                             break;
-                        case CSCH:
-                            var arg = String(symbol.args[0]);
-                            return _.parse('-coth(' + arg + ')*csch(' + arg + ')');
-                            break;
+                        case CSCH:
                         case COTH:
                             var arg = String(symbol.args[0]);

[NoCoverage] ConditionalExpression
Calculus.js:589:25
                             var arg = String(symbol.args[0]);
                             return _.parse('-coth(' + arg + ')*csch(' + arg + ')');
                             break;
-                        case COTH:
-                            var arg = String(symbol.args[0]);
-                            return _.parse('-csch(' + arg + ')^2');
-                            break;
+                        case COTH:
                         case 'asinh':
                             symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + ')^2))^(-1)');

[NoCoverage] ConditionalExpression
Calculus.js:593:25
                             var arg = String(symbol.args[0]);
                             return _.parse('-csch(' + arg + ')^2');
                             break;
-                        case 'asinh':
-                            symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + ')^2))^(-1)');
-                            break;
+                        case 'asinh':
                         case 'acosh':
                             symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');

[Survived] StringLiteral
Calculus.js:593:30
                             var arg = String(symbol.args[0]);
                             return _.parse('-csch(' + arg + ')^2');
                             break;
-                        case 'asinh':
+                        case "":
                             symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;

[NoCoverage] StringLiteral
Calculus.js:594:83
                             return _.parse('-csch(' + arg + ')^2');
                             break;
                         case 'asinh':
-                            symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + ')^2))^(-1)');
+                            symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + "");
                             break;
                         case 'acosh':

[NoCoverage] ConditionalExpression
Calculus.js:596:25
                         case 'asinh':
                             symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
-                        case 'acosh':
-                            symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');
-                            break;
+                        case 'acosh':
                         case 'atanh':
                             symbol = _.parse('(1-(' + text(symbol.args[0]) + ')^2)^(-1)');

[Survived] StringLiteral
Calculus.js:596:30
                         case 'asinh':
                             symbol = _.parse('(sqrt(1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
-                        case 'acosh':
+                        case "":
                             symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;

[NoCoverage] ConditionalExpression
Calculus.js:599:25
                         case 'acosh':
                             symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
-                        case 'atanh':
-                            symbol = _.parse('(1-(' + text(symbol.args[0]) + ')^2)^(-1)');
-                            break;
+                        case 'atanh':
                         case ASECH:
                             var arg = String(symbol.args[0]);

[Survived] StringLiteral
Calculus.js:599:30
                         case 'acosh':
                             symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
-                        case 'atanh':
+                        case "":
                             symbol = _.parse('(1-(' + text(symbol.args[0]) + ')^2)^(-1)');
                             break;

[NoCoverage] StringLiteral
Calculus.js:600:78
                             symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
                         case 'atanh':
-                            symbol = _.parse('(1-(' + text(symbol.args[0]) + ')^2)^(-1)');
+                            symbol = _.parse('(1-(' + text(symbol.args[0]) + "");
                             break;
                         case ASECH:

[NoCoverage] StringLiteral
Calculus.js:600:46
                             symbol = _.parse('(sqrt(-1+(' + text(symbol.args[0]) + ')^2))^(-1)');
                             break;
                         case 'atanh':
-                            symbol = _.parse('(1-(' + text(symbol.args[0]) + ')^2)^(-1)');
+                            symbol = _.parse("" + text(symbol.args[0]) + ')^2)^(-1)');
                             break;
                         case ASECH:

[NoCoverage] ConditionalExpression
Calculus.js:602:25
                         case 'atanh':
                             symbol = _.parse('(1-(' + text(symbol.args[0]) + ')^2)^(-1)');
                             break;
-                        case ASECH:
-                            var arg = String(symbol.args[0]);
-                            symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2-1)*(' + arg + ')^2)');
-                            break;
+                        case ASECH:
                         case ACOTH:
                             symbol = _.parse('-1/((' + symbol.args[0] + ')^2-1)');

[NoCoverage] ConditionalExpression
Calculus.js:606:25
                             var arg = String(symbol.args[0]);
                             symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2-1)*(' + arg + ')^2)');
                             break;
-                        case ACOTH:
-                            symbol = _.parse('-1/((' + symbol.args[0] + ')^2-1)');
-                            break;
+                        case ACOTH:
                         case ACSCH:
                             var arg = String(symbol.args[0]);

[NoCoverage] StringLiteral
Calculus.js:607:73
                             symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2-1)*(' + arg + ')^2)');
                             break;
                         case ACOTH:
-                            symbol = _.parse('-1/((' + symbol.args[0] + ')^2-1)');
+                            symbol = _.parse('-1/((' + symbol.args[0] + "");
                             break;
                         case ACSCH:

[NoCoverage] ConditionalExpression
Calculus.js:609:25
                         case ACOTH:
                             symbol = _.parse('-1/((' + symbol.args[0] + ')^2-1)');
                             break;
-                        case ACSCH:
-                            var arg = String(symbol.args[0]);
-                            symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2+1)*(' + arg + ')^2)');
-                            break;
+                        case ACSCH:
                         case ASEC:
                             var arg = String(symbol.args[0]);

[NoCoverage] StringLiteral
Calculus.js:611:88
                             break;
                         case ACSCH:
                             var arg = String(symbol.args[0]);
-                            symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2+1)*(' + arg + ')^2)');
+                            symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2+1)*(' + arg + "");
                             break;
                         case ASEC:

[NoCoverage] ConditionalExpression
Calculus.js:613:25
                             var arg = String(symbol.args[0]);
                             symbol = _.parse('-1/(sqrt(1/(' + arg + ')^2+1)*(' + arg + ')^2)');
                             break;
-                        case ASEC:
-                            var arg = String(symbol.args[0]);
-                            symbol = _.parse('1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
-                            break;
+                        case ASEC:
                         case ACSC:
                             var arg = String(symbol.args[0]);

[NoCoverage] StringLiteral
Calculus.js:615:70
                             break;
                         case ASEC:
                             var arg = String(symbol.args[0]);
-                            symbol = _.parse('1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
+                            symbol = _.parse('1/(sqrt(1-1/(' + arg + "" + arg + ')^2)');
                             break;
                         case ACSC:

[NoCoverage] StringLiteral
Calculus.js:615:46
                             break;
                         case ASEC:
                             var arg = String(symbol.args[0]);
-                            symbol = _.parse('1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
+                            symbol = _.parse("" + arg + ')^2)*(' + arg + ')^2)');
                             break;
                         case ACSC:

[NoCoverage] ConditionalExpression
Calculus.js:617:25
                             var arg = String(symbol.args[0]);
                             symbol = _.parse('1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
                             break;
-                        case ACSC:
-                            var arg = String(symbol.args[0]);
-                            symbol = _.parse('-1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
-                            break;
+                        case ACSC:
                         case ACOT:
                             symbol = _.parse('-1/((' + symbol.args[0] + ')^2+1)');

[NoCoverage] StringLiteral
Calculus.js:619:46
                             break;
                         case ACSC:
                             var arg = String(symbol.args[0]);
-                            symbol = _.parse('-1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
+                            symbol = _.parse("" + arg + ')^2)*(' + arg + ')^2)');
                             break;
                         case ACOT:

[NoCoverage] ConditionalExpression
Calculus.js:621:25
                             var arg = String(symbol.args[0]);
                             symbol = _.parse('-1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
                             break;
-                        case ACOT:
-                            symbol = _.parse('-1/((' + symbol.args[0] + ')^2+1)');
-                            break;
+                        case ACOT:
                         case 'S':
                             var arg = String(symbol.args[0]);

[NoCoverage] StringLiteral
Calculus.js:622:73
                             symbol = _.parse('-1/(sqrt(1-1/(' + arg + ')^2)*(' + arg + ')^2)');
                             break;
                         case ACOT:
-                            symbol = _.parse('-1/((' + symbol.args[0] + ')^2+1)');
+                            symbol = _.parse('-1/((' + symbol.args[0] + "");
                             break;
                         case 'S':

[NoCoverage] ConditionalExpression
Calculus.js:624:25
                         case ACOT:
                             symbol = _.parse('-1/((' + symbol.args[0] + ')^2+1)');
                             break;
-                        case 'S':
-                            var arg = String(symbol.args[0]);
-                            symbol = _.parse('sin((pi*(' + arg + ')^2)/2)');
-                            break;
+                        case 'S':
                         case 'C':
                             var arg = String(symbol.args[0]);

[NoCoverage] StringLiteral
Calculus.js:626:66
                             break;
                         case 'S':
                             var arg = String(symbol.args[0]);
-                            symbol = _.parse('sin((pi*(' + arg + ')^2)/2)');
+                            symbol = _.parse('sin((pi*(' + arg + "");
                             break;
                         case 'C':

[NoCoverage] ConditionalExpression
Calculus.js:628:25
                             var arg = String(symbol.args[0]);
                             symbol = _.parse('sin((pi*(' + arg + ')^2)/2)');
                             break;
-                        case 'C':
-                            var arg = String(symbol.args[0]);
-                            symbol = _.parse('cos((pi*(' + arg + ')^2)/2)');
-                            break;
+                        case 'C':
                         case 'Si':
                             var arg = symbol.args[0];

[NoCoverage] ConditionalExpression
Calculus.js:632:25
                             var arg = String(symbol.args[0]);
                             symbol = _.parse('cos((pi*(' + arg + ')^2)/2)');
                             break;
-                        case 'Si':
-                            var arg = symbol.args[0];
-                            symbol = _.parse('sin(' + arg + ')/(' + arg + ')');
-                            break;
+                        case 'Si':
                         case 'Shi':
                             var arg = symbol.args[0];

[NoCoverage] StringLiteral
Calculus.js:634:75
                             break;
                         case 'Si':
                             var arg = symbol.args[0];
-                            symbol = _.parse('sin(' + arg + ')/(' + arg + ')');
+                            symbol = _.parse('sin(' + arg + ')/(' + arg + "");
                             break;
                         case 'Shi':

[NoCoverage] ConditionalExpression
Calculus.js:636:25
                             var arg = symbol.args[0];
                             symbol = _.parse('sin(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Shi':
-                            var arg = symbol.args[0];
-                            symbol = _.parse('sinh(' + arg + ')/(' + arg + ')');
-                            break;
+                        case 'Shi':
                         case 'Ci':
                             var arg = symbol.args[0];

[NoCoverage] StringLiteral
Calculus.js:638:76
                             break;
                         case 'Shi':
                             var arg = symbol.args[0];
-                            symbol = _.parse('sinh(' + arg + ')/(' + arg + ')');
+                            symbol = _.parse('sinh(' + arg + ')/(' + arg + "");
                             break;
                         case 'Ci':

[NoCoverage] ConditionalExpression
Calculus.js:640:25
                             var arg = symbol.args[0];
                             symbol = _.parse('sinh(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Ci':
-                            var arg = symbol.args[0];
-                            symbol = _.parse('cos(' + arg + ')/(' + arg + ')');
-                            break;
+                        case 'Ci':
                         case 'Chi':
                             var arg = symbol.args[0];

[Survived] StringLiteral
Calculus.js:640:30
                             var arg = symbol.args[0];
                             symbol = _.parse('sinh(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Ci':
+                        case "":
                             var arg = symbol.args[0];
                             symbol = _.parse('cos(' + arg + ')/(' + arg + ')');

[NoCoverage] StringLiteral
Calculus.js:642:75
                             break;
                         case 'Ci':
                             var arg = symbol.args[0];
-                            symbol = _.parse('cos(' + arg + ')/(' + arg + ')');
+                            symbol = _.parse('cos(' + arg + ')/(' + arg + "");
                             break;
                         case 'Chi':

[NoCoverage] ConditionalExpression
Calculus.js:644:25
                             var arg = symbol.args[0];
                             symbol = _.parse('cos(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Chi':
-                            var arg = symbol.args[0];
-                            symbol = _.parse('cosh(' + arg + ')/(' + arg + ')');
-                            break;
+                        case 'Chi':
                         case 'Ei':
                             var arg = symbol.args[0];

[Survived] StringLiteral
Calculus.js:644:30
                             var arg = symbol.args[0];
                             symbol = _.parse('cos(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Chi':
+                        case "":
                             var arg = symbol.args[0];
                             symbol = _.parse('cosh(' + arg + ')/(' + arg + ')');

[NoCoverage] StringLiteral
Calculus.js:646:76
                             break;
                         case 'Chi':
                             var arg = symbol.args[0];
-                            symbol = _.parse('cosh(' + arg + ')/(' + arg + ')');
+                            symbol = _.parse('cosh(' + arg + ')/(' + arg + "");
                             break;
                         case 'Ei':

[NoCoverage] ConditionalExpression
Calculus.js:648:25
                             var arg = symbol.args[0];
                             symbol = _.parse('cosh(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Ei':
-                            var arg = symbol.args[0];
-                            symbol = _.parse('e^(' + arg + ')/(' + arg + ')');
-                            break;
+                        case 'Ei':
                         case 'Li':
                             var arg = symbol.args[0];

[NoCoverage] StringLiteral
Calculus.js:650:46
                             break;
                         case 'Ei':
                             var arg = symbol.args[0];
-                            symbol = _.parse('e^(' + arg + ')/(' + arg + ')');
+                            symbol = _.parse("" + arg + ')/(' + arg + ')');
                             break;
                         case 'Li':

[NoCoverage] StringLiteral
Calculus.js:650:74
                             break;
                         case 'Ei':
                             var arg = symbol.args[0];
-                            symbol = _.parse('e^(' + arg + ')/(' + arg + ')');
+                            symbol = _.parse('e^(' + arg + ')/(' + arg + "");
                             break;
                         case 'Li':

[NoCoverage] ConditionalExpression
Calculus.js:652:25
                             var arg = symbol.args[0];
                             symbol = _.parse('e^(' + arg + ')/(' + arg + ')');
                             break;
-                        case 'Li':
-                            var arg = symbol.args[0];
-                            symbol = _.parse('1/' + Settings.LOG + '(' + arg + ')');
-                            break;
+                        case 'Li':
                         case 'erf':
                             symbol = _.parse('(2*e^(-(' + symbol.args[0] + ')^2))/sqrt(pi)');

[NoCoverage] StringLiteral
Calculus.js:654:80
                             break;
                         case 'Li':
                             var arg = symbol.args[0];
-                            symbol = _.parse('1/' + Settings.LOG + '(' + arg + ')');
+                            symbol = _.parse('1/' + Settings.LOG + '(' + arg + "");
                             break;
                         case 'erf':

[NoCoverage] ConditionalExpression
Calculus.js:656:25
                             var arg = symbol.args[0];
                             symbol = _.parse('1/' + Settings.LOG + '(' + arg + ')');
                             break;
-                        case 'erf':
-                            symbol = _.parse('(2*e^(-(' + symbol.args[0] + ')^2))/sqrt(pi)');
-                            break;
+                        case 'erf':
                         case 'atan2':
                             var x_ = String(symbol.args[0]),

[Survived] StringLiteral
Calculus.js:656:30
                             var arg = symbol.args[0];
                             symbol = _.parse('1/' + Settings.LOG + '(' + arg + ')');
                             break;
-                        case 'erf':
+                        case "":
                             symbol = _.parse('(2*e^(-(' + symbol.args[0] + ')^2))/sqrt(pi)');
                             break;

[NoCoverage] ConditionalExpression
Calculus.js:659:25
                         case 'erf':
                             symbol = _.parse('(2*e^(-(' + symbol.args[0] + ')^2))/sqrt(pi)');
                             break;
-                        case 'atan2':
-                            var x_ = String(symbol.args[0]),
-                                    y_ = String(symbol.args[1]);
-                            symbol = _.parse('(' + y_ + ')/((' + y_ + ')^2+(' + x_ + ')^2)');
-                            break;
+                        case 'atan2':
                         case 'sign':
                             symbol = new Symbol(0);

[NoCoverage] StringLiteral
Calculus.js:662:46
                         case 'atan2':
                             var x_ = String(symbol.args[0]),
                                     y_ = String(symbol.args[1]);
-                            symbol = _.parse('(' + y_ + ')/((' + y_ + ')^2+(' + x_ + ')^2)');
+                            symbol = _.parse("" + y_ + ')/((' + y_ + ')^2+(' + x_ + ')^2)');
                             break;
                         case 'sign':

[NoCoverage] ConditionalExpression
Calculus.js:664:25
                                     y_ = String(symbol.args[1]);
                             symbol = _.parse('(' + y_ + ')/((' + y_ + ')^2+(' + x_ + ')^2)');
                             break;
-                        case 'sign':
-                            symbol = new Symbol(0);
-                            break;
+                        case 'sign':
                         case 'sinc':
                             symbol = _.parse(format('(({0})*cos({0})-sin({0}))*({0})^(-2)', symbol.args[0]));

[Killed] ConditionalExpression
Calculus.js:667:25
                         case 'sign':
                             symbol = new Symbol(0);
                             break;
-                        case 'sinc':
-                            symbol = _.parse(format('(({0})*cos({0})-sin({0}))*({0})^(-2)', symbol.args[0]));
-                            break;
+                        case 'sinc':
                         case Settings.LOG10:
                             symbol = _.parse('1/((' + symbol.args[0] + ')*' + Settings.LOG + '(10))');
killedBy: calculus should differentiate correctly
statusReason: Expected '3*(a*x^3+b)^(-1)*a*x^2*log(10)^(-1)' to equal '3*((a*x^3+b)*cos(a*x^3+b)-sin(a*x^3+b))*(a*x^3+b)^(-2)*a*x^2'.
