[Killed] BlockStatement
Solve.js:814:46
          * @param {Symbol} a_o
          * @returns {Array}
          */
-        cubic: function (d_o, c_o, b_o, a_o) {
-            //convert everything to text
-            var a = a_o.text(), b = b_o.text(), c = c_o.text(), d = d_o.text();
-
-            var t = `(-(${b})^3/(27*(${a})^3)+(${b})*(${c})/(6*(${a})^2)-(${d})/(2*(${a})))`;
-            var u = `((${c})/(3*(${a}))-(${b})^2/(9*(${a})^2))`;
-            var v = `(${b})/(3*(${a}))`;
-            var x = `((${t})+sqrt((${t})^2+(${u})^3))^(1/3)+((${t})-sqrt((${t})^2+(${u})^3))^(1/3)-(${v})`;
-
-            // Convert a to one
-            var w = '1/2+sqrt(3)/2*i'; // Cube root of unity
-
-            return [
-                _.parse(x),
-                _.parse(`(${x})(${w})`),
-                _.parse(`(${x})(${w})^2`)
-            ];
-        },
+        cubic: function (d_o, c_o, b_o, a_o) {},
         /**
          * The quartic equation
killedBy: Solve should solve correctly

[Killed] StringLiteral
Solve.js:819:21
             var a = a_o.text(), b = b_o.text(), c = c_o.text(), d = d_o.text();
 
             var t = `(-(${b})^3/(27*(${a})^3)+(${b})*(${c})/(6*(${a})^2)-(${d})/(2*(${a})))`;
-            var u = `((${c})/(3*(${a}))-(${b})^2/(9*(${a})^2))`;
+            var u = ``;
             var v = `(${b})/(3*(${a}))`;
             var x = `((${t})+sqrt((${t})^2+(${u})^3))^(1/3)+((${t})-sqrt((${t})^2+(${u})^3))^(1/3)-(${v})`;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] StringLiteral
Solve.js:821:21
             var t = `(-(${b})^3/(27*(${a})^3)+(${b})*(${c})/(6*(${a})^2)-(${d})/(2*(${a})))`;
             var u = `((${c})/(3*(${a}))-(${b})^2/(9*(${a})^2))`;
             var v = `(${b})/(3*(${a}))`;
-            var x = `((${t})+sqrt((${t})^2+(${u})^3))^(1/3)+((${t})-sqrt((${t})^2+(${u})^3))^(1/3)-(${v})`;
+            var x = ``;
 
             // Convert a to one
killedBy: Solve should solve correctly

[Killed] StringLiteral
Solve.js:824:21
             var x = `((${t})+sqrt((${t})^2+(${u})^3))^(1/3)+((${t})-sqrt((${t})^2+(${u})^3))^(1/3)-(${v})`;
 
             // Convert a to one
-            var w = '1/2+sqrt(3)/2*i'; // Cube root of unity
+            var w = ""; // Cube root of unity
 
             return [
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] StringLiteral
Solve.js:829:25
             return [
                 _.parse(x),
                 _.parse(`(${x})(${w})`),
-                _.parse(`(${x})(${w})^2`)
+                _.parse(``)
             ];
         },
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] BlockStatement
Solve.js:845:39
             var scope = {};
             core.Utils.arrayUnique(variables(a).concat(variables(b))
                     .concat(variables(c)).concat(variables(d)).concat(variables(e)))
-                    .map(function (x) {
-                        scope[x] = 1;
-                    });
+                    .map(function (x) {});
             a = a.toString();
             b = b.toString();

[NoCoverage] StringLiteral
Solve.js:861:32
              a, b, c, d, e), scope);
              });*/
 
-            p = _.parse(format("(8*({0})*({2})-3*({1})^2)/(8*({0})^2)", a, b, c)).toString(); //a, b, c
+            p = _.parse(format("", a, b, c)).toString(); //a, b, c
             q = _.parse(format("(({1})^3-4*({0})*({1})*({2})+8*({0})^2*({3}))/(8*({0})^3)", a, b, c, d)).toString();//a, b, c, d, e
             D0 = _.parse(format("12*({0})*({4})-3*({1})*({3})+({2})^2", a, b, c, d, e)).toString(); //a, b, c, d, e

[NoCoverage] StringLiteral
Solve.js:864:33
             p = _.parse(format("(8*({0})*({2})-3*({1})^2)/(8*({0})^2)", a, b, c)).toString(); //a, b, c
             q = _.parse(format("(({1})^3-4*({0})*({1})*({2})+8*({0})^2*({3}))/(8*({0})^3)", a, b, c, d)).toString();//a, b, c, d, e
             D0 = _.parse(format("12*({0})*({4})-3*({1})*({3})+({2})^2", a, b, c, d, e)).toString(); //a, b, c, d, e
-            D1 = _.parse(format("2*({2})^3-9*({1})*({2})*({3})+27*({1})^2*({4})+27*({0})*({3})^2-72*({0})*({2})*({4})", a, b, c, d, e)).toString(); //a, b, c, d, e
+            D1 = _.parse(format("", a, b, c, d, e)).toString(); //a, b, c, d, e
             Q = _.parse(format("((({1})+(({1})^2-4*({0})^3)^(1/2))/2)^(1/3)", D0, D1)).toString(); //D0, D1
             S = _.parse(format("(1/2)*(-(2/3)*({1})+(1/(3*({0}))*(({2})+(({3})/({2})))))^(1/2)", a, p, Q, D0)).toString(); //a, p, Q, D0

[NoCoverage] StringLiteral
Solve.js:867:33
             D1 = _.parse(format("2*({2})^3-9*({1})*({2})*({3})+27*({1})^2*({4})+27*({0})*({3})^2-72*({0})*({2})*({4})", a, b, c, d, e)).toString(); //a, b, c, d, e
             Q = _.parse(format("((({1})+(({1})^2-4*({0})^3)^(1/2))/2)^(1/3)", D0, D1)).toString(); //D0, D1
             S = _.parse(format("(1/2)*(-(2/3)*({1})+(1/(3*({0}))*(({2})+(({3})/({2})))))^(1/2)", a, p, Q, D0)).toString(); //a, p, Q, D0
-            x1 = _.parse(format("-(({1})/(4*({0})))-({4})+(1/2)*sqrt(-4*({4})^2-2*({2})+(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
+            x1 = _.parse(format("", a, b, p, q, S)); //a, b, p, q, S
             x2 = _.parse(format("-(({1})/(4*({0})))-({4})-(1/2)*sqrt(-4*({4})^2-2*({2})+(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
             x3 = _.parse(format("-(({1})/(4*({0})))+({4})+(1/2)*sqrt(-4*({4})^2-2*({2})-(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S

[NoCoverage] StringLiteral
Solve.js:869:33
             S = _.parse(format("(1/2)*(-(2/3)*({1})+(1/(3*({0}))*(({2})+(({3})/({2})))))^(1/2)", a, p, Q, D0)).toString(); //a, p, Q, D0
             x1 = _.parse(format("-(({1})/(4*({0})))-({4})+(1/2)*sqrt(-4*({4})^2-2*({2})+(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
             x2 = _.parse(format("-(({1})/(4*({0})))-({4})-(1/2)*sqrt(-4*({4})^2-2*({2})+(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
-            x3 = _.parse(format("-(({1})/(4*({0})))+({4})+(1/2)*sqrt(-4*({4})^2-2*({2})-(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
+            x3 = _.parse(format("", a, b, p, q, S)); //a, b, p, q, S
             x4 = _.parse(format("-(({1})/(4*({0})))+({4})-(1/2)*sqrt(-4*({4})^2-2*({2})-(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
             return [x1, x2, x3, x4];

[NoCoverage] ArrayDeclaration
Solve.js:871:20
             x2 = _.parse(format("-(({1})/(4*({0})))-({4})-(1/2)*sqrt(-4*({4})^2-2*({2})+(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
             x3 = _.parse(format("-(({1})/(4*({0})))+({4})+(1/2)*sqrt(-4*({4})^2-2*({2})-(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
             x4 = _.parse(format("-(({1})/(4*({0})))+({4})-(1/2)*sqrt(-4*({4})^2-2*({2})-(({3})/({4})))", a, b, p, q, S)); //a, b, p, q, S
-            return [x1, x2, x3, x4];
+            return [];
         },
         /**

[NoCoverage] BlockStatement
Solve.js:879:56
          * @param {String} solve_for
          * @returns {Array}
          */
-        divideAndConquer: function (symbol, solve_for) {
-            var sols = [];
-            //see if we can solve the factors
-            var factors = core.Algebra.Factor.factor(symbol);
-            if(factors.group === CB) {
-                factors.each(function (x) {
-                    x = Symbol.unwrapPARENS(x);
-                    sols = sols.concat(solve(x, solve_for));
-                });
-            }
-            return sols;
-        },
+        divideAndConquer: function (symbol, solve_for) {},
         /**
          * Attempts to solve the equation assuming it's a polynomial with numeric coefficients

[NoCoverage] ConditionalExpression
Solve.js:883:16
             var sols = [];
             //see if we can solve the factors
             var factors = core.Algebra.Factor.factor(symbol);
-            if(factors.group === CB) {
+            if(false) {
                 factors.each(function (x) {
                     x = Symbol.unwrapPARENS(x);

[NoCoverage] ConditionalExpression
Solve.js:883:16
             var sols = [];
             //see if we can solve the factors
             var factors = core.Algebra.Factor.factor(symbol);
-            if(factors.group === CB) {
+            if(true) {
                 factors.each(function (x) {
                     x = Symbol.unwrapPARENS(x);

[NoCoverage] BlockStatement
Solve.js:884:43
             //see if we can solve the factors
             var factors = core.Algebra.Factor.factor(symbol);
             if(factors.group === CB) {
-                factors.each(function (x) {
-                    x = Symbol.unwrapPARENS(x);
-                    sols = sols.concat(solve(x, solve_for));
-                });
+                factors.each(function (x) {});
             }
             return sols;

[Killed] BlockStatement
Solve.js:897:42
          * @param {String} solve_for
          * @returns {Array}
          */
-        csolve: function (eq, solve_for) {
-            return core.Utils.block('IGNORE_E', function () {
-                var f, p, pn, n, pf, r, theta, sr, sp, roots;
-                roots = [];
-                f = core.Utils.decompose_fn(eq, solve_for, true);
-                if(f.x.group === S) {
-                    p = _.parse(f.x.power);
-                    pn = Number(p);
-                    n = _.pow(_.divide(f.b.negate(), f.a), p.invert());
-                    pf = Symbol.toPolarFormArray(n);
-                    r = pf[0];
-                    theta = pf[1];
-                    sr = r.toString();
-                    sp = p.toString();
-                    var k, root, str;
-                    for(var i = 0; i < pn; i++) {
-                        k = i;
-                        str = format('({0})*e^(2*{1}*pi*{2}*{3})', sr, k, p, core.Settings.IMAGINARY);
-                        root = _.parse(str);
-                        roots.push(root);
-                    }
-                }
-                return roots;
-            }, true);
-        },
+        csolve: function (eq, solve_for) {},
         /**
          * Generates starting points for the Newton solver given an expression at zero.
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:898:61
          * @returns {Array}
          */
         csolve: function (eq, solve_for) {
-            return core.Utils.block('IGNORE_E', function () {
-                var f, p, pn, n, pf, r, theta, sr, sp, roots;
-                roots = [];
-                f = core.Utils.decompose_fn(eq, solve_for, true);
-                if(f.x.group === S) {
-                    p = _.parse(f.x.power);
-                    pn = Number(p);
-                    n = _.pow(_.divide(f.b.negate(), f.a), p.invert());
-                    pf = Symbol.toPolarFormArray(n);
-                    r = pf[0];
-                    theta = pf[1];
-                    sr = r.toString();
-                    sp = p.toString();
-                    var k, root, str;
-                    for(var i = 0; i < pn; i++) {
-                        k = i;
-                        str = format('({0})*e^(2*{1}*pi*{2}*{3})', sr, k, p, core.Settings.IMAGINARY);
-                        root = _.parse(str);
-                        roots.push(root);
-                    }
-                }
-                return roots;
-            }, true);
+            return core.Utils.block('IGNORE_E', function () {}, true);
         },
         /**
killedBy: Solve should solve correctly

[Killed] BooleanLiteral
Solve.js:901:60
             return core.Utils.block('IGNORE_E', function () {
                 var f, p, pn, n, pf, r, theta, sr, sp, roots;
                 roots = [];
-                f = core.Utils.decompose_fn(eq, solve_for, true);
+                f = core.Utils.decompose_fn(eq, solve_for, false);
                 if(f.x.group === S) {
                     p = _.parse(f.x.power);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:902:20
                 var f, p, pn, n, pf, r, theta, sr, sp, roots;
                 roots = [];
                 f = core.Utils.decompose_fn(eq, solve_for, true);
-                if(f.x.group === S) {
+                if(false) {
                     p = _.parse(f.x.power);
                     pn = Number(p);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:902:20
                 var f, p, pn, n, pf, r, theta, sr, sp, roots;
                 roots = [];
                 f = core.Utils.decompose_fn(eq, solve_for, true);
-                if(f.x.group === S) {
+                if(true) {
                     p = _.parse(f.x.power);
                     pn = Number(p);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:912:49
                     sr = r.toString();
                     sp = p.toString();
                     var k, root, str;
-                    for(var i = 0; i < pn; i++) {
-                        k = i;
-                        str = format('({0})*e^(2*{1}*pi*{2}*{3})', sr, k, p, core.Settings.IMAGINARY);
-                        root = _.parse(str);
-                        roots.push(root);
-                    }
+                    for(var i = 0; i < pn; i++) {}
                 }
                 return roots;
killedBy: Solve should solve correctly

[Killed] ConditionalExpression
Solve.js:912:36
                     sr = r.toString();
                     sp = p.toString();
                     var k, root, str;
-                    for(var i = 0; i < pn; i++) {
+                    for(var i = 0; false; i++) {
                         k = i;
                         str = format('({0})*e^(2*{1}*pi*{2}*{3})', sr, k, p, core.Settings.IMAGINARY);
killedBy: Solve should solve correctly

[Killed] StringLiteral
Solve.js:914:38
                     var k, root, str;
                     for(var i = 0; i < pn; i++) {
                         k = i;
-                        str = format('({0})*e^(2*{1}*pi*{2}*{3})', sr, k, p, core.Settings.IMAGINARY);
+                        str = format("", sr, k, p, core.Settings.IMAGINARY);
                         root = _.parse(str);
                         roots.push(root);
killedBy: Solve should solve correctly

[Killed] BooleanLiteral
Solve.js:920:16
                     }
                 }
                 return roots;
-            }, true);
+            }, false);
         },
         /**
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:933:20
          * @returns {Array}
          */
         getPoints: function (symbol, step, points) {
-            step = step || 0.01;
+            step = true;
             points = points || [];
             var f = build(symbol);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:933:20
          * @returns {Array}
          */
         getPoints: function (symbol, step, points) {
-            step = step || 0.01;
+            step = false;
             points = points || [];
             var f = build(symbol);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:934:22
          */
         getPoints: function (symbol, step, points) {
             step = step || 0.01;
-            points = points || [];
+            points = false;
             var f = build(symbol);
             var x0 = 0;
killedBy: Solve should solve correctly
statusReason: Expected '[0,((214426147/209695794)*i+46234760/284516909)^2,((-214426147/209695794)*i+46234760/284516909)^2]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:934:22
          */
         getPoints: function (symbol, step, points) {
             step = step || 0.01;
-            points = points || [];
+            points = true;
             var f = build(symbol);
             var x0 = 0;
killedBy: Solve should solve correctly
statusReason: Expected '[0,((214426147/209695794)*i+46234760/284516909)^2,((-214426147/209695794)*i+46234760/284516909)^2]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:940:33
 
             var start = Math.round(x0),
                     last = f(start),
-                    last_sign = last / Math.abs(last),
+                    last_sign = last * Math.abs(last),
                     rside = core.Settings.ROOTS_PER_SIDE, // the max number of roots on right side
                     lside = rside; // the max number of roots on left side
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:944:36
                     rside = core.Settings.ROOTS_PER_SIDE, // the max number of roots on right side
                     lside = rside; // the max number of roots on left side
             // check around the starting point
-            points.push(Math.floor(start / 2)); //half way from zero might be a good start
+            points.push(Math.floor(start * 2)); //half way from zero might be a good start
             points.push(Math.abs(start)); //|f(0)| could be a good start
             points.push(start);//|f(0)| could be a good start
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:948:38
             points.push(Math.abs(start)); //|f(0)| could be a good start
             points.push(start);//|f(0)| could be a good start
             //adjust for log. A good starting point to include for log is 0.1
-            symbol.each(function (x) {
-                if(x.containsFunction(core.Settings.LOG))
-                    points.push(0.1);
-            });
+            symbol.each(function (x) {});
 
             var left = range(-core.Settings.SOLVE_RADIUS, start, step),
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:949:20
             points.push(start);//|f(0)| could be a good start
             //adjust for log. A good starting point to include for log is 0.1
             symbol.each(function (x) {
-                if(x.containsFunction(core.Settings.LOG))
+                if(true)
                     points.push(0.1);
             });
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:949:20
             points.push(start);//|f(0)| could be a good start
             //adjust for log. A good starting point to include for log is 0.1
             symbol.each(function (x) {
-                if(x.containsFunction(core.Settings.LOG))
+                if(false)
                     points.push(0.1);
             });
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] UnaryOperator
Solve.js:953:30
                     points.push(0.1);
             });
 
-            var left = range(-core.Settings.SOLVE_RADIUS, start, step),
+            var left = range(+core.Settings.SOLVE_RADIUS, start, step),
                     right = range(start, core.Settings.SOLVE_RADIUS, step);
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:956:56
             var left = range(-core.Settings.SOLVE_RADIUS, start, step),
                     right = range(start, core.Settings.SOLVE_RADIUS, step);
 
-            var test_side = function (side, num_roots) {
-                var xi, val, sign;
-                var hits = [];
-                for(var i = 0, l = side.length; i < l; i++) {
-                    xi = side[i]; //the point being evaluated
-                    val = f(xi);
-                    sign = val / Math.abs(val);
-                    //Don't add non-numeric values
-                    if(isNaN(val) || !isFinite(val) || hits.length > num_roots) {
-                        continue;
-                    }
-
-                    //compare the signs. The have to be different if they cross a zero
-                    if(sign !== last_sign) {
-                        hits.push(xi); //take note of the possible zero location
-                    }
-                    last_sign = sign;
-                }
-
-                points = points.concat(hits);
-            };
+            var test_side = function (side, num_roots) {};
 
             test_side(left, lside);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:959:61
             var test_side = function (side, num_roots) {
                 var xi, val, sign;
                 var hits = [];
-                for(var i = 0, l = side.length; i < l; i++) {
-                    xi = side[i]; //the point being evaluated
-                    val = f(xi);
-                    sign = val / Math.abs(val);
-                    //Don't add non-numeric values
-                    if(isNaN(val) || !isFinite(val) || hits.length > num_roots) {
-                        continue;
-                    }
-
-                    //compare the signs. The have to be different if they cross a zero
-                    if(sign !== last_sign) {
-                        hits.push(xi); //take note of the possible zero location
-                    }
-                    last_sign = sign;
-                }
+                for(var i = 0, l = side.length; i < l; i++) {}
 
                 points = points.concat(hits);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:959:49
             var test_side = function (side, num_roots) {
                 var xi, val, sign;
                 var hits = [];
-                for(var i = 0, l = side.length; i < l; i++) {
+                for(var i = 0, l = side.length; false; i++) {
                     xi = side[i]; //the point being evaluated
                     val = f(xi);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:962:28
                 for(var i = 0, l = side.length; i < l; i++) {
                     xi = side[i]; //the point being evaluated
                     val = f(xi);
-                    sign = val / Math.abs(val);
+                    sign = val * Math.abs(val);
                     //Don't add non-numeric values
                     if(isNaN(val) || !isFinite(val) || hits.length > num_roots) {
killedBy: Solve should solve correctly
statusReason: Expected '[0,78202389238903801/240831735646702201,1734807050530225/5342504200414096,81338951853721/250491080148100]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:964:24
                     val = f(xi);
                     sign = val / Math.abs(val);
                     //Don't add non-numeric values
-                    if(isNaN(val) || !isFinite(val) || hits.length > num_roots) {
+                    if(true) {
                         continue;
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:964:81
                     val = f(xi);
                     sign = val / Math.abs(val);
                     //Don't add non-numeric values
-                    if(isNaN(val) || !isFinite(val) || hits.length > num_roots) {
-                        continue;
-                    }
+                    if(isNaN(val) || !isFinite(val) || hits.length > num_roots) {}
 
                     //compare the signs. The have to be different if they cross a zero
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:969:44
                     }
 
                     //compare the signs. The have to be different if they cross a zero
-                    if(sign !== last_sign) {
-                        hits.push(xi); //take note of the possible zero location
-                    }
+                    if(sign !== last_sign) {}
                     last_sign = sign;
                 }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:969:24
                     }
 
                     //compare the signs. The have to be different if they cross a zero
-                    if(sign !== last_sign) {
+                    if(true) {
                         hits.push(xi); //take note of the possible zero location
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:990:24
          * @returns {undefined | number}
          */
         bisection: function (point, f) {
-            var left = point - 1;
+            var left = point + 1;
             var right = point + 1;
             // First test if this point is even worth evaluating. It should
killedBy: Solve should solve correctly
statusReason: Expected '[7,7881299347898374/1125899906842625]' to equal '[7]'.

[Killed] ArithmeticOperator
Solve.js:991:25
          */
         bisection: function (point, f) {
             var left = point - 1;
-            var right = point + 1;
+            var right = point - 1;
             // First test if this point is even worth evaluating. It should
             // be crossing the x axis so the signs should be different
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:994:16
             var right = point + 1;
             // First test if this point is even worth evaluating. It should
             // be crossing the x axis so the signs should be different
-            if(Math.sign(f(left)) !== Math.sign(f(right))) {
+            if(false) {
                 var safety = 0;
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.
