[Killed] StringLiteral
Calculus.js:667:30
                         case 'sign':
                             symbol = new Symbol(0);
                             break;
-                        case 'sinc':
+                        case "":
                             symbol = _.parse(format('(({0})*cos({0})-sin({0}))*({0})^(-2)', symbol.args[0]));
                             break;
killedBy: calculus should differentiate correctly
statusReason: Expected '3*a*diff(sinc(a*x^3+b),x)*x^2' to equal '3*((a*x^3+b)*cos(a*x^3+b)-sin(a*x^3+b))*(a*x^3+b)^(-2)*a*x^2'.

[NoCoverage] ConditionalExpression
Calculus.js:670:25
                         case 'sinc':
                             symbol = _.parse(format('(({0})*cos({0})-sin({0}))*({0})^(-2)', symbol.args[0]));
                             break;
-                        case Settings.LOG10:
-                            symbol = _.parse('1/((' + symbol.args[0] + ')*' + Settings.LOG + '(10))');
-                            break;
+                        case Settings.LOG10:
                         default:
                             symbol = _.symfunction('diff', [symbol, wrt]);

[Killed] ConditionalExpression
Calculus.js:673:25
                         case Settings.LOG10:
                             symbol = _.parse('1/((' + symbol.args[0] + ')*' + Settings.LOG + '(10))');
                             break;
-                        default:
-                            symbol = _.symfunction('diff', [symbol, wrt]);
+                        default:
                     }
                 }
killedBy: Solve should solve nonlinear system of equations with multiple parameter functions
statusReason: Expected '' to equal 'j,2935.601831019821,x,1334.3644686453729,y,2668.7289372907458,z,2935.601831019821'.

[Killed] ArrayDeclaration
Calculus.js:674:60
                             symbol = _.parse('1/((' + symbol.args[0] + ')*' + Settings.LOG + '(10))');
                             break;
                         default:
-                            symbol = _.symfunction('diff', [symbol, wrt]);
+                            symbol = _.symfunction('diff', []);
                     }
                 }
killedBy: Solve should solve nonlinear system of equations with multiple parameter functions
statusReason: Expected 'j,1673.22384325,x,418.5559608125,y,837.111921625,z,1674.22384325' to equal 'j,2935.601831019821,x,1334.3644686453729,y,2668.7289372907458,z,2935.601831019821'.

[Killed] ConditionalExpression
Calculus.js:677:25
                             symbol = _.symfunction('diff', [symbol, wrt]);
                     }
                 }
-                else if(g === EX || g === FN && isSymbol(symbol.power)) {
+                else if(true) {
                     var value;
                     if(g === EX) {
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] LogicalOperator
Calculus.js:677:37
                             symbol = _.symfunction('diff', [symbol, wrt]);
                     }
                 }
-                else if(g === EX || g === FN && isSymbol(symbol.power)) {
+                else if(g === EX || g === FN || isSymbol(symbol.power)) {
                     var value;
                     if(g === EX) {
killedBy: Algebra should factor correctly
statusReason: Expected '(-sqrt(x^2)+sqrt(y^2))*(sqrt(x^2)+sqrt(y^2))' to equal '(-y+x)*(x+y)'.

[Killed] ConditionalExpression
Calculus.js:679:24
                 }
                 else if(g === EX || g === FN && isSymbol(symbol.power)) {
                     var value;
-                    if(g === EX) {
+                    if(false) {
                         value = symbol.value;
                     }
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(cos(x)^(-1)*sec(x)^2+cos(x)^(-2)*sin(x)*tan(x))' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[Killed] BlockStatement
Calculus.js:679:34
                 }
                 else if(g === EX || g === FN && isSymbol(symbol.power)) {
                     var value;
-                    if(g === EX) {
-                        value = symbol.value;
-                    }
+                    if(g === EX) {}
                     else if(g === FN && symbol.contains(d)) {
                         value = symbol.fname + inBrackets(text(symbol.args[0]));
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(cos(x)^(-1)*sec(x)^2+cos(x)^(-2)*sin(x)*tan(x))' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[NoCoverage] ConditionalExpression
Calculus.js:682:29
                     if(g === EX) {
                         value = symbol.value;
                     }
-                    else if(g === FN && symbol.contains(d)) {
+                    else if(false) {
                         value = symbol.fname + inBrackets(text(symbol.args[0]));
                     }

[NoCoverage] ConditionalExpression
Calculus.js:682:29
                     if(g === EX) {
                         value = symbol.value;
                     }
-                    else if(g === FN && symbol.contains(d)) {
+                    else if(true) {
                         value = symbol.fname + inBrackets(text(symbol.args[0]));
                     }

[NoCoverage] ArithmeticOperator
Calculus.js:683:33
                         value = symbol.value;
                     }
                     else if(g === FN && symbol.contains(d)) {
-                        value = symbol.fname + inBrackets(text(symbol.args[0]));
+                        value = symbol.fname - inBrackets(text(symbol.args[0]));
                     }
                     else {

[NoCoverage] BlockStatement
Calculus.js:685:26
                     else if(g === FN && symbol.contains(d)) {
                         value = symbol.fname + inBrackets(text(symbol.args[0]));
                     }
-                    else {
-                        value = symbol.value + inBrackets(text(symbol.args[0]));
-                    }
+                    else {}
                     a = _.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone());
                     b = __.diff(_.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone()), d);

[NoCoverage] ArithmeticOperator
Calculus.js:686:33
                         value = symbol.fname + inBrackets(text(symbol.args[0]));
                     }
                     else {
-                        value = symbol.value + inBrackets(text(symbol.args[0]));
+                        value = symbol.value - inBrackets(text(symbol.args[0]));
                     }
                     a = _.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone());

[Killed] ArithmeticOperator
Calculus.js:688:44
                     else {
                         value = symbol.value + inBrackets(text(symbol.args[0]));
                     }
-                    a = _.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone());
+                    a = _.multiply(_.parse(LOG - inBrackets(value)), symbol.power.clone());
                     b = __.diff(_.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone()), d);
                     symbol = _.multiply(symbol, b);
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(cos(x)^(-1)*sec(x)^2+cos(x)^(-2)*sin(x)*tan(x))' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[Killed] ArithmeticOperator
Calculus.js:689:52
                         value = symbol.value + inBrackets(text(symbol.args[0]));
                     }
                     a = _.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone());
-                    b = __.diff(_.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone()), d);
+                    b = __.diff(_.multiply(_.parse(LOG - inBrackets(value)), symbol.power.clone()), d);
                     symbol = _.multiply(symbol, b);
                 }
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(cos(x)^(-1)*sec(x)^2+cos(x)^(-2)*sin(x)*tan(x))' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[Killed] BooleanLiteral
Calculus.js:692:37
                     b = __.diff(_.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone()), d);
                     symbol = _.multiply(symbol, b);
                 }
-                else if(g === FN && !symbol.power.equals(1)) {
+                else if(g === FN && symbol.power.equals(1)) {
                     b = symbol.clone();
                     b.toLinear();
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] BlockStatement
Calculus.js:692:62
                     b = __.diff(_.multiply(_.parse(LOG + inBrackets(value)), symbol.power.clone()), d);
                     symbol = _.multiply(symbol, b);
                 }
-                else if(g === FN && !symbol.power.equals(1)) {
-                    b = symbol.clone();
-                    b.toLinear();
-                    b.toUnitMultiplier();
-                    symbol = _.multiply(polydiff(symbol.clone()), derive(b));
-                }
+                else if(g === FN && !symbol.power.equals(1)) {}
                 else if(g === CP || g === PL) {
                     // Note: Do not use `parse` since this puts back the sqrt and causes a bug as in #610. Use clone.
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] BlockStatement
Calculus.js:698:47
                     b.toUnitMultiplier();
                     symbol = _.multiply(polydiff(symbol.clone()), derive(b));
                 }
-                else if(g === CP || g === PL) {
-                    // Note: Do not use `parse` since this puts back the sqrt and causes a bug as in #610. Use clone.
-                    var c = symbol.clone();
-                    var result = new Symbol(0);
-                    for(var x in symbol.symbols) {
-                        result = _.add(result, __.diff(symbol.symbols[x].clone(), d));
-                    }
-                    symbol = _.multiply(polydiff(c), result);
-                }
+                else if(g === CP || g === PL) {}
 
                 symbol.updateHash();
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] LogicalOperator
Calculus.js:698:25
                     b.toUnitMultiplier();
                     symbol = _.multiply(polydiff(symbol.clone()), derive(b));
                 }
-                else if(g === CP || g === PL) {
+                else if(g === CP && g === PL) {
                     // Note: Do not use `parse` since this puts back the sqrt and causes a bug as in #610. Use clone.
                     var c = symbol.clone();
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] BlockStatement
Calculus.js:702:50
                     // Note: Do not use `parse` since this puts back the sqrt and causes a bug as in #610. Use clone.
                     var c = symbol.clone();
                     var result = new Symbol(0);
-                    for(var x in symbol.symbols) {
-                        result = _.add(result, __.diff(symbol.symbols[x].clone(), d));
-                    }
+                    for(var x in symbol.symbols) {}
                     symbol = _.multiply(polydiff(c), result);
                 }
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] BlockStatement
Calculus.js:714:49
             }
             ;
 
-            function qdiff(symbol, val, altVal) {
-                return _.multiply(symbol, _.parse(val + inBrackets(altVal || text(symbol.args[0]))));
-            }
+            function qdiff(symbol, val, altVal) {}
             ;
 
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(cos(x)^(-1)*sec(x)^2+cos(x)^(-2)*sin(x)*tan(x))' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[Killed] ArithmeticOperator
Calculus.js:715:51
             ;
 
             function qdiff(symbol, val, altVal) {
-                return _.multiply(symbol, _.parse(val + inBrackets(altVal || text(symbol.args[0]))));
+                return _.multiply(symbol, _.parse(val - inBrackets(altVal || text(symbol.args[0]))));
             }
             ;
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(cos(x)^(-1)*sec(x)^2+cos(x)^(-2)*sin(x)*tan(x))' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[Killed] ConditionalExpression
Calculus.js:715:68
             ;
 
             function qdiff(symbol, val, altVal) {
-                return _.multiply(symbol, _.parse(val + inBrackets(altVal || text(symbol.args[0]))));
+                return _.multiply(symbol, _.parse(val + inBrackets(false)));
             }
             ;
killedBy: calculus should differentiate correctly
statusReason: Expected '4*(sec(x)*tan(false)*tan(x)+sec(x)^3)' to equal '4*(sec(x)*tan(x)^2+sec(x)^3)'.

[Killed] BlockStatement
Calculus.js:719:43
             }
             ;
 
-            function product_rule(symbol) {
-                //grab all the symbols within the CB symbol
-                var symbols = symbol.collectSymbols(),
-                        result = new Symbol(0),
-                        l = symbols.length;
-                //loop over all the symbols
-                for(var i = 0; i < l; i++) {
-                    var df = __.diff(symbols[i].clone(), d);
-                    for(var j = 0; j < l; j++) {
-                        //skip the symbol of which we just pulled the derivative
-                        if(i !== j) {
-                            //multiply out the remaining symbols
-                            df = _.multiply(df, symbols[j].clone());
-                        }
-                    }
-                    //add the derivative to the result
-                    result = _.add(result, df);
-                }
-                return result; //done
-            }
+            function product_rule(symbol) {}
             ;
         },
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] UpdateOperator
Calculus.js:725:39
                         result = new Symbol(0),
                         l = symbols.length;
                 //loop over all the symbols
-                for(var i = 0; i < l; i++) {
+                for(var i = 0; i < l; i--) {
                     var df = __.diff(symbols[i].clone(), d);
                     for(var j = 0; j < l; j++) {
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] BlockStatement
Calculus.js:725:44
                         result = new Symbol(0),
                         l = symbols.length;
                 //loop over all the symbols
-                for(var i = 0; i < l; i++) {
-                    var df = __.diff(symbols[i].clone(), d);
-                    for(var j = 0; j < l; j++) {
-                        //skip the symbol of which we just pulled the derivative
-                        if(i !== j) {
-                            //multiply out the remaining symbols
-                            df = _.multiply(df, symbols[j].clone());
-                        }
-                    }
-                    //add the derivative to the result
-                    result = _.add(result, df);
-                }
+                for(var i = 0; i < l; i++) {}
                 return result; //done
             }
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] UpdateOperator
Calculus.js:727:43
                 //loop over all the symbols
                 for(var i = 0; i < l; i++) {
                     var df = __.diff(symbols[i].clone(), d);
-                    for(var j = 0; j < l; j++) {
+                    for(var j = 0; j < l; j--) {
                         //skip the symbol of which we just pulled the derivative
                         if(i !== j) {
killedBy: Algebra should perform divisions
statusReason: Expected '1' to equal 'b^(-1)'.

[Killed] BlockStatement
Calculus.js:727:48
                 //loop over all the symbols
                 for(var i = 0; i < l; i++) {
                     var df = __.diff(symbols[i].clone(), d);
-                    for(var j = 0; j < l; j++) {
-                        //skip the symbol of which we just pulled the derivative
-                        if(i !== j) {
-                            //multiply out the remaining symbols
-                            df = _.multiply(df, symbols[j].clone());
-                        }
-                    }
+                    for(var j = 0; j < l; j++) {}
                     //add the derivative to the result
                     result = _.add(result, df);
killedBy: Algebra should factor correctly
statusReason: Expected '(-sqrt(x^2)+sqrt(y^2))*(sqrt(x^2)+sqrt(y^2))' to equal '(-y+x)*(x+y)'.

[Killed] BlockStatement
Calculus.js:729:37
                     var df = __.diff(symbols[i].clone(), d);
                     for(var j = 0; j < l; j++) {
                         //skip the symbol of which we just pulled the derivative
-                        if(i !== j) {
-                            //multiply out the remaining symbols
-                            df = _.multiply(df, symbols[j].clone());
-                        }
+                        if(i !== j) {}
                     }
                     //add the derivative to the result
killedBy: Algebra should factor correctly
statusReason: Expected '(x+x*y)*x' to equal '(1+y)*x^2'.

[Killed] ConditionalExpression
Calculus.js:729:28
                     var df = __.diff(symbols[i].clone(), d);
                     for(var j = 0; j < l; j++) {
                         //skip the symbol of which we just pulled the derivative
-                        if(i !== j) {
+                        if(false) {
                             //multiply out the remaining symbols
                             df = _.multiply(df, symbols[j].clone());
killedBy: Algebra should factor correctly
statusReason: Expected '(-sqrt(x^2)+sqrt(y^2))*(sqrt(x^2)+sqrt(y^2))' to equal '(-y+x)*(x+y)'.

[Killed] BlockStatement
Calculus.js:743:45
         },
         integration: {
             u_substitution: function (symbols, dx) {
-                function try_combo(a, b, f) {
-                    var d = __.diff(b, dx);
-                    var q = f ? f(a, b) : _.divide(a.clone(), d);
-                    if(!q.contains(dx, true))
-                        return q;
-                    return null;
-                }
+                function try_combo(a, b, f) {}
                 function do_fn_sub(fname, arg) {
                     var subbed = __.integrate(_.symfunction(fname, [new Symbol(u)]), u, 0);
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0.732408192446 to equal 0.73240819244541.

[Killed] BooleanLiteral
Calculus.js:746:40
                 function try_combo(a, b, f) {
                     var d = __.diff(b, dx);
                     var q = f ? f(a, b) : _.divide(a.clone(), d);
-                    if(!q.contains(dx, true))
+                    if(!q.contains(dx, false))
                         return q;
                     return null;
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:746:24
                 function try_combo(a, b, f) {
                     var d = __.diff(b, dx);
                     var q = f ? f(a, b) : _.divide(a.clone(), d);
-                    if(!q.contains(dx, true))
+                    if(false)
                         return q;
                     return null;
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[NoCoverage] BlockStatement
Calculus.js:750:48
                         return q;
                     return null;
                 }
-                function do_fn_sub(fname, arg) {
-                    var subbed = __.integrate(_.symfunction(fname, [new Symbol(u)]), u, 0);
-                    subbed = subbed.sub(new Symbol(u), arg);
-                    subbed.updateHash();
-                    return subbed;
-                }
+                function do_fn_sub(fname, arg) {}
 
                 var a = symbols[0].clone(),

[NoCoverage] ArrayDeclaration
Calculus.js:751:68
                     return null;
                 }
                 function do_fn_sub(fname, arg) {
-                    var subbed = __.integrate(_.symfunction(fname, [new Symbol(u)]), u, 0);
+                    var subbed = __.integrate(_.symfunction(fname, []), u, 0);
                     subbed = subbed.sub(new Symbol(u), arg);
                     subbed.updateHash();

[Killed] StringLiteral
Calculus.js:763:29
                         g2 = b.group,
                         //may cause problems if person is using this already. Will need
                         //to find algorithm for detecting conflict
-                        u = '__u__',
+                        u = "",
                         Q;
                 if(g1 === FN && g2 !== FN) {
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] LogicalOperator
Calculus.js:765:20
                         //to find algorithm for detecting conflict
                         u = '__u__',
                         Q;
-                if(g1 === FN && g2 !== FN) {
+                if(g1 === FN || g2 !== FN) {
                     //e.g. 2*x*cos(x^2)
                     var arg = a.args[0];
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:765:33
                         //to find algorithm for detecting conflict
                         u = '__u__',
                         Q;
-                if(g1 === FN && g2 !== FN) {
+                if(g1 === FN && true) {
                     //e.g. 2*x*cos(x^2)
                     var arg = a.args[0];
killedBy: calculus should integrate properly
statusReason: Expected '(1/2)*sin(x)^2' to equal '(-1/2)*cos(x)^2'.

[Killed] ConditionalExpression
Calculus.js:769:24
                     //e.g. 2*x*cos(x^2)
                     var arg = a.args[0];
                     Q = try_combo(b, arg.clone());
-                    if(Q)
+                    if(false)
                         return _.multiply(Q, do_fn_sub(a.fname, arg));
                     Q = try_combo(b, a);
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:769:24
                     //e.g. 2*x*cos(x^2)
                     var arg = a.args[0];
                     Q = try_combo(b, arg.clone());
-                    if(Q)
+                    if(true)
                         return _.multiply(Q, do_fn_sub(a.fname, arg));
                     Q = try_combo(b, a);
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:772:24
                     if(Q)
                         return _.multiply(Q, do_fn_sub(a.fname, arg));
                     Q = try_combo(b, a);
-                    if(Q) {
+                    if(true) {
                         return __.integration.poly_integrate(a);
                     }
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected Infinity to equal -0.

[Killed] ConditionalExpression
Calculus.js:772:24
                     if(Q)
                         return _.multiply(Q, do_fn_sub(a.fname, arg));
                     Q = try_combo(b, a);
-                    if(Q) {
+                    if(false) {
                         return __.integration.poly_integrate(a);
                     }
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:776:38
                         return __.integration.poly_integrate(a);
                     }
                 }
-                else if(g2 === FN && g1 !== FN) {
+                else if(g2 === FN && true) {
                     //e.g. 2*(x+1)*cos((x+1)^2
                     var arg = b.args[0];
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] LogicalOperator
Calculus.js:776:25
                         return __.integration.poly_integrate(a);
                     }
                 }
-                else if(g2 === FN && g1 !== FN) {
+                else if(g2 === FN || g1 !== FN) {
                     //e.g. 2*(x+1)*cos((x+1)^2
                     var arg = b.args[0];
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:780:24
                     //e.g. 2*(x+1)*cos((x+1)^2
                     var arg = b.args[0];
                     Q = try_combo(a, arg.clone());
-                    if(Q)
+                    if(false)
                         return _.multiply(Q, do_fn_sub(b.fname, arg));
                 }
killedBy: calculus should integrate properly
statusReason: Expected '(log(1/119696244)+log(325368125))^(-1)*119696244^(-x)*325368125^x*x-(log(1/119696244)+log(325368125))^(-2)*119696244^(-x)*325368125^x' to equal '-e^x+e^x*x'.

[Killed] ConditionalExpression
Calculus.js:780:24
                     //e.g. 2*(x+1)*cos((x+1)^2
                     var arg = b.args[0];
                     Q = try_combo(a, arg.clone());
-                    if(Q)
+                    if(true)
                         return _.multiply(Q, do_fn_sub(b.fname, arg));
                 }
killedBy: calculus should integrate properly
statusReason: Expected '(log(1/119696244)+log(325368125))^(-1)*119696244^(-x)*325368125^x*x-(log(1/119696244)+log(325368125))^(-2)*119696244^(-x)*325368125^x' to equal '-e^x+e^x*x'.

[Killed] LogicalOperator
Calculus.js:783:25
                     if(Q)
                         return _.multiply(Q, do_fn_sub(b.fname, arg));
                 }
-                else if(g1 === FN && g2 === FN) {
+                else if(g1 === FN || g2 === FN) {
                     Q = try_combo(a.clone(), b.clone());
                     if(Q)
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:783:38
                     if(Q)
                         return _.multiply(Q, do_fn_sub(b.fname, arg));
                 }
-                else if(g1 === FN && g2 === FN) {
+                else if(g1 === FN && true) {
                     Q = try_combo(a.clone(), b.clone());
                     if(Q)
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:785:24
                 }
                 else if(g1 === FN && g2 === FN) {
                     Q = try_combo(a.clone(), b.clone());
-                    if(Q)
+                    if(false)
                         return _.multiply(__.integration.poly_integrate(b), Q);
                     Q = try_combo(b.clone(), a.clone());
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:785:24
                 }
                 else if(g1 === FN && g2 === FN) {
                     Q = try_combo(a.clone(), b.clone());
-                    if(Q)
+                    if(true)
                         return _.multiply(__.integration.poly_integrate(b), Q);
                     Q = try_combo(b.clone(), a.clone());
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:788:24
                     if(Q)
                         return _.multiply(__.integration.poly_integrate(b), Q);
                     Q = try_combo(b.clone(), a.clone());
-                    if(Q)
+                    if(false)
                         return _.multiply(__.integration.poly_integrate(b), Q);
                 }
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.

[Killed] ConditionalExpression
Calculus.js:788:24
                     if(Q)
                         return _.multiply(__.integration.poly_integrate(b), Q);
                     Q = try_combo(b.clone(), a.clone());
-                    if(Q)
+                    if(true)
                         return _.multiply(__.integration.poly_integrate(b), Q);
                 }
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 0 to equal -0.
