[Survived] ConditionalExpression
Solve.js:994:16
             var right = point + 1;
             // First test if this point is even worth evaluating. It should
             // be crossing the x axis so the signs should be different
-            if(Math.sign(f(left)) !== Math.sign(f(right))) {
+            if(true) {
                 var safety = 0;
 

[Killed] BlockStatement
Solve.js:999:20
 
                 var epsilon, middle;
 
-                do {
-                    epsilon = Math.abs(right - left);
-                    // Safety against an infinite loop
-                    if(safety++ > core.Settings.MAX_BISECTION_ITER || isNaN(epsilon)) {
-                        return;
-                    }
-                    // Calculate the middle point
-                    middle = (left + right) / 2;
-
-                    if(f(left) * f(middle) > 0) {
-                        left = middle;
-                    }
-                    else {
-                        right = middle;
-                    }
-                }
+                do {}
                 while(epsilon >= Settings.EPSILON);
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1000:40
                 var epsilon, middle;
 
                 do {
-                    epsilon = Math.abs(right - left);
+                    epsilon = Math.abs(right + left);
                     // Safety against an infinite loop
                     if(safety++ > core.Settings.MAX_BISECTION_ITER || isNaN(epsilon)) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] UpdateOperator
Solve.js:1002:24
                 do {
                     epsilon = Math.abs(right - left);
                     // Safety against an infinite loop
-                    if(safety++ > core.Settings.MAX_BISECTION_ITER || isNaN(epsilon)) {
+                    if(safety-- > core.Settings.MAX_BISECTION_ITER || isNaN(epsilon)) {
                         return;
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] LogicalOperator
Solve.js:1002:24
                 do {
                     epsilon = Math.abs(right - left);
                     // Safety against an infinite loop
-                    if(safety++ > core.Settings.MAX_BISECTION_ITER || isNaN(epsilon)) {
+                    if(safety++ > core.Settings.MAX_BISECTION_ITER && isNaN(epsilon)) {
                         return;
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1006:31
                         return;
                     }
                     // Calculate the middle point
-                    middle = (left + right) / 2;
+                    middle = (left - right) / 2;
 
                     if(f(left) * f(middle) > 0) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1006:30
                         return;
                     }
                     // Calculate the middle point
-                    middle = (left + right) / 2;
+                    middle = (left + right) * 2;
 
                     if(f(left) * f(middle) > 0) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1008:24
                     // Calculate the middle point
                     middle = (left + right) / 2;
 
-                    if(f(left) * f(middle) > 0) {
+                    if(f(left) / f(middle) > 0) {
                         left = middle;
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1008:49
                     // Calculate the middle point
                     middle = (left + right) / 2;
 
-                    if(f(left) * f(middle) > 0) {
-                        left = middle;
-                    }
+                    if(f(left) * f(middle) > 0) {}
                     else {
                         right = middle;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1011:26
                     if(f(left) * f(middle) > 0) {
                         left = middle;
                     }
-                    else {
-                        right = middle;
-                    }
+                    else {}
                 }
                 while(epsilon >= Settings.EPSILON);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1015:23
                         right = middle;
                     }
                 }
-                while(epsilon >= Settings.EPSILON);
+                while(false);
 
                 var solution = (left + right) / 2;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1017:32
                 }
                 while(epsilon >= Settings.EPSILON);
 
-                var solution = (left + right) / 2;
+                var solution = (left + right) * 2;
 
                 // Test the solution to make sure that it's within tolerance
killedBy: Solve should solve correctly
statusReason: Expected '[7,7881299347898374/1125899906842625]' to equal '[7]'.

[Killed] ArithmeticOperator
Solve.js:1017:33
                 }
                 while(epsilon >= Settings.EPSILON);
 
-                var solution = (left + right) / 2;
+                var solution = (left - right) / 2;
 
                 // Test the solution to make sure that it's within tolerance
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1022:94
                 // Test the solution to make sure that it's within tolerance
                 var x_point = f(solution);
 
-                if(!isNaN(x_point) && Math.abs(x_point) <= core.Settings.BI_SECTION_EPSILON) {
-                    // Returns too many junk solutions if not rounded at 13th place.
-                    return core.Utils.round(solution, 13);
-                }
+                if(!isNaN(x_point) && Math.abs(x_point) <= core.Settings.BI_SECTION_EPSILON) {}
             }
         },
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1022:39
                 // Test the solution to make sure that it's within tolerance
                 var x_point = f(solution);
 
-                if(!isNaN(x_point) && Math.abs(x_point) <= core.Settings.BI_SECTION_EPSILON) {
+                if(!isNaN(x_point) && true) {
                     // Returns too many junk solutions if not rounded at 13th place.
                     return core.Utils.round(solution, 13);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1040:16
                     iter = 0;
             //first try the point itself. If it's zero viola. We're done
             var x0 = point, x;
-            do {
-                var fx0 = f(x0); //store the result of the function
-                //if the value is zero then we're done because 0 - (0/d f(x0)) = 0
-                if(x0 === 0 && fx0 === 0) {
-                    x = 0;
-                    break;
-                }
-
-                iter++;
-                if(iter > maxiter)
-                    return; //naximum iterations reached
-
-                x = x0 - fx0 / fp(x0);
-                var e = Math.abs(x - x0);
-                x0 = x;
-            }
+            do {}
             while(e > Settings.NEWTON_EPSILON)
 
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1043:32
             do {
                 var fx0 = f(x0); //store the result of the function
                 //if the value is zero then we're done because 0 - (0/d f(x0)) = 0
-                if(x0 === 0 && fx0 === 0) {
+                if(x0 === 0 && true) {
                     x = 0;
                     break;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1043:20
             do {
                 var fx0 = f(x0); //store the result of the function
                 //if the value is zero then we're done because 0 - (0/d f(x0)) = 0
-                if(x0 === 0 && fx0 === 0) {
+                if(false) {
                     x = 0;
                     break;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Survived] UpdateOperator
Solve.js:1048:17
                     break;
                 }
 
-                iter++;
+                iter--;
                 if(iter > maxiter)
                     return; //naximum iterations reached

[Killed] ConditionalExpression
Solve.js:1049:20
                 }
 
                 iter++;
-                if(iter > maxiter)
+                if(true)
                     return; //naximum iterations reached
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1049:20
                 }
 
                 iter++;
-                if(iter > maxiter)
+                if(false)
                     return; //naximum iterations reached
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1052:26
                 if(iter > maxiter)
                     return; //naximum iterations reached
 
-                x = x0 - fx0 / fp(x0);
+                x = x0 - fx0 * fp(x0);
                 var e = Math.abs(x - x0);
                 x0 = x;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1052:21
                 if(iter > maxiter)
                     return; //naximum iterations reached
 
-                x = x0 - fx0 / fp(x0);
+                x = x0 + fx0 / fp(x0);
                 var e = Math.abs(x - x0);
                 x0 = x;
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArithmeticOperator
Solve.js:1053:34
                     return; //naximum iterations reached
 
                 x = x0 - fx0 / fp(x0);
-                var e = Math.abs(x - x0);
+                var e = Math.abs(x + x0);
                 x0 = x;
             }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1056:19
                 var e = Math.abs(x - x0);
                 x0 = x;
             }
-            while(e > Settings.NEWTON_EPSILON)
+            while(false)
 
             //check if the number is indeed zero. 1e-13 seems to give the most accurate results
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1059:16
             while(e > Settings.NEWTON_EPSILON)
 
             //check if the number is indeed zero. 1e-13 seems to give the most accurate results
-            if(Math.abs(f(x)) <= Settings.EPSILON)
+            if(false)
                 return x;
         },
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1059:16
             while(e > Settings.NEWTON_EPSILON)
 
             //check if the number is indeed zero. 1e-13 seems to give the most accurate results
-            if(Math.abs(f(x)) <= Settings.EPSILON)
+            if(true)
                 return x;
         },
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1063:19
                 return x;
         },
         rewrite: function (rhs, lhs, for_variable) {
-            lhs = lhs || new Symbol(0);
+            lhs = true;
             if(rhs.isComposite() && rhs.isLinear()) {
                 //try to isolate the square root
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1063:19
                 return x;
         },
         rewrite: function (rhs, lhs, for_variable) {
-            lhs = lhs || new Symbol(0);
+            lhs = false;
             if(rhs.isComposite() && rhs.isLinear()) {
                 //try to isolate the square root
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1064:16
         },
         rewrite: function (rhs, lhs, for_variable) {
             lhs = lhs || new Symbol(0);
-            if(rhs.isComposite() && rhs.isLinear()) {
+            if(true) {
                 //try to isolate the square root
                 //container for the square roots
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1064:16
         },
         rewrite: function (rhs, lhs, for_variable) {
             lhs = lhs || new Symbol(0);
-            if(rhs.isComposite() && rhs.isLinear()) {
+            if(false) {
                 //try to isolate the square root
                 //container for the square roots
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ArrayDeclaration
Solve.js:1067:29
             if(rhs.isComposite() && rhs.isLinear()) {
                 //try to isolate the square root
                 //container for the square roots
-                var sqrts = [];
+                var sqrts = ["Stryker was here"];
                 //all else
                 var rem = [];
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1070:39
                 var sqrts = [];
                 //all else
                 var rem = [];
-                rhs.each(function (x) {
-                    x = x.clone();
-                    if(x.fname === 'sqrt' && x.contains(for_variable)) {
-                        sqrts.push(x);
-                    }
-                    else {
-                        rem.push(x);
-                    }
-                }, true);
+                rhs.each(function (x) {}, true);
 
                 if(sqrts.length === 1) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] ConditionalExpression
Solve.js:1072:24
                 var rem = [];
                 rhs.each(function (x) {
                     x = x.clone();
-                    if(x.fname === 'sqrt' && x.contains(for_variable)) {
+                    if(true) {
                         sqrts.push(x);
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] ConditionalExpression
Solve.js:1072:24
                 var rem = [];
                 rhs.each(function (x) {
                     x = x.clone();
-                    if(x.fname === 'sqrt' && x.contains(for_variable)) {
+                    if(true && x.contains(for_variable)) {
                         sqrts.push(x);
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] BlockStatement
Solve.js:1075:26
                     if(x.fname === 'sqrt' && x.contains(for_variable)) {
                         sqrts.push(x);
                     }
-                    else {
-                        rem.push(x);
-                    }
+                    else {}
                 }, true);
 
killedBy: Solve should solve correctly
statusReason: Expected '[x]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] BooleanLiteral
Solve.js:1078:20
                     else {
                         rem.push(x);
                     }
-                }, true);
+                }, false);
 
                 if(sqrts.length === 1) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1080:20
                     }
                 }, true);
 
-                if(sqrts.length === 1) {
+                if(true) {
                     //move the remainder to the RHS
                     lhs = _.expand(_.pow(_.subtract(lhs, core.Utils.arraySum(rem)), new Symbol(2)));
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] BlockStatement
Solve.js:1080:40
                     }
                 }, true);
 
-                if(sqrts.length === 1) {
-                    //move the remainder to the RHS
-                    lhs = _.expand(_.pow(_.subtract(lhs, core.Utils.arraySum(rem)), new Symbol(2)));
-                    //square both sides
-                    rhs = _.expand(_.pow(Symbol.unwrapSQRT(sqrts[0]), new Symbol(2)));
-                }
+                if(sqrts.length === 1) {}
             }
             else {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1087:18
                     rhs = _.expand(_.pow(Symbol.unwrapSQRT(sqrts[0]), new Symbol(2)));
                 }
             }
-            else {
-                rhs = Symbol.unwrapSQRT(_.expand(rhs)); //expand the term expression go get rid of quotients when possible
-            }
+            else {}
 
             var c = 0, //a counter to see if we have all terms with the variable
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1094:16
             var c = 0, //a counter to see if we have all terms with the variable
                     l = rhs.length;
             //try to rewrite the whole thing
-            if(rhs.group === CP && rhs.contains(for_variable) && rhs.isLinear()) {
+            if(false) {
                 rhs.distributeMultiplier();
                 var t = new Symbol(0);
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] BlockStatement
Solve.js:1094:82
             var c = 0, //a counter to see if we have all terms with the variable
                     l = rhs.length;
             //try to rewrite the whole thing
-            if(rhs.group === CP && rhs.contains(for_variable) && rhs.isLinear()) {
-                rhs.distributeMultiplier();
-                var t = new Symbol(0);
-                //first bring all the terms containing the variable to the lhs
-                rhs.each(function (x) {
-                    if(x.contains(for_variable)) {
-                        c++;
-                        t = _.add(t, x.clone());
-                    }
-                    else
-                        lhs = _.subtract(lhs, x.clone());
-                });
-                rhs = t;
-
-                //if not all the terms contain the variable so it's in the form
-                //a*x^2+x
-                if(c !== l) {
-                    return __.rewrite(rhs, lhs, for_variable);
-                }
-                else {
-                    return [rhs, lhs];
-                }
-            }
+            if(rhs.group === CP && rhs.contains(for_variable) && rhs.isLinear()) {}
             else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
                 if(rhs.multiplier.lessThan(0)) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1098:39
                 rhs.distributeMultiplier();
                 var t = new Symbol(0);
                 //first bring all the terms containing the variable to the lhs
-                rhs.each(function (x) {
-                    if(x.contains(for_variable)) {
-                        c++;
-                        t = _.add(t, x.clone());
-                    }
-                    else
-                        lhs = _.subtract(lhs, x.clone());
-                });
+                rhs.each(function (x) {});
                 rhs = t;
 
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1099:24
                 var t = new Symbol(0);
                 //first bring all the terms containing the variable to the lhs
                 rhs.each(function (x) {
-                    if(x.contains(for_variable)) {
+                    if(true) {
                         c++;
                         t = _.add(t, x.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] BlockStatement
Solve.js:1099:50
                 var t = new Symbol(0);
                 //first bring all the terms containing the variable to the lhs
                 rhs.each(function (x) {
-                    if(x.contains(for_variable)) {
-                        c++;
-                        t = _.add(t, x.clone());
-                    }
+                    if(x.contains(for_variable)) {}
                     else
                         lhs = _.subtract(lhs, x.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] UpdateOperator
Solve.js:1100:25
                 //first bring all the terms containing the variable to the lhs
                 rhs.each(function (x) {
                     if(x.contains(for_variable)) {
-                        c++;
+                        c--;
                         t = _.add(t, x.clone());
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1110:29
 
                 //if not all the terms contain the variable so it's in the form
                 //a*x^2+x
-                if(c !== l) {
-                    return __.rewrite(rhs, lhs, for_variable);
-                }
+                if(c !== l) {}
                 else {
                     return [rhs, lhs];
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1110:20
 
                 //if not all the terms contain the variable so it's in the form
                 //a*x^2+x
-                if(c !== l) {
+                if(false) {
                     return __.rewrite(rhs, lhs, for_variable);
                 }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] BlockStatement
Solve.js:1113:22
                 if(c !== l) {
                     return __.rewrite(rhs, lhs, for_variable);
                 }
-                else {
-                    return [rhs, lhs];
-                }
+                else {}
             }
             else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {

[Killed] ConditionalExpression
Solve.js:1117:21
                     return [rhs, lhs];
                 }
             }
-            else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
+            else if(false) {
                 if(rhs.multiplier.lessThan(0)) {
                     rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.
