[Killed] BlockStatement
Calculus.js:1664:106
                                                                 }
                                                                 else {
                                                                     //performs double angle transformation
-                                                                    var double_angle = function (symbol) {
-                                                                        var p = symbol.power,
-                                                                                k = p / 2, e;
-                                                                        if(symbol.fname === COS)
-                                                                            e = '((1/2)+(cos(2*(' + symbol.args[0] + '))/2))^' + k;
-                                                                        else
-                                                                            e = '((1/2)-(cos(2*(' + symbol.args[0] + '))/2))^' + k;
-
-                                                                        return _.parse(e);
-                                                                    };
+                                                                    var double_angle = function (symbol) {};
                                                                     //they're both even so transform both using double angle identities and we'll just
                                                                     //be able to integrate by the sum of integrals
killedBy: calculus should integrate properly
statusReason: ParseError: Cannot read property 'group' of undefined: 1

[Killed] ArithmeticOperator
Calculus.js:1666:85
                                                                     //performs double angle transformation
                                                                     var double_angle = function (symbol) {
                                                                         var p = symbol.power,
-                                                                                k = p / 2, e;
+                                                                                k = p * 2, e;
                                                                         if(symbol.fname === COS)
                                                                             e = '((1/2)+(cos(2*(' + symbol.args[0] + '))/2))^' + k;
killedBy: calculus should integrate properly

[Killed] ConditionalExpression
Calculus.js:1667:76
                                                                     var double_angle = function (symbol) {
                                                                         var p = symbol.power,
                                                                                 k = p / 2, e;
-                                                                        if(symbol.fname === COS)
+                                                                        if(false)
                                                                             e = '((1/2)+(cos(2*(' + symbol.args[0] + '))/2))^' + k;
                                                                         else
killedBy: calculus should integrate properly
statusReason: Expected '((-1/4)*sin(2*asin(sqrt(a)^(-1)*x))+(1/16)*cos(2*asin(sqrt(a)^(-1)*x))*sin(2*asin(sqrt(a)^(-1)*x))+(3/8)*asin(sqrt(a)^(-1)*x))*a^2' to equal '((-1/16)*cos(2*asin(sqrt(a)^(-1)*x))*sin(2*asin(sqrt(a)^(-1)*x))+(1/8)*asin(sqrt(a)^(-1)*x))*a^2'.

[Killed] ConditionalExpression
Calculus.js:1667:76
                                                                     var double_angle = function (symbol) {
                                                                         var p = symbol.power,
                                                                                 k = p / 2, e;
-                                                                        if(symbol.fname === COS)
+                                                                        if(true)
                                                                             e = '((1/2)+(cos(2*(' + symbol.args[0] + '))/2))^' + k;
                                                                         else
killedBy: calculus should integrate properly
statusReason: Expected '((1/16)*cos(2*asin(sqrt(a)^(-1)*x))*sin(2*asin(sqrt(a)^(-1)*x))+(1/4)*sin(2*asin(sqrt(a)^(-1)*x))+(3/8)*asin(sqrt(a)^(-1)*x))*a^2' to equal '((-1/16)*cos(2*asin(sqrt(a)^(-1)*x))*sin(2*asin(sqrt(a)^(-1)*x))+(1/8)*asin(sqrt(a)^(-1)*x))*a^2'.

[Killed] StringLiteral
Calculus.js:1670:118
                                                                         if(symbol.fname === COS)
                                                                             e = '((1/2)+(cos(2*(' + symbol.args[0] + '))/2))^' + k;
                                                                         else
-                                                                            e = '((1/2)-(cos(2*(' + symbol.args[0] + '))/2))^' + k;
+                                                                            e = '((1/2)-(cos(2*(' + symbol.args[0] + "" + k;
 
                                                                         return _.parse(e);
killedBy: calculus should integrate properly
statusReason: ParseError: Missing closed bracket for bracket at 15: 1

[Killed] BlockStatement
Calculus.js:1680:91
                                                                             b = double_angle(sym2),
                                                                             t = _.multiply(a, b);
                                                                     var sym = _.expand(t);
-                                                                    sym.each(function (x) {
-                                                                        retval = _.add(retval, __.integrate(x, dx, depth));
-                                                                    });
+                                                                    sym.each(function (x) {});
                                                                     return _.multiply(retval, coeff);
                                                                 }
killedBy: calculus should integrate properly
statusReason: Expected '0' to equal '((-1/16)*cos(2*asin(sqrt(a)^(-1)*x))*sin(2*asin(sqrt(a)^(-1)*x))+(1/8)*asin(sqrt(a)^(-1)*x))*a^2'.

[Killed] LogicalOperator
Calculus.js:1689:61
                                                         }
                                                     }
                                                     //tan(x)*sec(x)^n 
-                                                    else if(fn1 === SEC && fn2 === TAN && x.isLinear() && sym2.isLinear()) {
+                                                    else if(fn1 === SEC && fn2 === TAN || x.isLinear() && sym2.isLinear()) {
                                                         retval = _.parse(format('sec({0})^({1})/({1})', sym1.args[0], sym1.power));
                                                     }
killedBy: calculus should integrate properly
statusReason: Expected 'sec(a*x)' to equal 'a^(-1)*sec(a*x)'.

[Killed] LogicalOperator
Calculus.js:1689:61
                                                         }
                                                     }
                                                     //tan(x)*sec(x)^n 
-                                                    else if(fn1 === SEC && fn2 === TAN && x.isLinear() && sym2.isLinear()) {
+                                                    else if(fn1 === SEC && fn2 === TAN && x.isLinear() || sym2.isLinear()) {
                                                         retval = _.parse(format('sec({0})^({1})/({1})', sym1.args[0], sym1.power));
                                                     }
killedBy: calculus should integrate properly
statusReason: Expected 'sec(a*x)' to equal 'a^(-1)*sec(a*x)'.

[Killed] LogicalOperator
Calculus.js:1692:61
                                                     else if(fn1 === SEC && fn2 === TAN && x.isLinear() && sym2.isLinear()) {
                                                         retval = _.parse(format('sec({0})^({1})/({1})', sym1.args[0], sym1.power));
                                                     }
-                                                    else if(fn1 === TAN && fn2 === SEC && x.isLinear()) {
+                                                    else if(fn1 === TAN && fn2 === SEC || x.isLinear()) {
                                                         //remaining: tan(x)^3*sec(x)^6
                                                         if(sym1.isLinear() && sym2.isLinear()) {
killedBy: calculus should integrate properly
statusReason: Expected 'sec(x)' to equal 'log(sec(x)+tan(x))'.

[Killed] ConditionalExpression
Calculus.js:1692:61
                                                     else if(fn1 === SEC && fn2 === TAN && x.isLinear() && sym2.isLinear()) {
                                                         retval = _.parse(format('sec({0})^({1})/({1})', sym1.args[0], sym1.power));
                                                     }
-                                                    else if(fn1 === TAN && fn2 === SEC && x.isLinear()) {
+                                                    else if(false) {
                                                         //remaining: tan(x)^3*sec(x)^6
                                                         if(sym1.isLinear() && sym2.isLinear()) {
killedBy: calculus should integrate properly
statusReason: Expected 'cos(a*x)^(-1)' to equal 'a^(-1)*sec(a*x)'.

[Killed] BlockStatement
Calculus.js:1694:96
                                                     }
                                                     else if(fn1 === TAN && fn2 === SEC && x.isLinear()) {
                                                         //remaining: tan(x)^3*sec(x)^6
-                                                        if(sym1.isLinear() && sym2.isLinear()) {
-                                                            retval = _.divide(_.symfunction(SEC, [arg1.clone()]), a);
-                                                        }
+                                                        if(sym1.isLinear() && sym2.isLinear()) {}
                                                         else if(even(sym1.power)) {
                                                             var p = Number(sym1.power) / 2;
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sec(a*x)*tan(a*x),x)' to equal 'a^(-1)*sec(a*x)'.

[Killed] ConditionalExpression
Calculus.js:1694:60
                                                     }
                                                     else if(fn1 === TAN && fn2 === SEC && x.isLinear()) {
                                                         //remaining: tan(x)^3*sec(x)^6
-                                                        if(sym1.isLinear() && sym2.isLinear()) {
+                                                        if(true) {
                                                             retval = _.divide(_.symfunction(SEC, [arg1.clone()]), a);
                                                         }
killedBy: calculus should integrate properly
statusReason: Expected 'sec(x)' to equal '(-1/2)*log(sec(x)+tan(x))+(1/2)*sec(x)*tan(x)'.

[Killed] ConditionalExpression
Calculus.js:1697:65
                                                         if(sym1.isLinear() && sym2.isLinear()) {
                                                             retval = _.divide(_.symfunction(SEC, [arg1.clone()]), a);
                                                         }
-                                                        else if(even(sym1.power)) {
+                                                        else if(false) {
                                                             var p = Number(sym1.power) / 2;
                                                             //transform tangent
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sec(x)*tan(x)^2,x)' to equal '(-1/2)*log(sec(x)+tan(x))+(1/2)*sec(x)*tan(x)'.

[Killed] BlockStatement
Calculus.js:1697:83
                                                         if(sym1.isLinear() && sym2.isLinear()) {
                                                             retval = _.divide(_.symfunction(SEC, [arg1.clone()]), a);
                                                         }
-                                                        else if(even(sym1.power)) {
-                                                            var p = Number(sym1.power) / 2;
-                                                            //transform tangent
-                                                            var t = _.parse(format('(sec({0})^2-1)^({1})', sym1.args[0], p));
-                                                            retval = __.integrate(_.expand(_.multiply(t, sym2)), dx, depth);
-                                                        }
+                                                        else if(even(sym1.power)) {}
                                                         else
                                                             __.integration.stop();
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sec(x)*tan(x)^2,x)' to equal '(-1/2)*log(sec(x)+tan(x))+(1/2)*sec(x)*tan(x)'.

[Killed] ArithmeticOperator
Calculus.js:1698:69
                                                             retval = _.divide(_.symfunction(SEC, [arg1.clone()]), a);
                                                         }
                                                         else if(even(sym1.power)) {
-                                                            var p = Number(sym1.power) / 2;
+                                                            var p = Number(sym1.power) * 2;
                                                             //transform tangent
                                                             var t = _.parse(format('(sec({0})^2-1)^({1})', sym1.args[0], p));
killedBy: calculus should integrate properly
statusReason: Expected '(-25/48)*sec(x)^5*tan(x)+(-93/128)*sec(x)*tan(x)+(1/8)*sec(x)^7*tan(x)+(163/192)*sec(x)^3*tan(x)+(35/128)*log(sec(x)+tan(x))' to equal '(-1/2)*log(sec(x)+tan(x))+(1/2)*sec(x)*tan(x)'.

[Killed] LogicalOperator
Calculus.js:1706:61
                                                         else
                                                             __.integration.stop();
                                                     }
-                                                    else if(fn1 === SEC && fn2 === COS) {
+                                                    else if(fn1 === SEC || fn2 === COS) {
                                                         sym1.fname = COS;
                                                         sym1.invert().updateHash();
killedBy: calculus should integrate properly
statusReason: Expected 'x' to equal '(-1/4)*e^(-x)*sin(x)+(1/4)*cos(x)*e^(-x)+(1/4)*cos(x)*e^x+(1/4)*e^x*sin(x)'.

[Killed] ConditionalExpression
Calculus.js:1706:61
                                                         else
                                                             __.integration.stop();
                                                     }
-                                                    else if(fn1 === SEC && fn2 === COS) {
+                                                    else if(true) {
                                                         sym1.fname = COS;
                                                         sym1.invert().updateHash();
killedBy: calculus should integrate properly
statusReason: Expected 'tan(x)' to equal 'log(sec(x)+tan(x))'.

[Killed] ConditionalExpression
Calculus.js:1711:61
                                                         sym1.invert().updateHash();
                                                         retval = __.integrate(_.multiply(sym1, sym2), dx, depth);
                                                     }
-                                                    else if(fn1 === SIN && fn2 === CSC) {
+                                                    else if(true) {
                                                         sym2.fname = SIN;
                                                         sym2.invert().updateHash();
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sin(x)*tan(x),x)' to equal 'log(sec(x)+tan(x))'.

[Killed] ConditionalExpression
Calculus.js:1711:76
                                                         sym1.invert().updateHash();
                                                         retval = __.integrate(_.multiply(sym1, sym2), dx, depth);
                                                     }
-                                                    else if(fn1 === SIN && fn2 === CSC) {
+                                                    else if(fn1 === SIN && true) {
                                                         sym2.fname = SIN;
                                                         sym2.invert().updateHash();
killedBy: calculus should integrate properly
statusReason: Expected '(-1/2)*cos(x)*sin(x)+(1/2)*x' to equal '(-1/2)*cos(x)^2'.

[Killed] BlockStatement
Calculus.js:1717:132
                                                         retval = __.integrate(_.multiply(sym1, sym2), dx, depth);
                                                     }
                                                     //tan/cos
-                                                    else if(fn1 === TAN && (fn2 === COS || fn2 === SIN) && sym2.power.lessThan(0)) {
-                                                        var t = _.multiply(sym1.fnTransform(), sym2);
-                                                        retval = __.integrate(_.expand(t), dx, depth);
-                                                    }
+                                                    else if(fn1 === TAN && (fn2 === COS || fn2 === SIN) && sym2.power.lessThan(0)) {}
                                                     else {
                                                         var t = _.multiply(sym1.fnTransform(), sym2.fnTransform());
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(cos(x)^(-1)*tan(x),x)' to equal 'cos(x)^(-1)'.

[Killed] LogicalOperator
Calculus.js:1717:61
                                                         retval = __.integrate(_.multiply(sym1, sym2), dx, depth);
                                                     }
                                                     //tan/cos
-                                                    else if(fn1 === TAN && (fn2 === COS || fn2 === SIN) && sym2.power.lessThan(0)) {
+                                                    else if(fn1 === TAN && (fn2 === COS || fn2 === SIN) || sym2.power.lessThan(0)) {
                                                         var t = _.multiply(sym1.fnTransform(), sym2);
                                                         retval = __.integrate(_.expand(t), dx, depth);
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sec(x)^(-1)*sin(x),x)' to equal '(-1/2)*cos(x)^2'.

[Killed] BlockStatement
Calculus.js:1721:58
                                                         var t = _.multiply(sym1.fnTransform(), sym2);
                                                         retval = __.integrate(_.expand(t), dx, depth);
                                                     }
-                                                    else {
-                                                        var t = _.multiply(sym1.fnTransform(), sym2.fnTransform());
-                                                        retval = __.integrate(_.expand(t), dx, depth);
-                                                    }
+                                                    else {}
                                                 }
                                                 //TODO: In progress
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(csc(x)*tan(x),x)' to equal 'log(sec(x)+tan(x))'.

[Killed] ConditionalExpression
Calculus.js:1727:57
                                                     }
                                                 }
                                                 //TODO: In progress
-                                                else if((fn1 === SIN || fn1 === COS) && (fn2 === SIN || fn2 === COS)) {
+                                                else if(false) {
 
                                                     if(sym1.isLinear() && sym2.isLinear()) {
killedBy: calculus should integrate properly
statusReason: Expected '(-1/2)*cos(x)+integrate((-1/2)*cos(2*x)*sin(x),x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Killed] ConditionalExpression
Calculus.js:1727:105
                                                     }
                                                 }
                                                 //TODO: In progress
-                                                else if((fn1 === SIN || fn1 === COS) && (fn2 === SIN || fn2 === COS)) {
+                                                else if((fn1 === SIN || fn1 === COS) && (fn2 === SIN || false)) {
 
                                                     if(sym1.isLinear() && sym2.isLinear()) {
killedBy: calculus should integrate properly
statusReason: Expected '(-1/2)*cos(x)+integrate((-1/2)*cos(2*x)*sin(x),x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Killed] BlockStatement
Calculus.js:1729:92
                                                 //TODO: In progress
                                                 else if((fn1 === SIN || fn1 === COS) && (fn2 === SIN || fn2 === COS)) {
 
-                                                    if(sym1.isLinear() && sym2.isLinear()) {
-                                                        //if in the form cos(a*x)*sin(b*x)
-                                                        if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {
-                                                            //use identity (sin(b*x+a*x)+sin(b*x-a*x))/2
-                                                            var ax, bx;
-                                                            if(fn2 === SIN) {
-                                                                ax = sym1.args[0];
-                                                                bx = sym2.args[0];
-                                                            }
-                                                            else {
-                                                                bx = sym1.args[0];
-                                                                ax = sym2.args[0];
-                                                            }
-
-                                                            //make the transformation
-                                                            f = _.parse(format('(sin(({1})+({0}))+sin(({1})-({0})))/2', ax.toString(), bx.toString()));
-
-                                                            //integrate it
-                                                            retval = __.integrate(f, dx, depth);
-                                                        }
-                                                        else {
-                                                            var transformed = trigTransform(symbols);
-                                                            retval = __.integrate(_.expand(transformed), dx, depth);
-                                                        }
-                                                    }
+                                                    if(sym1.isLinear() && sym2.isLinear()) {}
                                                     else {
                                                         var transformed = new Symbol(1);
killedBy: calculus should integrate properly
statusReason: Expected '(-1/2)*cos(x)+integrate((-1/2)*cos(2*x)*sin(x),x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Killed] ConditionalExpression
Calculus.js:1729:56
                                                 //TODO: In progress
                                                 else if((fn1 === SIN || fn1 === COS) && (fn2 === SIN || fn2 === COS)) {
 
-                                                    if(sym1.isLinear() && sym2.isLinear()) {
+                                                    if(false) {
                                                         //if in the form cos(a*x)*sin(b*x)
                                                         if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {
killedBy: calculus should integrate properly
statusReason: Expected '(-1/4)*cos(x)+(1/12)*cos(3*x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Killed] BlockStatement
Calculus.js:1731:112
 
                                                     if(sym1.isLinear() && sym2.isLinear()) {
                                                         //if in the form cos(a*x)*sin(b*x)
-                                                        if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {
-                                                            //use identity (sin(b*x+a*x)+sin(b*x-a*x))/2
-                                                            var ax, bx;
-                                                            if(fn2 === SIN) {
-                                                                ax = sym1.args[0];
-                                                                bx = sym2.args[0];
-                                                            }
-                                                            else {
-                                                                bx = sym1.args[0];
-                                                                ax = sym2.args[0];
-                                                            }
-
-                                                            //make the transformation
-                                                            f = _.parse(format('(sin(({1})+({0}))+sin(({1})-({0})))/2', ax.toString(), bx.toString()));
-
-                                                            //integrate it
-                                                            retval = __.integrate(f, dx, depth);
-                                                        }
+                                                        if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {}
                                                         else {
                                                             var transformed = trigTransform(symbols);
killedBy: calculus should integrate properly
statusReason: Expected '(-1/2)*cos(x)+integrate((-1/2)*cos(2*x)*sin(x),x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[Survived] LogicalOperator
Calculus.js:1731:60
 
                                                     if(sym1.isLinear() && sym2.isLinear()) {
                                                         //if in the form cos(a*x)*sin(b*x)
-                                                        if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {
+                                                        if(sym1.args[0].isLinear() || sym2.args[0].isLinear()) {
                                                             //use identity (sin(b*x+a*x)+sin(b*x-a*x))/2
                                                             var ax, bx;

[Killed] ConditionalExpression
Calculus.js:1734:64
                                                         if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {
                                                             //use identity (sin(b*x+a*x)+sin(b*x-a*x))/2
                                                             var ax, bx;
-                                                            if(fn2 === SIN) {
+                                                            if(true) {
                                                                 ax = sym1.args[0];
                                                                 bx = sym2.args[0];
killedBy: calculus should integrate properly
statusReason: Expected '(-1/4)*cos(x)+(1/12)*cos(3*x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[NoCoverage] BlockStatement
Calculus.js:1734:77
                                                         if(sym1.args[0].isLinear() && sym2.args[0].isLinear()) {
                                                             //use identity (sin(b*x+a*x)+sin(b*x-a*x))/2
                                                             var ax, bx;
-                                                            if(fn2 === SIN) {
-                                                                ax = sym1.args[0];
-                                                                bx = sym2.args[0];
-                                                            }
+                                                            if(fn2 === SIN) {}
                                                             else {
                                                                 bx = sym1.args[0];
