[Killed] BlockStatement
Calculus.js:1738:66
                                                                 ax = sym1.args[0];
                                                                 bx = sym2.args[0];
                                                             }
-                                                            else {
-                                                                bx = sym1.args[0];
-                                                                ax = sym2.args[0];
-                                                            }
+                                                            else {}
 
                                                             //make the transformation
killedBy: calculus should integrate properly
statusReason: ParseError: Cannot read property 'toString' of undefined: 1

[Killed] StringLiteral
Calculus.js:1744:80
                                                             }
 
                                                             //make the transformation
-                                                            f = _.parse(format('(sin(({1})+({0}))+sin(({1})-({0})))/2', ax.toString(), bx.toString()));
+                                                            f = _.parse(format("", ax.toString(), bx.toString()));
 
                                                             //integrate it
killedBy: calculus should integrate properly
statusReason: Expected '(-1/2)*cos(x)' to equal '(-3/4)*cos(x)+(1/12)*cos(3*x)'.

[NoCoverage] BlockStatement
Calculus.js:1749:62
                                                             //integrate it
                                                             retval = __.integrate(f, dx, depth);
                                                         }
-                                                        else {
-                                                            var transformed = trigTransform(symbols);
-                                                            retval = __.integrate(_.expand(transformed), dx, depth);
-                                                        }
+                                                        else {}
                                                     }
                                                     else {

[NoCoverage] BlockStatement
Calculus.js:1754:58
                                                             retval = __.integrate(_.expand(transformed), dx, depth);
                                                         }
                                                     }
-                                                    else {
-                                                        var transformed = new Symbol(1);
-                                                        symbols.map(function (sym) {
-                                                            var s = sym.fnTransform();
-                                                            transformed = _.multiply(transformed, s);
-                                                        });
-                                                        var t = _.expand(transformed);
-
-                                                        retval = __.integrate(t, dx, depth);
-
-                                                        if(retval.hasIntegral()) {
-                                                            retval = __.integrate(trigTransform(transformed.collectSymbols()), dx, depth);
-                                                        }
-                                                    }
+                                                    else {}
                                                 }
                                                 else {

[NoCoverage] BlockStatement
Calculus.js:1756:84
                                                     }
                                                     else {
                                                         var transformed = new Symbol(1);
-                                                        symbols.map(function (sym) {
-                                                            var s = sym.fnTransform();
-                                                            transformed = _.multiply(transformed, s);
-                                                        });
+                                                        symbols.map(function (sym) {});
                                                         var t = _.expand(transformed);
 

[NoCoverage] BlockStatement
Calculus.js:1764:82
 
                                                         retval = __.integrate(t, dx, depth);
 
-                                                        if(retval.hasIntegral()) {
-                                                            retval = __.integrate(trigTransform(transformed.collectSymbols()), dx, depth);
-                                                        }
+                                                        if(retval.hasIntegral()) {}
                                                     }
                                                 }

[NoCoverage] ConditionalExpression
Calculus.js:1764:60
 
                                                         retval = __.integrate(t, dx, depth);
 
-                                                        if(retval.hasIntegral()) {
+                                                        if(false) {
                                                             retval = __.integrate(trigTransform(transformed.collectSymbols()), dx, depth);
                                                         }

[NoCoverage] BlockStatement
Calculus.js:1769:54
                                                         }
                                                     }
                                                 }
-                                                else {
-                                                    __.integration.stop();
-                                                }
+                                                else {}
 
                                             }

[Killed] ConditionalExpression
Calculus.js:1775:49
 
                                             }
                                         }
-                                        else if(g1 === FN && g2 === S) {
+                                        else if(true) {
                                             var sym1_is_linear = sym1.isLinear();
                                             if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 23.55589098293673 to equal 23.555890982937.

[Killed] ConditionalExpression
Calculus.js:1775:49
 
                                             }
                                         }
-                                        else if(g1 === FN && g2 === S) {
+                                        else if(true && g2 === S) {
                                             var sym1_is_linear = sym1.isLinear();
                                             if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected 23.55589098293673 to equal 23.555890982937.

[Killed] LogicalOperator
Calculus.js:1777:48
                                         }
                                         else if(g1 === FN && g2 === S) {
                                             var sym1_is_linear = sym1.isLinear();
-                                            if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
+                                            if(sym1.fname === COS && sym1_is_linear || sym2.power.equals(-1))
                                                 retval = _.symfunction('Ci', [sym1.args[0]]);
                                             else if(sym1.fname === COS && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected '-cos(x)*x^2+2*Ci(x)' to equal '-cos(x)*x^2+2*cos(x)+2*sin(x)*x'.

[Killed] ConditionalExpression
Calculus.js:1777:48
                                         }
                                         else if(g1 === FN && g2 === S) {
                                             var sym1_is_linear = sym1.isLinear();
-                                            if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
+                                            if(false)
                                                 retval = _.symfunction('Ci', [sym1.args[0]]);
                                             else if(sym1.fname === COS && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(cos(x)*x^(-1),x)' to equal 'Ci(x)'.

[Killed] ArrayDeclaration
Calculus.js:1778:78
                                         else if(g1 === FN && g2 === S) {
                                             var sym1_is_linear = sym1.isLinear();
                                             if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
-                                                retval = _.symfunction('Ci', [sym1.args[0]]);
+                                                retval = _.symfunction('Ci', []);
                                             else if(sym1.fname === COS && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
killedBy: calculus should integrate properly
statusReason: Expected 'Ci()' to equal 'Ci(x)'.

[Killed] UnaryOperator
Calculus.js:1779:93
                                             var sym1_is_linear = sym1.isLinear();
                                             if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Ci', [sym1.args[0]]);
-                                            else if(sym1.fname === COS && sym2.power.equals(-1)) {
+                                            else if(sym1.fname === COS && sym2.power.equals(+1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly
statusReason: Expected '-cos(x)*x^2+2*integrate(cos(x)*x,x)' to equal '-cos(x)*x^2+2*cos(x)+2*sin(x)*x'.

[Killed] LogicalOperator
Calculus.js:1779:53
                                             var sym1_is_linear = sym1.isLinear();
                                             if(sym1.fname === COS && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Ci', [sym1.args[0]]);
-                                            else if(sym1.fname === COS && sym2.power.equals(-1)) {
+                                            else if(sym1.fname === COS || sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly
statusReason: Expected '-cos(x)*x^2+2*integrate(cos(x)*x,x)' to equal '-cos(x)*x^2+2*cos(x)+2*sin(x)*x'.

[Killed] LogicalOperator
Calculus.js:1782:53
                                             else if(sym1.fname === COS && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === COSH && sym1_is_linear && sym2.power.equals(-1))
+                                            else if(sym1.fname === COSH && sym1_is_linear || sym2.power.equals(-1))
                                                 retval = _.symfunction('Chi', [sym1.args[0]]);
                                             else if(sym1.fname === COSH && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected 'Chi(x)' to equal 'Si(x)'.

[Killed] LogicalOperator
Calculus.js:1782:53
                                             else if(sym1.fname === COS && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === COSH && sym1_is_linear && sym2.power.equals(-1))
+                                            else if(sym1.fname === COSH || sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Chi', [sym1.args[0]]);
                                             else if(sym1.fname === COSH && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected 'Chi(x)' to equal 'Si(x)'.

[NoCoverage] ArrayDeclaration
Calculus.js:1783:79
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
                                             else if(sym1.fname === COSH && sym1_is_linear && sym2.power.equals(-1))
-                                                retval = _.symfunction('Chi', [sym1.args[0]]);
+                                                retval = _.symfunction('Chi', []);
                                             else if(sym1.fname === COSH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);

[NoCoverage] StringLiteral
Calculus.js:1783:72
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
                                             else if(sym1.fname === COSH && sym1_is_linear && sym2.power.equals(-1))
-                                                retval = _.symfunction('Chi', [sym1.args[0]]);
+                                                retval = _.symfunction("", [sym1.args[0]]);
                                             else if(sym1.fname === COSH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);

[Killed] ConditionalExpression
Calculus.js:1784:53
                                             }
                                             else if(sym1.fname === COSH && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Chi', [sym1.args[0]]);
-                                            else if(sym1.fname === COSH && sym2.power.equals(-1)) {
+                                            else if(true) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(log(x)*x^3,x)' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.

[Killed] ConditionalExpression
Calculus.js:1784:53
                                             }
                                             else if(sym1.fname === COSH && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Chi', [sym1.args[0]]);
-                                            else if(sym1.fname === COSH && sym2.power.equals(-1)) {
+                                            else if(true && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sin(x)*x^(-1),x)' to equal 'Si(x)'.

[Killed] ConditionalExpression
Calculus.js:1787:53
                                             else if(sym1.fname === COSH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === SIN && sym1_is_linear && sym2.power.equals(-1))
+                                            else if(true)
                                                 retval = _.symfunction('Si', [sym1.args[0]]);
                                             else if(sym1.fname === SIN && sym2.power.equals(-1)) {
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected -Infinity to equal -0.

[Killed] ConditionalExpression
Calculus.js:1787:53
                                             else if(sym1.fname === COSH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === SIN && sym1_is_linear && sym2.power.equals(-1))
+                                            else if(true && sym2.power.equals(-1))
                                                 retval = _.symfunction('Si', [sym1.args[0]]);
                                             else if(sym1.fname === SIN && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected 'Si(x)' to equal '(1/4)*log(x)^4'.

[Killed] ArrayDeclaration
Calculus.js:1788:78
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
                                             else if(sym1.fname === SIN && sym1_is_linear && sym2.power.equals(-1))
-                                                retval = _.symfunction('Si', [sym1.args[0]]);
+                                                retval = _.symfunction('Si', []);
                                             else if(sym1.fname === SIN && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
killedBy: calculus should integrate properly
statusReason: Expected 'Si()' to equal 'Si(x)'.

[Killed] ConditionalExpression
Calculus.js:1789:53
                                             }
                                             else if(sym1.fname === SIN && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Si', [sym1.args[0]]);
-                                            else if(sym1.fname === SIN && sym2.power.equals(-1)) {
+                                            else if(false) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly

[Killed] BlockStatement
Calculus.js:1789:98
                                             }
                                             else if(sym1.fname === SIN && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Si', [sym1.args[0]]);
-                                            else if(sym1.fname === SIN && sym2.power.equals(-1)) {
-                                                retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
-                                            }
+                                            else if(sym1.fname === SIN && sym2.power.equals(-1)) {}
                                             else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Shi', [sym1.args[0]]);
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(sin(x)^3*x^(-1),x)' to equal '(-1/4)*Si(3*x)+(3/4)*Si(x)'.

[Killed] UnaryOperator
Calculus.js:1792:112
                                             else if(sym1.fname === SIN && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(-1))
+                                            else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(+1))
                                                 retval = _.symfunction('Shi', [sym1.args[0]]);
                                             else if(sym1.fname === SINH && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected 'Shi(x)' to equal '-sinh(x)+cosh(x)*x'.

[Killed] LogicalOperator
Calculus.js:1792:53
                                             else if(sym1.fname === SIN && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(-1))
+                                            else if(sym1.fname === SINH && sym1_is_linear || sym2.power.equals(-1))
                                                 retval = _.symfunction('Shi', [sym1.args[0]]);
                                             else if(sym1.fname === SINH && sym2.power.equals(-1)) {
killedBy: calculus should integrate properly
statusReason: Expected 'Shi(x)' to equal '-sinh(x)+cosh(x)*x'.

[NoCoverage] StringLiteral
Calculus.js:1793:72
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
                                             else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(-1))
-                                                retval = _.symfunction('Shi', [sym1.args[0]]);
+                                                retval = _.symfunction("", [sym1.args[0]]);
                                             else if(sym1.fname === SINH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);

[Killed] LogicalOperator
Calculus.js:1794:53
                                             }
                                             else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Shi', [sym1.args[0]]);
-                                            else if(sym1.fname === SINH && sym2.power.equals(-1)) {
+                                            else if(sym1.fname === SINH || sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly
statusReason: Expected '(1/2)*(-e^x+e^(-x)+e^(-x)*x+e^x*x)' to equal '-sinh(x)+cosh(x)*x'.

[Killed] ConditionalExpression
Calculus.js:1794:53
                                             }
                                             else if(sym1.fname === SINH && sym1_is_linear && sym2.power.equals(-1))
                                                 retval = _.symfunction('Shi', [sym1.args[0]]);
-                                            else if(sym1.fname === SINH && sym2.power.equals(-1)) {
+                                            else if(true) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(log(x)*x^3,x)' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.

[Killed] ConditionalExpression
Calculus.js:1797:53
                                             else if(sym1.fname === SINH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === LOG && sym2.power.equals(-1)) {
+                                            else if(true) {
                                                 //log(x)^n/x = log(x)^(n+1)/(n+1)
                                                 retval = __.integration.poly_integrate(sym1, dx, depth);
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected Infinity to equal -0.

[Killed] LogicalOperator
Calculus.js:1797:53
                                             else if(sym1.fname === SINH && sym2.power.equals(-1)) {
                                                 retval = __.integrate(_.multiply(sym1.fnTransform(), sym2.clone()), dx, depth);
                                             }
-                                            else if(sym1.fname === LOG && sym2.power.equals(-1)) {
+                                            else if(sym1.fname === LOG || sym2.power.equals(-1)) {
                                                 //log(x)^n/x = log(x)^(n+1)/(n+1)
                                                 retval = __.integration.poly_integrate(sym1, dx, depth);
killedBy: calculus should integrate properly
statusReason: Expected '(1/2)*log(x)^2' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.

[Killed] ConditionalExpression
Calculus.js:1801:53
                                                 //log(x)^n/x = log(x)^(n+1)/(n+1)
                                                 retval = __.integration.poly_integrate(sym1, dx, depth);
                                             }
-                                            else if(sym1.fname === 'erf') {
+                                            else if(true) {
                                                 if(sym2.power.equals(1)) {
                                                     var dc = __.integration.decompose_arg(sym1.args[0], dx),
killedBy: calculus should calculate the definite integral correctly
statusReason: Expected -Infinity to equal -0.

[Survived] ConditionalExpression
Calculus.js:1801:53
                                                 //log(x)^n/x = log(x)^(n+1)/(n+1)
                                                 retval = __.integration.poly_integrate(sym1, dx, depth);
                                             }
-                                            else if(sym1.fname === 'erf') {
+                                            else if(false) {
                                                 if(sym2.power.equals(1)) {
                                                     var dc = __.integration.decompose_arg(sym1.args[0], dx),

[NoCoverage] ConditionalExpression
Calculus.js:1802:52
                                                 retval = __.integration.poly_integrate(sym1, dx, depth);
                                             }
                                             else if(sym1.fname === 'erf') {
-                                                if(sym2.power.equals(1)) {
+                                                if(false) {
                                                     var dc = __.integration.decompose_arg(sym1.args[0], dx),
                                                             a_ = dc[0],

[NoCoverage] ConditionalExpression
Calculus.js:1802:52
                                                 retval = __.integration.poly_integrate(sym1, dx, depth);
                                             }
                                             else if(sym1.fname === 'erf') {
-                                                if(sym2.power.equals(1)) {
+                                                if(true) {
                                                     var dc = __.integration.decompose_arg(sym1.args[0], dx),
                                                             a_ = dc[0],

[Killed] BlockStatement
Calculus.js:1810:50
                                                 }
                                             }
-                                            else {
-                                                //since group S is guaranteed convergence we need not worry about tracking depth of integration
-                                                retval = __.integration.by_parts(symbol, dx, depth, opt);
-                                            }
+                                            else {}
                                         }
                                         else if(g1 === EX && g2 === S) {
killedBy: calculus should integrate properly
statusReason: Expected 'integrate(log(x)*x^3,x)' to equal '(-1/16)*x^4+(1/4)*log(x)*x^4'.
