[Killed] BlockStatement
Solve.js:1117:87
                     return [rhs, lhs];
                 }
             }
-            else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
-                if(rhs.multiplier.lessThan(0)) {
-                    rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
-                    lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
-                }
-                if(lhs.equals(0))
-                    return new Symbol(0);
-                else {
-                    var t = new Symbol(1);
-                    rhs.each(function (x) {
-                        if(x.contains(for_variable))
-                            t = _.multiply(t, x.clone());
-                        else
-                            lhs = _.divide(lhs, x.clone());
-                    });
-                    rhs = t;
-                    return __.rewrite(rhs, lhs, for_variable);
-
-                }
-            }
+            else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {}
             else if(!rhs.isLinear() && rhs.contains(for_variable)) {
                 var p = _.parse(rhs.power.clone().invert());
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1118:20
                 }
             }
             else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
-                if(rhs.multiplier.lessThan(0)) {
+                if(true) {
                     rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
                     lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1118:20
                 }
             }
             else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
-                if(rhs.multiplier.lessThan(0)) {
+                if(false) {
                     rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
                     lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] UnaryOperator
Solve.js:1119:76
             }
             else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
                 if(rhs.multiplier.lessThan(0)) {
-                    rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
+                    rhs.multiplier = rhs.multiplier.multiply(new core.Frac(+1));
                     lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
                 }

[NoCoverage] UnaryOperator
Solve.js:1120:76
             else if(rhs.group === CB && rhs.contains(for_variable) && rhs.isLinear()) {
                 if(rhs.multiplier.lessThan(0)) {
                     rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
-                    lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
+                    lhs.multiplier = lhs.multiplier.multiply(new core.Frac(+1));
                 }
                 if(lhs.equals(0))

[Killed] ConditionalExpression
Solve.js:1122:20
                     rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
                     lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
                 }
-                if(lhs.equals(0))
+                if(true)
                     return new Symbol(0);
                 else {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1/2)*sqrt(16+4*e^(4*a^(-1))),(-1/2)*sqrt(16+4*e^(4*a^(-1)))]'.

[Survived] ConditionalExpression
Solve.js:1122:20
                     rhs.multiplier = rhs.multiplier.multiply(new core.Frac(-1));
                     lhs.multiplier = lhs.multiplier.multiply(new core.Frac(-1));
                 }
-                if(lhs.equals(0))
+                if(false)
                     return new Symbol(0);
                 else {

[Killed] BlockStatement
Solve.js:1124:22
                 }
                 if(lhs.equals(0))
                     return new Symbol(0);
-                else {
-                    var t = new Symbol(1);
-                    rhs.each(function (x) {
-                        if(x.contains(for_variable))
-                            t = _.multiply(t, x.clone());
-                        else
-                            lhs = _.divide(lhs, x.clone());
-                    });
-                    rhs = t;
-                    return __.rewrite(rhs, lhs, for_variable);
-
-                }
+                else {}
             }
             else if(!rhs.isLinear() && rhs.contains(for_variable)) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1126:43
                     return new Symbol(0);
                 else {
                     var t = new Symbol(1);
-                    rhs.each(function (x) {
-                        if(x.contains(for_variable))
-                            t = _.multiply(t, x.clone());
-                        else
-                            lhs = _.divide(lhs, x.clone());
-                    });
+                    rhs.each(function (x) {});
                     rhs = t;
                     return __.rewrite(rhs, lhs, for_variable);
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1127:28
                 else {
                     var t = new Symbol(1);
                     rhs.each(function (x) {
-                        if(x.contains(for_variable))
+                        if(true)
                             t = _.multiply(t, x.clone());
                         else
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1127:28
                 else {
                     var t = new Symbol(1);
                     rhs.each(function (x) {
-                        if(x.contains(for_variable))
+                        if(false)
                             t = _.multiply(t, x.clone());
                         else
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1137:21
 
                 }
             }
-            else if(!rhs.isLinear() && rhs.contains(for_variable)) {
+            else if(false) {
                 var p = _.parse(rhs.power.clone().invert());
                 rhs = _.pow(rhs, p.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1137:68
 
                 }
             }
-            else if(!rhs.isLinear() && rhs.contains(for_variable)) {
-                var p = _.parse(rhs.power.clone().invert());
-                rhs = _.pow(rhs, p.clone());
-                lhs = _.pow(_.expand(lhs), p.clone());
-                return __.rewrite(rhs, lhs, for_variable);
-            }
+            else if(!rhs.isLinear() && rhs.contains(for_variable)) {}
             else if(rhs.group === FN || rhs.group === S || rhs.group === PL) {
                 return [rhs, lhs];
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] LogicalOperator
Solve.js:1143:21
                 lhs = _.pow(_.expand(lhs), p.clone());
                 return __.rewrite(rhs, lhs, for_variable);
             }
-            else if(rhs.group === FN || rhs.group === S || rhs.group === PL) {
+            else if((rhs.group === FN || rhs.group === S) && rhs.group === PL) {
                 return [rhs, lhs];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1143:21
                 lhs = _.pow(_.expand(lhs), p.clone());
                 return __.rewrite(rhs, lhs, for_variable);
             }
-            else if(rhs.group === FN || rhs.group === S || rhs.group === PL) {
+            else if(true) {
                 return [rhs, lhs];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1150:16
         sqrtSolve: function (symbol, v) {
             var sqrts = new Symbol(0);
             var rem = new Symbol(0);
-            if(symbol.isComposite()) {
+            if(true) {
                 symbol.each(function (x) {
                     if(x.fname === 'sqrt' && x.contains(v)) {
killedBy: Solve should solve correctly
statusReason: Expected '[((-214426147/209695794)*i+46234760/284516909)^2,((214426147/209695794)*i+46234760/284516909)^2,0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1150:16
         sqrtSolve: function (symbol, v) {
             var sqrts = new Symbol(0);
             var rem = new Symbol(0);
-            if(symbol.isComposite()) {
+            if(false) {
                 symbol.each(function (x) {
                     if(x.fname === 'sqrt' && x.contains(v)) {
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1151:42
             var sqrts = new Symbol(0);
             var rem = new Symbol(0);
             if(symbol.isComposite()) {
-                symbol.each(function (x) {
-                    if(x.fname === 'sqrt' && x.contains(v)) {
-                        sqrts = _.add(sqrts, x.clone());
-                    }
-                    else {
-                        rem = _.add(rem, x.clone());
-                    }
-                });
+                symbol.each(function (x) {});
                 //quick and dirty ATM
                 if(!sqrts.equals(0)) {
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1152:24
             var rem = new Symbol(0);
             if(symbol.isComposite()) {
                 symbol.each(function (x) {
-                    if(x.fname === 'sqrt' && x.contains(v)) {
+                    if(false) {
                         sqrts = _.add(sqrts, x.clone());
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1152:61
             var rem = new Symbol(0);
             if(symbol.isComposite()) {
                 symbol.each(function (x) {
-                    if(x.fname === 'sqrt' && x.contains(v)) {
-                        sqrts = _.add(sqrts, x.clone());
-                    }
+                    if(x.fname === 'sqrt' && x.contains(v)) {}
                     else {
                         rem = _.add(rem, x.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[0,1,832040/2178309]' to equal '[(-1/2)*sqrt(5)+3/2,0,1,832040/2178309]'.

[Killed] BlockStatement
Solve.js:1155:26
                     if(x.fname === 'sqrt' && x.contains(v)) {
                         sqrts = _.add(sqrts, x.clone());
                     }
-                    else {
-                        rem = _.add(rem, x.clone());
-                    }
+                    else {}
                 });
                 //quick and dirty ATM
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1160:20
                     }
                 });
                 //quick and dirty ATM
-                if(!sqrts.equals(0)) {
+                if(false) {
                     var t = _.expand(_.multiply(_.parse(symbol.multiplier), _.subtract(_.pow(rem, new Symbol(2)), _.pow(sqrts, new Symbol(2)))));
                     //square both sides
killedBy: Solve should solve correctly
statusReason: Expected '[0,1,832040/2178309]' to equal '[(-1/2)*sqrt(5)+3/2,0,1,832040/2178309]'.

[Killed] BlockStatement
Solve.js:1160:38
                     }
                 });
                 //quick and dirty ATM
-                if(!sqrts.equals(0)) {
-                    var t = _.expand(_.multiply(_.parse(symbol.multiplier), _.subtract(_.pow(rem, new Symbol(2)), _.pow(sqrts, new Symbol(2)))));
-                    //square both sides
-                    var solutions = solve(t, v);
-                    //test the points. The dumb way of getting the answers
-                    solutions = solutions.filter(function (e) {
-                        if(e.isImaginary())
-                            return e;
-                        var subs = {};
-                        subs[v] = e;
-                        var point = evaluate(symbol, subs);
-                        if(point.equals(0))
-                            return e;
-                    });
-                    return solutions;
-                }
+                if(!sqrts.equals(0)) {}
             }
         }
killedBy: Solve should solve correctly
statusReason: Expected '[0,1,832040/2178309]' to equal '[(-1/2)*sqrt(5)+3/2,0,1,832040/2178309]'.

[Killed] MethodExpression
Solve.js:1165:33
                     //square both sides
                     var solutions = solve(t, v);
                     //test the points. The dumb way of getting the answers
-                    solutions = solutions.filter(function (e) {
-                        if(e.isImaginary())
-                            return e;
-                        var subs = {};
-                        subs[v] = e;
-                        var point = evaluate(symbol, subs);
-                        if(point.equals(0))
-                            return e;
-                    });
+                    solutions = solutions;
                     return solutions;
                 }
killedBy: Solve should solve correctly
statusReason: Expected '[1519290839321567932824894124561/10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,0,78202389238903801/240831735646702201]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1165:63
                     //square both sides
                     var solutions = solve(t, v);
                     //test the points. The dumb way of getting the answers
-                    solutions = solutions.filter(function (e) {
-                        if(e.isImaginary())
-                            return e;
-                        var subs = {};
-                        subs[v] = e;
-                        var point = evaluate(symbol, subs);
-                        if(point.equals(0))
-                            return e;
-                    });
+                    solutions = solutions.filter(function (e) {});
                     return solutions;
                 }
killedBy: Solve should solve correctly
statusReason: Expected '[0,1,832040/2178309]' to equal '[(-1/2)*sqrt(5)+3/2,0,1,832040/2178309]'.

[Killed] ConditionalExpression
Solve.js:1166:28
                     var solutions = solve(t, v);
                     //test the points. The dumb way of getting the answers
                     solutions = solutions.filter(function (e) {
-                        if(e.isImaginary())
+                        if(true)
                             return e;
                         var subs = {};
killedBy: Solve should solve correctly
statusReason: Expected '[1519290839321567932824894124561/10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,0,78202389238903801/240831735646702201]' to equal '[0,78202389238903801/240831735646702201]'.

[Survived] ConditionalExpression
Solve.js:1166:28
                     var solutions = solve(t, v);
                     //test the points. The dumb way of getting the answers
                     solutions = solutions.filter(function (e) {
-                        if(e.isImaginary())
+                        if(false)
                             return e;
                         var subs = {};

[Killed] ConditionalExpression
Solve.js:1171:28
                         var subs = {};
                         subs[v] = e;
                         var point = evaluate(symbol, subs);
-                        if(point.equals(0))
+                        if(true)
                             return e;
                     });
killedBy: Solve should solve correctly
statusReason: Expected '[1519290839321567932824894124561/10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,0,78202389238903801/240831735646702201]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1171:28
                         var subs = {};
                         subs[v] = e;
                         var point = evaluate(symbol, subs);
-                        if(point.equals(0))
+                        if(false)
                             return e;
                     });
killedBy: Solve should solve correctly
statusReason: Expected '[0,1,832040/2178309]' to equal '[(-1/2)*sqrt(5)+3/2,0,1,832040/2178309]'.

[Survived] LogicalOperator
Solve.js:1190:17
      * @returns {Array}
      */
     var solve = function (eqns, solve_for, solutions, depth, fn) {
-        depth = depth || 0;
+        depth = depth && 0;
 
         if(depth++ > Settings.MAX_SOLVE_DEPTH) {

[Survived] ConditionalExpression
Solve.js:1190:17
      * @returns {Array}
      */
     var solve = function (eqns, solve_for, solutions, depth, fn) {
-        depth = depth || 0;
+        depth = false;
 
         if(depth++ > Settings.MAX_SOLVE_DEPTH) {

[Killed] ConditionalExpression
Solve.js:1192:12
     var solve = function (eqns, solve_for, solutions, depth, fn) {
         depth = depth || 0;
 
-        if(depth++ > Settings.MAX_SOLVE_DEPTH) {
+        if(true) {
             return solutions;
         }
killedBy: Solve should solve correctly
statusReason: Expected '' to equal '[(1073228064103962/314146179365)*x]'.

[Survived] UpdateOperator
Solve.js:1192:12
     var solve = function (eqns, solve_for, solutions, depth, fn) {
         depth = depth || 0;
 
-        if(depth++ > Settings.MAX_SOLVE_DEPTH) {
+        if(depth-- > Settings.MAX_SOLVE_DEPTH) {
             return solutions;
         }

[Killed] ConditionalExpression
Solve.js:1197:12
         }
 
         //make preparations if it's an Equation
-        if(eqns instanceof Equation) {
+        if(true) {
             //if it's zero then we're done
             if(eqns.isZero()) {
killedBy: Solve should solve correctly
statusReason: ParseError: eqns.isZero is not a function: 1

[Survived] ConditionalExpression
Solve.js:1197:12
         }
 
         //make preparations if it's an Equation
-        if(eqns instanceof Equation) {
+        if(false) {
             //if it's zero then we're done
             if(eqns.isZero()) {

[Killed] ConditionalExpression
Solve.js:1199:16
         //make preparations if it's an Equation
         if(eqns instanceof Equation) {
             //if it's zero then we're done
-            if(eqns.isZero()) {
+            if(true) {
                 return [new Symbol(0)];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[NoCoverage] BlockStatement
Solve.js:1199:31
         //make preparations if it's an Equation
         if(eqns instanceof Equation) {
             //if it's zero then we're done
-            if(eqns.isZero()) {
-                return [new Symbol(0)];
-            }
+            if(eqns.isZero()) {}
             //if the lhs = x then we're done
             if(eqns.LHS.equals(solve_for) && !eqns.RHS.contains(solve_for)) {

[NoCoverage] ArrayDeclaration
Solve.js:1200:24
         if(eqns instanceof Equation) {
             //if it's zero then we're done
             if(eqns.isZero()) {
-                return [new Symbol(0)];
+                return [];
             }
             //if the lhs = x then we're done

[Killed] BooleanLiteral
Solve.js:1203:46
                 return [new Symbol(0)];
             }
             //if the lhs = x then we're done
-            if(eqns.LHS.equals(solve_for) && !eqns.RHS.contains(solve_for)) {
+            if(eqns.LHS.equals(solve_for) && eqns.RHS.contains(solve_for)) {
                 return [eqns.RHS];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[2*(-x+3)^(-1)]' to equal '[1,2]'.

[Killed] ConditionalExpression
Solve.js:1203:16
                 return [new Symbol(0)];
             }
             //if the lhs = x then we're done
-            if(eqns.LHS.equals(solve_for) && !eqns.RHS.contains(solve_for)) {
+            if(true) {
                 return [eqns.RHS];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[(314146179365/1073228064103962)*y]' to equal '[(1073228064103962/314146179365)*x]'.

[NoCoverage] ArrayDeclaration
Solve.js:1204:24
             }
             //if the lhs = x then we're done
             if(eqns.LHS.equals(solve_for) && !eqns.RHS.contains(solve_for)) {
-                return [eqns.RHS];
+                return [];
             }
             //if the rhs = x then we're done

[Killed] ConditionalExpression
Solve.js:1207:16
                 return [eqns.RHS];
             }
             //if the rhs = x then we're done
-            if(eqns.RHS.equals(solve_for) && !eqns.LHS.contains(solve_for)) {
+            if(true) {
                 return [eqns.LHS];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[x]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] LogicalOperator
Solve.js:1207:16
                 return [eqns.RHS];
             }
             //if the rhs = x then we're done
-            if(eqns.RHS.equals(solve_for) && !eqns.LHS.contains(solve_for)) {
+            if(eqns.RHS.equals(solve_for) || !eqns.LHS.contains(solve_for)) {
                 return [eqns.LHS];
             }
killedBy: Solve should solve correctly
statusReason: Expected '[x]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1213:12
         }
 
         //unwrap the vector since what we want are the elements
-        if(eqns instanceof core.Vector)
+        if(true)
             eqns = eqns.elements;
         solve_for = solve_for || 'x'; //assumes x by default
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'group' of undefined: 1

[Survived] ConditionalExpression
Solve.js:1213:12
         }
 
         //unwrap the vector since what we want are the elements
-        if(eqns instanceof core.Vector)
+        if(false)
             eqns = eqns.elements;
         solve_for = solve_for || 'x'; //assumes x by default

[Killed] ConditionalExpression
Solve.js:1215:21
         //unwrap the vector since what we want are the elements
         if(eqns instanceof core.Vector)
             eqns = eqns.elements;
-        solve_for = solve_for || 'x'; //assumes x by default
+        solve_for = false; //assumes x by default
         //If it's an array then solve it as a system of equations
         if(isArray(eqns)) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1215:21
         //unwrap the vector since what we want are the elements
         if(eqns instanceof core.Vector)
             eqns = eqns.elements;
-        solve_for = solve_for || 'x'; //assumes x by default
+        solve_for = true; //assumes x by default
         //If it's an array then solve it as a system of equations
         if(isArray(eqns)) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1217:12
             eqns = eqns.elements;
         solve_for = solve_for || 'x'; //assumes x by default
         //If it's an array then solve it as a system of equations
-        if(isArray(eqns)) {
+        if(false) {
             return __.solveSystem.apply(undefined, arguments);
         }
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: eqn.split is not a function

[Killed] BlockStatement
Solve.js:1217:27
             eqns = eqns.elements;
         solve_for = solve_for || 'x'; //assumes x by default
         //If it's an array then solve it as a system of equations
-        if(isArray(eqns)) {
-            return __.solveSystem.apply(undefined, arguments);
-        }
+        if(isArray(eqns)) {}
 
         // Parse out functions. Fix for issue #300
killedBy: Solve should solve system of equations correctly
statusReason: TypeError: eqn.split is not a function

[Killed] LogicalOperator
Solve.js:1223:21
 
         // Parse out functions. Fix for issue #300
         // eqns = core.Utils.evaluate(eqns);
-        solutions = solutions || [];
+        solutions = solutions && [];
         //mark existing solutions as not to have duplicates
         var existing = {};
killedBy: Solve should solve correctly
statusReason: Expected '' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1223:21
 
         // Parse out functions. Fix for issue #300
         // eqns = core.Utils.evaluate(eqns);
-        solutions = solutions || [];
+        solutions = true;
         //mark existing solutions as not to have duplicates
         var existing = {};
killedBy: Solve should solve correctly
statusReason: Expected '' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1231:12
         // the we're done. Issue #555
         var known = {};
         known[solve_for] = 0;
-        if(isSymbol(eqns) && evaluate(eqns.getDenom(), known).equals(0) === true) {
+        if(true) {
             return solutions;
         }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1231:30
         // the we're done. Issue #555
         var known = {};
         known[solve_for] = 0;
-        if(isSymbol(eqns) && evaluate(eqns.getDenom(), known).equals(0) === true) {
+        if(isSymbol(eqns) && true) {
             return solutions;
         }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0]'.

[Killed] LogicalOperator
Solve.js:1239:16
         // TODO: Set is now implemented and should be utilized
         var add_to_result = function (r, has_trig) {
             var r_is_symbol = isSymbol(r);
-            if(r === undefined || typeof r === 'number' && isNaN(r))
+            if(r === undefined && typeof r === 'number' && isNaN(r))
                 return;
             if(isArray(r)) {
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'valueOf' of undefined: 1

[Killed] LogicalOperator
Solve.js:1239:35
         // TODO: Set is now implemented and should be utilized
         var add_to_result = function (r, has_trig) {
             var r_is_symbol = isSymbol(r);
-            if(r === undefined || typeof r === 'number' && isNaN(r))
+            if(r === undefined || typeof r === 'number' || isNaN(r))
                 return;
             if(isArray(r)) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] BlockStatement
Solve.js:1241:28
             var r_is_symbol = isSymbol(r);
             if(r === undefined || typeof r === 'number' && isNaN(r))
                 return;
-            if(isArray(r)) {
-                r.forEach(function (sol) {
-                    add_to_result(sol);
-                });
-            }
+            if(isArray(r)) {}
             else {
                 if(r.valueOf() !== 'null') {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.
