[Killed] ConditionalExpression
Solve.js:1241:16
             var r_is_symbol = isSymbol(r);
             if(r === undefined || typeof r === 'number' && isNaN(r))
                 return;
-            if(isArray(r)) {
+            if(false) {
                 r.forEach(function (sol) {
                     add_to_result(sol);
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] BlockStatement
Solve.js:1242:42
             if(r === undefined || typeof r === 'number' && isNaN(r))
                 return;
             if(isArray(r)) {
-                r.forEach(function (sol) {
-                    add_to_result(sol);
-                });
+                r.forEach(function (sol) {});
             }
             else {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] ConditionalExpression
Solve.js:1247:20
                 });
             }
             else {
-                if(r.valueOf() !== 'null') {
+                if(false) {
                     // Call the pre-add function if defined. This could be useful for rounding
                     if(typeof core.Settings.PRE_ADD_SOLUTION === 'function') {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Survived] ConditionalExpression
Solve.js:1247:20
                 });
             }
             else {
-                if(r.valueOf() !== 'null') {
+                if(true) {
                     // Call the pre-add function if defined. This could be useful for rounding
                     if(typeof core.Settings.PRE_ADD_SOLUTION === 'function') {

[Killed] ConditionalExpression
Solve.js:1249:24
             else {
                 if(r.valueOf() !== 'null') {
                     // Call the pre-add function if defined. This could be useful for rounding
-                    if(typeof core.Settings.PRE_ADD_SOLUTION === 'function') {
+                    if(true) {
                         r = core.Settings.PRE_ADD_SOLUTION(r);
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Survived] ConditionalExpression
Solve.js:1249:24
             else {
                 if(r.valueOf() !== 'null') {
                     // Call the pre-add function if defined. This could be useful for rounding
-                    if(typeof core.Settings.PRE_ADD_SOLUTION === 'function') {
+                    if(false) {
                         r = core.Settings.PRE_ADD_SOLUTION(r);
                     }

[Killed] BooleanLiteral
Solve.js:1253:24
                         r = core.Settings.PRE_ADD_SOLUTION(r);
                     }
 
-                    if(!r_is_symbol) {
+                    if(r_is_symbol) {
                         r = _.parse(r);
                     }
killedBy: Solve should solve correctly
statusReason: ParseError: e.isImaginary is not a function: 1

[Killed] ConditionalExpression
Solve.js:1253:24
                         r = core.Settings.PRE_ADD_SOLUTION(r);
                     }
 
-                    if(!r_is_symbol) {
+                    if(false) {
                         r = _.parse(r);
                     }
killedBy: Solve should solve correctly
statusReason: ParseError: e.isImaginary is not a function: 1

[Killed] ConditionalExpression
Solve.js:1257:24
                         r = _.parse(r);
                     }
                     // try to convert the number to multiples of pi
-                    if(core.Settings.make_pi_conversions && has_trig) {
+                    if(true) {
                         var temp = _.divide(r.clone(), new Symbol(Math.PI)),
                                 m = temp.multiplier,
killedBy: Solve should solve correctly
statusReason: Expected '[-1,((78256779/245850922)*i+78256779/245850922)*pi,((-78256779/245850922)*i+78256779/245850922)*pi]' to equal '[-1,1+i,-i+1]'.

[NoCoverage] BlockStatement
Solve.js:1257:71
                         r = _.parse(r);
                     }
                     // try to convert the number to multiples of pi
-                    if(core.Settings.make_pi_conversions && has_trig) {
-                        var temp = _.divide(r.clone(), new Symbol(Math.PI)),
-                                m = temp.multiplier,
-                                a = Math.abs(m.num),
-                                b = Math.abs(m.den);
-                        if(a < 10 && b < 10)
-                            r = _.multiply(temp, new Symbol('pi'));
-                    }
+                    if(core.Settings.make_pi_conversions && has_trig) {}
 
                     // And check if we get a number otherwise we might be throwing out symbolic solutions.

[NoCoverage] ConditionalExpression
Solve.js:1262:28
                                 m = temp.multiplier,
                                 a = Math.abs(m.num),
                                 b = Math.abs(m.den);
-                        if(a < 10 && b < 10)
+                        if(true)
                             r = _.multiply(temp, new Symbol('pi'));
                     }

[NoCoverage] ConditionalExpression
Solve.js:1262:28
                                 m = temp.multiplier,
                                 a = Math.abs(m.num),
                                 b = Math.abs(m.den);
-                        if(a < 10 && b < 10)
+                        if(true && b < 10)
                             r = _.multiply(temp, new Symbol('pi'));
                     }

[Killed] BooleanLiteral
Solve.js:1269:24
                     // And check if we get a number otherwise we might be throwing out symbolic solutions.
                     var r_str = r.toString();
 
-                    if(!existing[r_str]) {
+                    if(existing[r_str]) {
                         solutions.push(r);
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1269:24
                     // And check if we get a number otherwise we might be throwing out symbolic solutions.
                     var r_str = r.toString();
 
-                    if(!existing[r_str]) {
+                    if(true) {
                         solutions.push(r);
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[-1,-1]' to equal '[-1]'.

[Killed] BooleanLiteral
Solve.js:1273:39
                         solutions.push(r);
                     }
                     // Mark the answer as seen
-                    existing[r_str] = true;
+                    existing[r_str] = false;
                 }
             }
killedBy: Solve should solve correctly
statusReason: Expected '[-1,-1]' to equal '[-1]'.

[Killed] ConditionalExpression
Solve.js:1280:12
 
         // Maybe we get lucky. Try the point at the function. If it works we have a point
         // If not it failed
-        if(eqns.group === S && eqns.contains(solve_for)) {
+        if(true) {
             try {
                 var o = {};
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1280:12
 
         // Maybe we get lucky. Try the point at the function. If it works we have a point
         // If not it failed
-        if(eqns.group === S && eqns.contains(solve_for)) {
+        if(true && eqns.contains(solve_for)) {
             try {
                 var o = {};
killedBy: Solve should solve correctly
statusReason: ParseError: eqns.contains is not a function: 1

[Killed] BlockStatement
Solve.js:1281:17
         // Maybe we get lucky. Try the point at the function. If it works we have a point
         // If not it failed
         if(eqns.group === S && eqns.contains(solve_for)) {
-            try {
-                var o = {};
-                o[solve_for] = 0;
-                evaluate(fn, o, 'numer');
-                add_to_result(new Symbol(0));
-            }
+            try {}
             catch(e) {
                 // Do nothing;
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0]'.

[Survived] StringLiteral
Solve.js:1284:33
             try {
                 var o = {};
                 o[solve_for] = 0;
-                evaluate(fn, o, 'numer');
+                evaluate(fn, o, "");
                 add_to_result(new Symbol(0));
             }

[Killed] ConditionalExpression
Solve.js:1293:12
 
             return solutions;
         }
-        if(eqns.group === CB) {
+        if(true) {
             // It suffices to solve for the numerator
             var num = eqns.getNum();
killedBy: Solve should solve correctly
statusReason: ParseError: eqns.getNum is not a function: 1

[Killed] BlockStatement
Solve.js:1293:31
 
             return solutions;
         }
-        if(eqns.group === CB) {
-            // It suffices to solve for the numerator
-            var num = eqns.getNum();
-
-            if(num.group === CB) {
-                var sf = String(solve_for); //everything else belongs to the coeff
-                //get the denominator and make sure it doesn't have x since we don't know how to solve for those
-                num.each(function (x) {
-                    if(x.contains(sf))
-                        solve(x, solve_for, solutions, depth, eqns);
-                });
-
-                return solutions;
-            }
-
-            return solve(num, solve_for, solutions, depth, fn);
-        }
+        if(eqns.group === CB) {}
 
         if(eqns.group === FN && eqns.fname === 'sqrt') {
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[-5,4]'.

[Killed] ConditionalExpression
Solve.js:1297:16
             // It suffices to solve for the numerator
             var num = eqns.getNum();
 
-            if(num.group === CB) {
+            if(false) {
                 var sf = String(solve_for); //everything else belongs to the coeff
                 //get the denominator and make sure it doesn't have x since we don't know how to solve for those
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-5,4]'.

[Killed] BlockStatement
Solve.js:1297:34
             // It suffices to solve for the numerator
             var num = eqns.getNum();
 
-            if(num.group === CB) {
-                var sf = String(solve_for); //everything else belongs to the coeff
-                //get the denominator and make sure it doesn't have x since we don't know how to solve for those
-                num.each(function (x) {
-                    if(x.contains(sf))
-                        solve(x, solve_for, solutions, depth, eqns);
-                });
-
-                return solutions;
-            }
+            if(num.group === CB) {}
 
             return solve(num, solve_for, solutions, depth, fn);
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-5,4]'.

[Killed] BlockStatement
Solve.js:1300:39
             if(num.group === CB) {
                 var sf = String(solve_for); //everything else belongs to the coeff
                 //get the denominator and make sure it doesn't have x since we don't know how to solve for those
-                num.each(function (x) {
-                    if(x.contains(sf))
-                        solve(x, solve_for, solutions, depth, eqns);
-                });
+                num.each(function (x) {});
 
                 return solutions;
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-5,4]'.

[Killed] ConditionalExpression
Solve.js:1301:24
                 var sf = String(solve_for); //everything else belongs to the coeff
                 //get the denominator and make sure it doesn't have x since we don't know how to solve for those
                 num.each(function (x) {
-                    if(x.contains(sf))
+                    if(false)
                         solve(x, solve_for, solutions, depth, eqns);
                 });
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-5,4]'.

[Survived] ConditionalExpression
Solve.js:1301:24
                 var sf = String(solve_for); //everything else belongs to the coeff
                 //get the denominator and make sure it doesn't have x since we don't know how to solve for those
                 num.each(function (x) {
-                    if(x.contains(sf))
+                    if(true)
                         solve(x, solve_for, solutions, depth, eqns);
                 });

[Killed] BlockStatement
Solve.js:1311:56
             return solve(num, solve_for, solutions, depth, fn);
         }
 
-        if(eqns.group === FN && eqns.fname === 'sqrt') {
-            eqns = _.pow(Symbol.unwrapSQRT(eqns), new Symbol(2));
-        }
+        if(eqns.group === FN && eqns.fname === 'sqrt') {}
         //pass in false to not expand equations such as (x+y)^5.
         //It suffices to solve for the numerator since there's no value in the denominator which yields a zero for the function
killedBy: Solve should solve correctly
statusReason: Expected '[-1,1]' to equal '[1,-1]'.

[Killed] ConditionalExpression
Solve.js:1311:12
             return solve(num, solve_for, solutions, depth, fn);
         }
 
-        if(eqns.group === FN && eqns.fname === 'sqrt') {
+        if(false) {
             eqns = _.pow(Symbol.unwrapSQRT(eqns), new Symbol(2));
         }
killedBy: Solve should solve correctly
statusReason: Expected '[-1,1]' to equal '[1,-1]'.

[Survived] BooleanLiteral
Solve.js:1316:69
         }
         //pass in false to not expand equations such as (x+y)^5.
         //It suffices to solve for the numerator since there's no value in the denominator which yields a zero for the function
-        var eq = (core.Utils.isSymbol(eqns) ? eqns : __.toLHS(eqns, false)).getNum(),
+        var eq = (core.Utils.isSymbol(eqns) ? eqns : __.toLHS(eqns, true)).getNum(),
                 vars = core.Utils.variables(eq), //get a list of all the variables
                 numvars = vars.length;//how many variables are we dealing with

[Killed] ConditionalExpression
Solve.js:1321:12
                 numvars = vars.length;//how many variables are we dealing with
 
         //it sufficient to solve (x+y) if eq is (x+y)^n since 0^n
-        if(core.Utils.isInt(eq.power) && eq.power > 0) {
+        if(false) {
             eq = _.parse(eq).toLinear();
         }
killedBy: Solve should solve correctly
statusReason: Expected '[-17537381726529/1753738172653,-922112945819/92211294582,-930034616581/93003461658,-7358822920549/735882292055,(39/92533609)*i-9911090729241/991109072924,(-39/92533609)*i-9911090729241/991109072924,(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.

[Killed] BlockStatement
Solve.js:1321:56
                 numvars = vars.length;//how many variables are we dealing with
 
         //it sufficient to solve (x+y) if eq is (x+y)^n since 0^n
-        if(core.Utils.isInt(eq.power) && eq.power > 0) {
-            eq = _.parse(eq).toLinear();
-        }
+        if(core.Utils.isInt(eq.power) && eq.power > 0) {}
 
         //if we're dealing with a single variable then we first check if it's a 
killedBy: Solve should solve correctly
statusReason: Expected '[-17537381726529/1753738172653,-922112945819/92211294582,-930034616581/93003461658,-7358822920549/735882292055,(39/92533609)*i-9911090729241/991109072924,(-39/92533609)*i-9911090729241/991109072924,(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.

[Killed] ConditionalExpression
Solve.js:1328:30
         //if we're dealing with a single variable then we first check if it's a 
         //polynomial (including rationals).If it is then we use the Jenkins-Traubb algorithm.     
         //Don't waste time
-        if(eq.group === S || eq.group === CB && eq.contains(solve_for)) {
+        if(eq.group === S || true && eq.contains(solve_for)) {
             return [new Symbol(0)];
         }
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] LogicalOperator
Solve.js:1328:30
         //if we're dealing with a single variable then we first check if it's a 
         //polynomial (including rationals).If it is then we use the Jenkins-Traubb algorithm.     
         //Don't waste time
-        if(eq.group === S || eq.group === CB && eq.contains(solve_for)) {
+        if(eq.group === S || eq.group === CB || eq.contains(solve_for)) {
             return [new Symbol(0)];
         }
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ObjectLiteral
Solve.js:1338:39
                 cfact;
 
         var correct_denom = function (symbol) {
-            symbol = _.expand(symbol, {
-                expand_denominator: true,
-                expand_functions: true
-            });
+            symbol = _.expand(symbol, {});
             var original = symbol.clone(); //preserve the original
 
killedBy: Solve should solve correctly
statusReason: Expected '[(1/2)*sqrt(10)-10,(-1/2)*sqrt(10)-10]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.

[Killed] BooleanLiteral
Solve.js:1339:37
 
         var correct_denom = function (symbol) {
             symbol = _.expand(symbol, {
-                expand_denominator: true,
+                expand_denominator: false,
                 expand_functions: true
             });
killedBy: Solve should solve correctly
statusReason: Expected '[(1/2)*sqrt(10)-10,(-1/2)*sqrt(10)-10]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.

[Survived] BooleanLiteral
Solve.js:1340:35
         var correct_denom = function (symbol) {
             symbol = _.expand(symbol, {
                 expand_denominator: true,
-                expand_functions: true
+                expand_functions: false
             });
             var original = symbol.clone(); //preserve the original

[Killed] ConditionalExpression
Solve.js:1344:16
             });
             var original = symbol.clone(); //preserve the original
 
-            if(symbol.symbols) {
+            if(false) {
                 for(var x in symbol.symbols) {
                     var sym = symbol.symbols[x];
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Survived] ConditionalExpression
Solve.js:1344:16
             });
             var original = symbol.clone(); //preserve the original
 
-            if(symbol.symbols) {
+            if(true) {
                 for(var x in symbol.symbols) {
                     var sym = symbol.symbols[x];

[Killed] BooleanLiteral
Solve.js:1351:24
                     //get the denominator of the sub-symbol
                     var den = sym.getDenom();
 
-                    if(!den.isConstant(true) && symbol.isComposite()) {
+                    if(den.isConstant(true) && symbol.isComposite()) {
                         var t = new Symbol(0);
                         symbol.each(function (e) {
killedBy: Solve should solve correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Killed] LogicalOperator
Solve.js:1351:24
                     //get the denominator of the sub-symbol
                     var den = sym.getDenom();
 
-                    if(!den.isConstant(true) && symbol.isComposite()) {
+                    if(!den.isConstant(true) || symbol.isComposite()) {
                         var t = new Symbol(0);
                         symbol.each(function (e) {
killedBy: Solve should solve correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Killed] BlockStatement
Solve.js:1353:50
 
                     if(!den.isConstant(true) && symbol.isComposite()) {
                         var t = new Symbol(0);
-                        symbol.each(function (e) {
-                            t = _.add(t, _.multiply(e, den.clone()));
-                        });
+                        symbol.each(function (e) {});
 
                         return correct_denom(_.multiply(_.parse(symbol.multiplier), t));
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[1,2]'.

[Killed] ConditionalExpression
Solve.js:1361:35
                     }
 
                     var parts = explode(sym, solve_for);
-                    var is_sqrt = parts[1].fname === core.Settings.SQRT;
+                    var is_sqrt = false;
                     var v = Symbol.unwrapSQRT(parts[1]);
                     var p = v.power.clone();
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1361:35
                     }
 
                     var parts = explode(sym, solve_for);
-                    var is_sqrt = parts[1].fname === core.Settings.SQRT;
+                    var is_sqrt = true;
                     var v = Symbol.unwrapSQRT(parts[1]);
                     var p = v.power.clone();
killedBy: Solve should solve correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Killed] BooleanLiteral
Solve.js:1366:24
                     var p = v.power.clone();
                     //circular logic with sqrt. Since sqrt(x) becomes x^(1/2) which then becomes sqrt(x), this continues forever
                     //this needs to be terminated if p = 1/2
-                    if(!isSymbol(p) && !p.equals(1 / 2)) {
+                    if(isSymbol(p) && !p.equals(1 / 2)) {
                         if(p.den.gt(1)) {
                             if(is_sqrt) {
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'gt' of undefined: 1

[Killed] LogicalOperator
Solve.js:1366:24
                     var p = v.power.clone();
                     //circular logic with sqrt. Since sqrt(x) becomes x^(1/2) which then becomes sqrt(x), this continues forever
                     //this needs to be terminated if p = 1/2
-                    if(!isSymbol(p) && !p.equals(1 / 2)) {
+                    if(!isSymbol(p) || !p.equals(1 / 2)) {
                         if(p.den.gt(1)) {
                             if(is_sqrt) {
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot read property 'gt' of undefined: 1

[Killed] BlockStatement
Solve.js:1367:41
                     //circular logic with sqrt. Since sqrt(x) becomes x^(1/2) which then becomes sqrt(x), this continues forever
                     //this needs to be terminated if p = 1/2
                     if(!isSymbol(p) && !p.equals(1 / 2)) {
-                        if(p.den.gt(1)) {
-                            if(is_sqrt) {
-                                symbol = _.subtract(symbol, sym.clone());
-                                symbol = _.add(symbol, _.multiply(parts[0].clone(), v));
-                                return correct_denom(symbol);
-                            }
-                            var c = fractionals[p.den];
-                            fractionals[p.den] = c ? c++ : 1;
-                        }
+                        if(p.den.gt(1)) {}
                         else if(p.sign() === -1) {
                             var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1367:28
                     //circular logic with sqrt. Since sqrt(x) becomes x^(1/2) which then becomes sqrt(x), this continues forever
                     //this needs to be terminated if p = 1/2
                     if(!isSymbol(p) && !p.equals(1 / 2)) {
-                        if(p.den.gt(1)) {
+                        if(false) {
                             if(is_sqrt) {
                                 symbol = _.subtract(symbol, sym.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1368:32
                     //this needs to be terminated if p = 1/2
                     if(!isSymbol(p) && !p.equals(1 / 2)) {
                         if(p.den.gt(1)) {
-                            if(is_sqrt) {
+                            if(false) {
                                 symbol = _.subtract(symbol, sym.clone());
                                 symbol = _.add(symbol, _.multiply(parts[0].clone(), v));
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1368:41
                     //this needs to be terminated if p = 1/2
                     if(!isSymbol(p) && !p.equals(1 / 2)) {
                         if(p.den.gt(1)) {
-                            if(is_sqrt) {
-                                symbol = _.subtract(symbol, sym.clone());
-                                symbol = _.add(symbol, _.multiply(parts[0].clone(), v));
-                                return correct_denom(symbol);
-                            }
+                            if(is_sqrt) {}
                             var c = fractionals[p.den];
                             fractionals[p.den] = c ? c++ : 1;
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[NoCoverage] UpdateOperator
Solve.js:1374:54
                                 return correct_denom(symbol);
                             }
                             var c = fractionals[p.den];
-                            fractionals[p.den] = c ? c++ : 1;
+                            fractionals[p.den] = c ? c-- : 1;
                         }
                         else if(p.sign() === -1) {

[Killed] UnaryOperator
Solve.js:1376:46
                             var c = fractionals[p.den];
                             fractionals[p.den] = c ? c++ : 1;
                         }
-                        else if(p.sign() === -1) {
+                        else if(p.sign() === +1) {
                             var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
                             //unwrap the symbol's denoniator
killedBy: Solve should solve correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[Killed] ConditionalExpression
Solve.js:1376:33
                             var c = fractionals[p.den];
                             fractionals[p.den] = c ? c++ : 1;
                         }
-                        else if(p.sign() === -1) {
+                        else if(true) {
                             var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
                             //unwrap the symbol's denoniator
killedBy: Solve should solve correctly
statusReason: ParseError: Maximum call stack size exceeded: 1

[NoCoverage] StringLiteral
Solve.js:1377:62
                             fractionals[p.den] = c ? c++ : 1;
                         }
                         else if(p.sign() === -1) {
-                            var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
+                            var factor = _.parse(solve_for + "" + Math.abs(p)); //this
                             //unwrap the symbol's denoniator
                             symbol.each(function (y, index) {

[NoCoverage] BlockStatement
Solve.js:1379:61
                         else if(p.sign() === -1) {
                             var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
                             //unwrap the symbol's denoniator
-                            symbol.each(function (y, index) {
-                                if(y.contains(solve_for)) {
-                                    symbol.symbols[index] = _.multiply(y, factor.clone());
-                                }
-                            });
+                            symbol.each(function (y, index) {});
                             fractionals = {};
                             return correct_denom(_.parse(symbol));

[NoCoverage] ConditionalExpression
Solve.js:1380:36
                             var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
                             //unwrap the symbol's denoniator
                             symbol.each(function (y, index) {
-                                if(y.contains(solve_for)) {
+                                if(false) {
                                     symbol.symbols[index] = _.multiply(y, factor.clone());
                                 }

[NoCoverage] BlockStatement
Solve.js:1380:59
                             var factor = _.parse(solve_for + '^' + Math.abs(p)); //this
                             //unwrap the symbol's denoniator
                             symbol.each(function (y, index) {
-                                if(y.contains(solve_for)) {
-                                    symbol.symbols[index] = _.multiply(y, factor.clone());
-                                }
+                                if(y.contains(solve_for)) {}
                             });
                             fractionals = {};
