[Killed] ConditionalExpression
Solve.js:1387:33
                             fractionals = {};
                             return correct_denom(_.parse(symbol));
                         }
-                        else if(sym.group === PL) {
+                        else if(true) {
                             var min_p = core.Utils.arrayMin(core.Utils.keys(sym.symbols));
                             if(min_p < 0) {
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot convert undefined or null to object: 1

[Survived] ConditionalExpression
Solve.js:1387:33
                             fractionals = {};
                             return correct_denom(_.parse(symbol));
                         }
-                        else if(sym.group === PL) {
+                        else if(false) {
                             var min_p = core.Utils.arrayMin(core.Utils.keys(sym.symbols));
                             if(min_p < 0) {

[Killed] ConditionalExpression
Solve.js:1389:32
                         }
                         else if(sym.group === PL) {
                             var min_p = core.Utils.arrayMin(core.Utils.keys(sym.symbols));
-                            if(min_p < 0) {
+                            if(true) {
                                 var factor = _.parse(solve_for + '^' + Math.abs(min_p));
                                 var corrected = new Symbol(0);
killedBy: Solve should solve correctly
statusReason: Expected '[0,-1]' to equal '[-1]'.

[Survived] ConditionalExpression
Solve.js:1389:32
                         }
                         else if(sym.group === PL) {
                             var min_p = core.Utils.arrayMin(core.Utils.keys(sym.symbols));
-                            if(min_p < 0) {
+                            if(false) {
                                 var factor = _.parse(solve_for + '^' + Math.abs(min_p));
                                 var corrected = new Symbol(0);

[NoCoverage] StringLiteral
Solve.js:1390:66
                         else if(sym.group === PL) {
                             var min_p = core.Utils.arrayMin(core.Utils.keys(sym.symbols));
                             if(min_p < 0) {
-                                var factor = _.parse(solve_for + '^' + Math.abs(min_p));
+                                var factor = _.parse(solve_for + "" + Math.abs(min_p));
                                 var corrected = new Symbol(0);
                                 original.each(function (x) {

[NoCoverage] BlockStatement
Solve.js:1392:60
                             if(min_p < 0) {
                                 var factor = _.parse(solve_for + '^' + Math.abs(min_p));
                                 var corrected = new Symbol(0);
-                                original.each(function (x) {
-                                    corrected = _.add(corrected, _.multiply(x.clone(), factor.clone()));
-                                }, true);
+                                original.each(function (x) {}, true);
                                 return corrected;
                             }

[NoCoverage] BooleanLiteral
Solve.js:1394:36
                                 var corrected = new Symbol(0);
                                 original.each(function (x) {
                                     corrected = _.add(corrected, _.multiply(x.clone(), factor.clone()));
-                                }, true);
+                                }, false);
                                 return corrected;
                             }

[Killed] BlockStatement
Solve.js:1407:38
 
 
         //separate the equation
-        var separate = function (eq) {
-            var lhs = new Symbol(0),
-                    rhs = new Symbol(0);
-            eq.each(function (x) {
-                if(x.contains(solve_for, true))
-                    lhs = _.add(lhs, x.clone());
-                else
-                    rhs = _.subtract(rhs, x.clone());
-            });
-            return [lhs, rhs];
-        };
+        var separate = function (eq) {};
 
         __.inverseFunctionSolve = function (name, lhs, rhs) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] BlockStatement
Solve.js:1410:34
         var separate = function (eq) {
             var lhs = new Symbol(0),
                     rhs = new Symbol(0);
-            eq.each(function (x) {
-                if(x.contains(solve_for, true))
-                    lhs = _.add(lhs, x.clone());
-                else
-                    rhs = _.subtract(rhs, x.clone());
-            });
+            eq.each(function (x) {});
             return [lhs, rhs];
         };
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] BooleanLiteral
Solve.js:1411:42
             var lhs = new Symbol(0),
                     rhs = new Symbol(0);
             eq.each(function (x) {
-                if(x.contains(solve_for, true))
+                if(x.contains(solve_for, false))
                     lhs = _.add(lhs, x.clone());
                 else
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1411:20
             var lhs = new Symbol(0),
                     rhs = new Symbol(0);
             eq.each(function (x) {
-                if(x.contains(solve_for, true))
+                if(true)
                     lhs = _.add(lhs, x.clone());
                 else
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] ArrayDeclaration
Solve.js:1416:20
                 else
                     rhs = _.subtract(rhs, x.clone());
             });
-            return [lhs, rhs];
+            return [];
         };
 
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] BlockStatement
Solve.js:1419:61
             return [lhs, rhs];
         };
 
-        __.inverseFunctionSolve = function (name, lhs, rhs) {
-            //ax+b comes back as [a, x, ax, b];
-            var parts = explode(lhs.args[0], solve_for);
-            //check if x is by itself
-            var x = parts[1];
-            if(x.group === S) {
-                return _.divide(_.symfunction(name, [_.divide(rhs, _.parse(lhs.multiplier))]), parts[0]);
-            }
-
-        };
+        __.inverseFunctionSolve = function (name, lhs, rhs) {};
 
         //first remove any denominators
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[a^(-2)*asin(4/3)]'.

[Killed] BlockStatement
Solve.js:1424:31
             var parts = explode(lhs.args[0], solve_for);
             //check if x is by itself
             var x = parts[1];
-            if(x.group === S) {
-                return _.divide(_.symfunction(name, [_.divide(rhs, _.parse(lhs.multiplier))]), parts[0]);
-            }
+            if(x.group === S) {}
 
         };
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[a^(-2)*asin(4/3)]'.

[Killed] ConditionalExpression
Solve.js:1424:16
             var parts = explode(lhs.args[0], solve_for);
             //check if x is by itself
             var x = parts[1];
-            if(x.group === S) {
+            if(false) {
                 return _.divide(_.symfunction(name, [_.divide(rhs, _.parse(lhs.multiplier))]), parts[0]);
             }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[a^(-2)*asin(4/3)]'.

[Killed] ConditionalExpression
Solve.js:1433:12
         //first remove any denominators
         eq = correct_denom(eq);
 
-        if(eq.equals(0))
+        if(true)
             return [eq];
         //correct fractionals. I can only handle one type right now
killedBy: Solve should solve correctly
statusReason: Expected '[(-314146179365/1073228064103962)*y+x]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1433:12
         //first remove any denominators
         eq = correct_denom(eq);
 
-        if(eq.equals(0))
+        if(false)
             return [eq];
         //correct fractionals. I can only handle one type right now
killedBy: Solve should solve system of equations correctly
statusReason: Expected '' to equal 'x,0'.

[Killed] BlockStatement
Solve.js:1437:32
             return [eq];
         //correct fractionals. I can only handle one type right now
         var fkeys = core.Utils.keys(fractionals);
-        if(fkeys.length === 1) {
-            //make a note of the factor
-            cfact = fkeys[0];
-            eq.each(function (x, index) {
-                if(x.contains(solve_for)) {
-                    var parts = explode(x, solve_for);
-                    var v = parts[1];
-                    var p = v.power;
-                    if(p.den.gt(1)) {
-                        v.power = p.multiply(new core.Frac(cfact));
-                        eq.symbols[index] = _.multiply(v, parts[0]);
-                    }
-                }
-            });
-            eq = _.parse(eq);
-        }
+        if(fkeys.length === 1) {}
 
         //try for nested sqrts as per issue #486
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1437:12
             return [eq];
         //correct fractionals. I can only handle one type right now
         var fkeys = core.Utils.keys(fractionals);
-        if(fkeys.length === 1) {
+        if(false) {
             //make a note of the factor
             cfact = fkeys[0];
killedBy: Solve should solve correctly
statusReason: Expected '[0,832040/2178309]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1440:41
         if(fkeys.length === 1) {
             //make a note of the factor
             cfact = fkeys[0];
-            eq.each(function (x, index) {
-                if(x.contains(solve_for)) {
-                    var parts = explode(x, solve_for);
-                    var v = parts[1];
-                    var p = v.power;
-                    if(p.den.gt(1)) {
-                        v.power = p.multiply(new core.Frac(cfact));
-                        eq.symbols[index] = _.multiply(v, parts[0]);
-                    }
-                }
-            });
+            eq.each(function (x, index) {});
             eq = _.parse(eq);
         }
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1441:20
             //make a note of the factor
             cfact = fkeys[0];
             eq.each(function (x, index) {
-                if(x.contains(solve_for)) {
+                if(false) {
                     var parts = explode(x, solve_for);
                     var v = parts[1];
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1441:43
             //make a note of the factor
             cfact = fkeys[0];
             eq.each(function (x, index) {
-                if(x.contains(solve_for)) {
-                    var parts = explode(x, solve_for);
-                    var v = parts[1];
-                    var p = v.power;
-                    if(p.den.gt(1)) {
-                        v.power = p.multiply(new core.Frac(cfact));
-                        eq.symbols[index] = _.multiply(v, parts[0]);
-                    }
-                }
+                if(x.contains(solve_for)) {}
             });
             eq = _.parse(eq);
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1445:24
                     var parts = explode(x, solve_for);
                     var v = parts[1];
                     var p = v.power;
-                    if(p.den.gt(1)) {
+                    if(true) {
                         v.power = p.multiply(new core.Frac(cfact));
                         eq.symbols[index] = _.multiply(v, parts[0]);
killedBy: Solve should solve correctly
statusReason: Expected '[0,((1/2)*sqrt(5)-1/2)^2,((-1/2)*sqrt(5)-1/2)^2]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1445:24
                     var parts = explode(x, solve_for);
                     var v = parts[1];
                     var p = v.power;
-                    if(p.den.gt(1)) {
+                    if(false) {
                         v.power = p.multiply(new core.Frac(cfact));
                         eq.symbols[index] = _.multiply(v, parts[0]);
killedBy: Solve should solve correctly
statusReason: Expected '[0,692290561600/4745030099481]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1458:12
         add_to_result(__.sqrtSolve(eq, solve_for));
 
         //polynomial single variable
-        if(numvars === 1) {
+        if(true) {
             if(eq.isPoly(true)) {
                 //try to factor and solve
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1458:12
         add_to_result(__.sqrtSolve(eq, solve_for));
 
         //polynomial single variable
-        if(numvars === 1) {
+        if(false) {
             if(eq.isPoly(true)) {
                 //try to factor and solve
killedBy: Solve should solve correctly
statusReason: Expected '[(-1/28)*(5*sqrt(14)+sqrt(-560*sqrt(83)+350))*sqrt(83)^(-1),(-1/28)*(-sqrt(-560*sqrt(83)+350)+5*sqrt(14))*sqrt(83)^(-1)]' to equal '[(-1/28)*sqrt(-560*sqrt(83)+350)*sqrt(83)^(-1)+(-5/28)*sqrt(14)*sqrt(83)^(-1),(-5/28)*sqrt(14)*sqrt(83)^(-1)+(1/28)*sqrt(-560*sqrt(83)+350)*sqrt(83)^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1459:16
 
         //polynomial single variable
         if(numvars === 1) {
-            if(eq.isPoly(true)) {
+            if(true) {
                 //try to factor and solve
                 var factors = new core.Algebra.Classes.Factors();
killedBy: Solve should solve correctly
statusReason: ParseError: Cannot calculate roots. Symbol must be a polynomial!: 1

[Killed] ConditionalExpression
Solve.js:1459:16
 
         //polynomial single variable
         if(numvars === 1) {
-            if(eq.isPoly(true)) {
+            if(false) {
                 //try to factor and solve
                 var factors = new core.Algebra.Classes.Factors();
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] ConditionalExpression
Solve.js:1465:20
 
                 core.Algebra.Factor.factor(eq, factors);
                 //if the equation has more than one symbolic factor then solve those individually
-                if(factors.getNumberSymbolics() > 1) {
+                if(false) {
                     for(var x in factors.factors) {
                         add_to_result(solve(factors.factors[x], solve_for));
killedBy: Solve should solve correctly
statusReason: Expected '[(-1/28)*sqrt(100*sqrt(14)+450)*sqrt(83)^(-1)+(-5/14)*sqrt(83)^(-1)+(-5/28)*sqrt(14)*sqrt(83)^(-1),(-5/14)*sqrt(83)^(-1)+(-5/28)*sqrt(14)*sqrt(83)^(-1)+(1/28)*sqrt(100*sqrt(14)+450)*sqrt(83)^(-1)]' to equal '[(-5/14)*(2+sqrt(14))*sqrt(83)^(-1),0]'.

[Killed] ConditionalExpression
Solve.js:1465:20
 
                 core.Algebra.Factor.factor(eq, factors);
                 //if the equation has more than one symbolic factor then solve those individually
-                if(factors.getNumberSymbolics() > 1) {
+                if(true) {
                     for(var x in factors.factors) {
                         add_to_result(solve(factors.factors[x], solve_for));
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-1]'.

[Killed] BlockStatement
Solve.js:1466:51
                 core.Algebra.Factor.factor(eq, factors);
                 //if the equation has more than one symbolic factor then solve those individually
                 if(factors.getNumberSymbolics() > 1) {
-                    for(var x in factors.factors) {
-                        add_to_result(solve(factors.factors[x], solve_for));
-                    }
+                    for(var x in factors.factors) {}
                 }
                 else {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-5/14)*(2+sqrt(14))*sqrt(83)^(-1),0]'.

[Killed] ArithmeticOperator
Solve.js:1472:35
                 }
                 else {
                     var coeffs = core.Utils.getCoeffs(eq, solve_for),
-                            deg = coeffs.length - 1,
+                            deg = coeffs.length + 1,
                             was_calculated = false;
                     if(vars[0] === solve_for) {
killedBy: Solve should solve correctly
statusReason: Expected '[(129092113/182563817)*i,(-129092113/182563817)*i]' to equal '[(1/2)*i*sqrt(2),(-1/2)*i*sqrt(2)]'.

[Killed] BooleanLiteral
Solve.js:1473:46
                 else {
                     var coeffs = core.Utils.getCoeffs(eq, solve_for),
                             deg = coeffs.length - 1,
-                            was_calculated = false;
+                            was_calculated = true;
                     if(vars[0] === solve_for) {
                         //check to see if all the coefficients are constant
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] ConditionalExpression
Solve.js:1474:24
                     var coeffs = core.Utils.getCoeffs(eq, solve_for),
                             deg = coeffs.length - 1,
                             was_calculated = false;
-                    if(vars[0] === solve_for) {
+                    if(false) {
                         //check to see if all the coefficients are constant
                         if(checkAll(coeffs, function (x) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-1]'.

[Survived] ConditionalExpression
Solve.js:1474:24
                     var coeffs = core.Utils.getCoeffs(eq, solve_for),
                             deg = coeffs.length - 1,
                             was_calculated = false;
-                    if(vars[0] === solve_for) {
+                    if(true) {
                         //check to see if all the coefficients are constant
                         if(checkAll(coeffs, function (x) {

[Killed] ConditionalExpression
Solve.js:1476:28
                             was_calculated = false;
                     if(vars[0] === solve_for) {
                         //check to see if all the coefficients are constant
-                        if(checkAll(coeffs, function (x) {
-                            return x.group !== core.groups.N;
-                        })) {
+                        if(true) {
                             var roots = core.Algebra.proots(eq);
                             //if all the roots are integers then return those
killedBy: Solve should solve correctly
statusReason: ParseError: Invalid array length: 1

[Killed] BlockStatement
Solve.js:1476:58
                             was_calculated = false;
                     if(vars[0] === solve_for) {
                         //check to see if all the coefficients are constant
-                        if(checkAll(coeffs, function (x) {
-                            return x.group !== core.groups.N;
-                        })) {
+                        if(checkAll(coeffs, function (x) {})) {
                             var roots = core.Algebra.proots(eq);
                             //if all the roots are integers then return those
killedBy: Solve should solve correctly
statusReason: ParseError: Invalid array length: 1

[Killed] ConditionalExpression
Solve.js:1477:36
                     if(vars[0] === solve_for) {
                         //check to see if all the coefficients are constant
                         if(checkAll(coeffs, function (x) {
-                            return x.group !== core.groups.N;
+                            return false;
                         })) {
                             var roots = core.Algebra.proots(eq);
killedBy: Solve should solve correctly
statusReason: ParseError: Invalid array length: 1

[Survived] ConditionalExpression
Solve.js:1477:36
                     if(vars[0] === solve_for) {
                         //check to see if all the coefficients are constant
                         if(checkAll(coeffs, function (x) {
-                            return x.group !== core.groups.N;
+                            return true;
                         })) {
                             var roots = core.Algebra.proots(eq);

[Survived] BlockStatement
Solve.js:1478:29
                         //check to see if all the coefficients are constant
                         if(checkAll(coeffs, function (x) {
                             return x.group !== core.groups.N;
-                        })) {
-                            var roots = core.Algebra.proots(eq);
-                            //if all the roots are integers then return those
-                            if(checkAll(roots, function (x) {
-                                return !core.Utils.isInt(x);
-                            })) {
-                                //roots have been calculates
-                                was_calculated = true;
-                                roots.map(function (x) {
-                                    add_to_result(new Symbol(x));
-                                });
-                            }
-                        }
+                        })) {}
 
                         if(!was_calculated) {

[Killed] ConditionalExpression
Solve.js:1481:32
                         })) {
                             var roots = core.Algebra.proots(eq);
                             //if all the roots are integers then return those
-                            if(checkAll(roots, function (x) {
-                                return !core.Utils.isInt(x);
-                            })) {
+                            if(true) {
                                 //roots have been calculates
                                 was_calculated = true;
killedBy: Solve should solve correctly
statusReason: ParseError: -i is not a valid variable name: 1

[Killed] BlockStatement
Solve.js:1481:61
                         })) {
                             var roots = core.Algebra.proots(eq);
                             //if all the roots are integers then return those
-                            if(checkAll(roots, function (x) {
-                                return !core.Utils.isInt(x);
-                            })) {
+                            if(checkAll(roots, function (x) {})) {
                                 //roots have been calculates
                                 was_calculated = true;
killedBy: Solve should solve correctly
statusReason: ParseError: -i is not a valid variable name: 1

[Killed] BooleanLiteral
Solve.js:1482:40
                             var roots = core.Algebra.proots(eq);
                             //if all the roots are integers then return those
                             if(checkAll(roots, function (x) {
-                                return !core.Utils.isInt(x);
+                                return core.Utils.isInt(x);
                             })) {
                                 //roots have been calculates
killedBy: Solve should solve correctly
statusReason: ParseError: -i is not a valid variable name: 1

[Survived] BlockStatement
Solve.js:1483:33
                             //if all the roots are integers then return those
                             if(checkAll(roots, function (x) {
                                 return !core.Utils.isInt(x);
-                            })) {
-                                //roots have been calculates
-                                was_calculated = true;
-                                roots.map(function (x) {
-                                    add_to_result(new Symbol(x));
-                                });
-                            }
+                            })) {}
                         }
 

[Survived] BooleanLiteral
Solve.js:1485:50
                                 return !core.Utils.isInt(x);
                             })) {
                                 //roots have been calculates
-                                was_calculated = true;
+                                was_calculated = false;
                                 roots.map(function (x) {
                                     add_to_result(new Symbol(x));

[Killed] BlockStatement
Solve.js:1486:56
                             })) {
                                 //roots have been calculates
                                 was_calculated = true;
-                                roots.map(function (x) {
-                                    add_to_result(new Symbol(x));
-                                });
+                                roots.map(function (x) {});
                             }
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-1]'.

[Killed] BooleanLiteral
Solve.js:1492:28
                             }
                         }
 
-                        if(!was_calculated) {
+                        if(was_calculated) {
                             eqns = _.parse(eqns);
                             if(eqns instanceof core.Equation)
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] ConditionalExpression
Solve.js:1492:28
                             }
                         }
 
-                        if(!was_calculated) {
+                        if(false) {
                             eqns = _.parse(eqns);
                             if(eqns instanceof core.Equation)
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] ConditionalExpression
Solve.js:1494:32
 
                         if(!was_calculated) {
                             eqns = _.parse(eqns);
-                            if(eqns instanceof core.Equation)
+                            if(false)
                                 eqns = eqns.toLHS();
 
killedBy: Solve should solve correctly
statusReason: ParseError: symbol.isConstant is not a function: 1

[Killed] ConditionalExpression
Solve.js:1494:32
 
                         if(!was_calculated) {
                             eqns = _.parse(eqns);
-                            if(eqns instanceof core.Equation)
+                            if(true)
                                 eqns = eqns.toLHS();
 
killedBy: Solve should solve correctly
statusReason: ParseError: eqns.toLHS is not a function: 1

[Killed] ConditionalExpression
Solve.js:1498:32
                                 eqns = eqns.toLHS();
 
                             //we can solve algebraically for degrees 1, 2, 3. The remainder we switch to Jenkins-
-                            if(deg === 1)
+                            if(true)
                                 add_to_result(_.divide(coeffs[0], coeffs[1].negate()));
                             else if(deg === 2) {
killedBy: Solve should solve correctly
statusReason: ParseError: Division by zero not allowed!: 1

[Killed] ConditionalExpression
Solve.js:1498:32
                                 eqns = eqns.toLHS();
 
                             //we can solve algebraically for degrees 1, 2, 3. The remainder we switch to Jenkins-
-                            if(deg === 1)
+                            if(false)
                                 add_to_result(_.divide(coeffs[0], coeffs[1].negate()));
                             else if(deg === 2) {
killedBy: Solve should solve correctly
statusReason: ParseError: Invalid array length: 1

[Killed] ConditionalExpression
Solve.js:1500:37
                             //we can solve algebraically for degrees 1, 2, 3. The remainder we switch to Jenkins-
                             if(deg === 1)
                                 add_to_result(_.divide(coeffs[0], coeffs[1].negate()));
-                            else if(deg === 2) {
+                            else if(true) {
                                 add_to_result(_.expand(__.quad.apply(undefined, coeffs)));
                             }
killedBy: Solve should solve correctly

[Killed] BlockStatement
Solve.js:1500:48
                             //we can solve algebraically for degrees 1, 2, 3. The remainder we switch to Jenkins-
                             if(deg === 1)
                                 add_to_result(_.divide(coeffs[0], coeffs[1].negate()));
-                            else if(deg === 2) {
-                                add_to_result(_.expand(__.quad.apply(undefined, coeffs)));
-                            }
+                            else if(deg === 2) {}
 
                             else if(deg === 3) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[i,-i]'.

[Killed] ConditionalExpression
Solve.js:1504:37
                                 add_to_result(_.expand(__.quad.apply(undefined, coeffs)));
                             }
 
-                            else if(deg === 3) {
+                            else if(false) {
                                 var solutions = []; //set to blank
                                 //first try to factor and solve
killedBy: Solve should solve correctly
