[Killed] BlockStatement
Solve.js:1504:48
                                 add_to_result(_.expand(__.quad.apply(undefined, coeffs)));
                             }
 
-                            else if(deg === 3) {
-                                var solutions = []; //set to blank
-                                //first try to factor and solve
-                                var factored = core.Algebra.Factor.factor(eqns);
-
-                                //if it was successfully factored
-                                var solutions = [];
-                                if(solutions.length > 0)
-                                    add_to_result(solutions);
-                                else
-                                    add_to_result(__.cubic.apply(undefined, coeffs));
-                            }
+                            else if(deg === 3) {}
 
                             else {
killedBy: Solve should solve correctly

[Survived] ArrayDeclaration
Solve.js:1505:49
                             }
 
                             else if(deg === 3) {
-                                var solutions = []; //set to blank
+                                var solutions = ["Stryker was here"]; //set to blank
                                 //first try to factor and solve
                                 var factored = core.Algebra.Factor.factor(eqns);

[Killed] ArrayDeclaration
Solve.js:1510:49
                                 var factored = core.Algebra.Factor.factor(eqns);
 
                                 //if it was successfully factored
-                                var solutions = [];
+                                var solutions = ["Stryker was here"];
                                 if(solutions.length > 0)
                                     add_to_result(solutions);
killedBy: Solve should solve correctly

[Killed] ConditionalExpression
Solve.js:1511:36
 
                                 //if it was successfully factored
                                 var solutions = [];
-                                if(solutions.length > 0)
+                                if(true)
                                     add_to_result(solutions);
                                 else
killedBy: Solve should solve correctly

[Survived] ConditionalExpression
Solve.js:1511:36
 
                                 //if it was successfully factored
                                 var solutions = [];
-                                if(solutions.length > 0)
+                                if(false)
                                     add_to_result(solutions);
                                 else

[Killed] BlockStatement
Solve.js:1517:34
                                     add_to_result(__.cubic.apply(undefined, coeffs));
                             }
 
-                            else {
-                                /*
-                                 var sym_roots = csolve(eq, solve_for); 
-                                 if(sym_roots.length === 0)
-                                 sym_roots = divnconsolve(eq, solve_for);
-                                 if(sym_roots.length > 0) 
-                                 add_to_result(sym_roots);
-                                 else
-                                 */
-                                _A.proots(eq).map(add_to_result);
-                            }
+                            else {}
                         }
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[72425485/91070226,-72425485/91070226,(316684236/398209345)*i,(-316684236/398209345)*i]'.

[Survived] BlockStatement
Solve.js:1541:119
                     var points1 = __.getPoints(eq, 0.1);
                     var points2 = __.getPoints(eq, 0.05);
                     var points3 = __.getPoints(eq, 0.01);
-                    var points = core.Utils.arrayUnique(points1.concat(points2).concat(points3)).sort(function (a, b) {
-                        return a - b;
-                    });
+                    var points = core.Utils.arrayUnique(points1.concat(points2).concat(points3)).sort(function (a, b) {});
                     var i, point, solution;
 

[Survived] MethodExpression
Solve.js:1541:34
                     var points1 = __.getPoints(eq, 0.1);
                     var points2 = __.getPoints(eq, 0.05);
                     var points3 = __.getPoints(eq, 0.01);
-                    var points = core.Utils.arrayUnique(points1.concat(points2).concat(points3)).sort(function (a, b) {
-                        return a - b;
-                    });
+                    var points = core.Utils.arrayUnique(points1.concat(points2).concat(points3));
                     var i, point, solution;
 

[Survived] ArithmeticOperator
Solve.js:1542:32
                     var points2 = __.getPoints(eq, 0.05);
                     var points3 = __.getPoints(eq, 0.01);
                     var points = core.Utils.arrayUnique(points1.concat(points2).concat(points3)).sort(function (a, b) {
-                        return a - b;
+                        return a + b;
                     });
                     var i, point, solution;

[Killed] ConditionalExpression
Solve.js:1551:32
 
                     // First try to eliminate some points using bisection
                     var t_points = [];
-                    for(i = 0; i < points.length; i++) {
+                    for(i = 0; false; i++) {
                         point = points[i];
 
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1551:56
 
                     // First try to eliminate some points using bisection
                     var t_points = [];
-                    for(i = 0; i < points.length; i++) {
-                        point = points[i];
-
-                        // See if there's a solution at this point
-                        solution = __.bisection(point, f);
-
-                        // If there's no solution then add it to the array for further investigation
-                        if(typeof solution === 'undefined') {
-                            t_points.push(point);
-                            continue;
-                        }
-
-                        // Add the solution to the solution set
-                        add_to_result(solution, has_trig);
-                    }
+                    for(i = 0; i < points.length; i++) {}
 
                     // Reset the points to the remaining points
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1558:28
                         solution = __.bisection(point, f);
 
                         // If there's no solution then add it to the array for further investigation
-                        if(typeof solution === 'undefined') {
+                        if(true) {
                             t_points.push(point);
                             continue;
killedBy: Solve should solve correctly
statusReason: Expected '[7,7881299347898374/1125899906842625]' to equal '[7]'.

[Killed] ConditionalExpression
Solve.js:1558:28
                         solution = __.bisection(point, f);
 
                         // If there's no solution then add it to the array for further investigation
-                        if(typeof solution === 'undefined') {
+                        if(false) {
                             t_points.push(point);
                             continue;
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] BlockStatement
Solve.js:1573:56
                     // Build the derivative and compile a function
                     var d = _C.diff(eq.clone());
                     var fp = build(d);
-                    for(i = 0; i < points.length; i++) {
-                        point = points[i];
-
-                        add_to_result(__.Newton(point, f, fp), has_trig);
-                    }
+                    for(i = 0; i < points.length; i++) {}
                     solutions.sort();
                 }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1573:32
                     // Build the derivative and compile a function
                     var d = _C.diff(eq.clone());
                     var fp = build(d);
-                    for(i = 0; i < points.length; i++) {
+                    for(i = 0; false; i++) {
                         point = points[i];
 
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] MethodExpression
Solve.js:1578:21
 
                         add_to_result(__.Newton(point, f, fp), has_trig);
                     }
-                    solutions.sort();
+                    solutions;
                 }
                 catch(e) {
killedBy: Solve should solve correctly
statusReason: Expected '[0,1,(-1/2)*sqrt(5)+3/2,832040/2178309]' to equal '[(-1/2)*sqrt(5)+3/2,0,1,832040/2178309]'.

[Killed] ConditionalExpression
Solve.js:1588:16
         else {
             //The idea here is to go through the equation and collect the coefficients
             //place them in an array and call the quad or cubic function to get the results
-            if(!eq.hasFunc(solve_for) && eq.isComposite()) {
+            if(true) {
                 try {
                     var factored = core.Algebra.Factor.factor(eq.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[-(-a*b+8)*x^(-y)]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1588:16
         else {
             //The idea here is to go through the equation and collect the coefficients
             //place them in an array and call the quad or cubic function to get the results
-            if(!eq.hasFunc(solve_for) && eq.isComposite()) {
+            if(false) {
                 try {
                     var factored = core.Algebra.Factor.factor(eq.clone());
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1592:24
                 try {
                     var factored = core.Algebra.Factor.factor(eq.clone());
 
-                    if(factored.group === CB) {
+                    if(true) {
                         factored.each(function (x) {
                             add_to_result(solve(x, solve_for));
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] BlockStatement
Solve.js:1592:47
                 try {
                     var factored = core.Algebra.Factor.factor(eq.clone());
 
-                    if(factored.group === CB) {
-                        factored.each(function (x) {
-                            add_to_result(solve(x, solve_for));
-                        });
-                    }
+                    if(factored.group === CB) {}
                     else {
                         var coeffs = core.Utils.getCoeffs(eq, solve_for);
killedBy: Solve should solve factors
statusReason: Expected '[1]' to equal '[1,-c,a]'.

[Killed] BlockStatement
Solve.js:1593:52
                     var factored = core.Algebra.Factor.factor(eq.clone());
 
                     if(factored.group === CB) {
-                        factored.each(function (x) {
-                            add_to_result(solve(x, solve_for));
-                        });
+                        factored.each(function (x) {});
                     }
                     else {
killedBy: Solve should solve factors
statusReason: Expected '[1]' to equal '[1,-c,a]'.

[Killed] ArithmeticOperator
Solve.js:1601:39
                         var coeffs = core.Utils.getCoeffs(eq, solve_for);
 
                         var l = coeffs.length,
-                                deg = l - 1; //the degree of the polynomial
+                                deg = l + 1; //the degree of the polynomial
                         //get the denominator and make sure it doesn't have x
 
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1606:29
 
                         //handle the problem based on the degree
                         switch(deg) {
-                            case 0:
-                                var separated = separate(eq);
-                                var lhs = separated[0],
-                                        rhs = separated[1];
-                                
-                                if(lhs.group === core.groups.EX) {
-                                    var log = core.Settings.LOG;
-                                    var expr_str = `${log}((${rhs})/(${lhs.multiplier}))/${log}(${lhs.value})/${lhs.power.multiplier}`;
-                                    add_to_result(_.parse(expr_str));
-                                }
-                                break;
+                            case 0:
                             case 1:
                                 //nothing to do but to return the quotient of the constant and the LT
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] BlockStatement
Solve.js:1611:66
                                 var lhs = separated[0],
                                         rhs = separated[1];
                                 
-                                if(lhs.group === core.groups.EX) {
-                                    var log = core.Settings.LOG;
-                                    var expr_str = `${log}((${rhs})/(${lhs.multiplier}))/${log}(${lhs.value})/${lhs.power.multiplier}`;
-                                    add_to_result(_.parse(expr_str));
-                                }
+                                if(lhs.group === core.groups.EX) {}
                                 break;
                             case 1:
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1611:36
                                 var lhs = separated[0],
                                         rhs = separated[1];
                                 
-                                if(lhs.group === core.groups.EX) {
+                                if(false) {
                                     var log = core.Settings.LOG;
                                     var expr_str = `${log}((${rhs})/(${lhs.multiplier}))/${log}(${lhs.value})/${lhs.power.multiplier}`;
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[log(8/5)*log(y)^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1617:29
                                     add_to_result(_.parse(expr_str));
                                 }
                                 break;
-                            case 1:
-                                //nothing to do but to return the quotient of the constant and the LT
-                                //e.g. 2*x-1
-                                add_to_result(_.divide(coeffs[0], coeffs[1].negate()));
-                                break;
+                            case 1:
                             case 2:
                                 add_to_result(__.quad.apply(undefined, coeffs));
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] ConditionalExpression
Solve.js:1622:29
                                 //e.g. 2*x-1
                                 add_to_result(_.divide(coeffs[0], coeffs[1].negate()));
                                 break;
-                            case 2:
-                                add_to_result(__.quad.apply(undefined, coeffs));
-                                break;
+                            case 2:
                             case 3:
                                 add_to_result(__.cubic.apply(undefined, coeffs));
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[a^(-1)*i*sqrt(a)*sqrt(b),-a^(-1)*i*sqrt(a)*sqrt(b)]'.

[Killed] ConditionalExpression
Solve.js:1625:29
                             case 2:
                                 add_to_result(__.quad.apply(undefined, coeffs));
                                 break;
-                            case 3:
-                                add_to_result(__.cubic.apply(undefined, coeffs));
-                                break;
+                            case 3:
                             case 4:
                                 add_to_result(__.quartic.apply(undefined, coeffs));
killedBy: Solve should solve correctly

[NoCoverage] ConditionalExpression
Solve.js:1628:29
                             case 3:
                                 add_to_result(__.cubic.apply(undefined, coeffs));
                                 break;
-                            case 4:
-                                add_to_result(__.quartic.apply(undefined, coeffs));
-                                break;
+                            case 4:
                             default:
                                 add_to_result(__.csolve(eq, solve_for));

[Killed] ConditionalExpression
Solve.js:1631:29
                             case 4:
                                 add_to_result(__.quartic.apply(undefined, coeffs));
                                 break;
-                            default:
-                                add_to_result(__.csolve(eq, solve_for));
-                                if(solutions.length === 0)
-                                    add_to_result(__.divideAndConquer(eq, solve_for));
+                            default:
                         }
 
killedBy: Solve should solve correctly

[Survived] ConditionalExpression
Solve.js:1633:36
                                 break;
                             default:
                                 add_to_result(__.csolve(eq, solve_for));
-                                if(solutions.length === 0)
+                                if(true)
                                     add_to_result(__.divideAndConquer(eq, solve_for));
                         }

[Survived] ConditionalExpression
Solve.js:1633:36
                                 break;
                             default:
                                 add_to_result(__.csolve(eq, solve_for));
-                                if(solutions.length === 0)
+                                if(false)
                                     add_to_result(__.divideAndConquer(eq, solve_for));
                         }

[Killed] ConditionalExpression
Solve.js:1637:28
                                     add_to_result(__.divideAndConquer(eq, solve_for));
                         }
 
-                        if(solutions.length === 0) {
+                        if(true) {
                             //try factoring
                             add_to_result(solve(factored, solve_for, solutions, depth));
killedBy: Solve should solve correctly

[NoCoverage] BlockStatement
Solve.js:1637:52
                                     add_to_result(__.divideAndConquer(eq, solve_for));
                         }
 
-                        if(solutions.length === 0) {
-                            //try factoring
-                            add_to_result(solve(factored, solve_for, solutions, depth));
-                        }
+                        if(solutions.length === 0) {}
                     }
 

[NoCoverage] BlockStatement
Solve.js:1644:26
                     }
 
                 }
-                catch(e) { /*something went wrong. EXITING*/
-                    ;
-                }
+                catch(e) {}
             }
             else {

[Killed] ConditionalExpression
Solve.js:1653:24
                     var rw = __.rewrite(eq, null, solve_for);
                     var lhs = rw[0];
                     var rhs = rw[1];
-                    if(lhs.group === FN) {
+                    if(false) {
                         if(lhs.fname === 'abs') {
                             add_to_result([rhs.clone(), rhs.negate()]);
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1653:24
                     var rw = __.rewrite(eq, null, solve_for);
                     var lhs = rw[0];
                     var rhs = rw[1];
-                    if(lhs.group === FN) {
+                    if(true) {
                         if(lhs.fname === 'abs') {
                             add_to_result([rhs.clone(), rhs.negate()]);
killedBy: Solve should solve correctly
statusReason: Expected '[-4-x-y^2+5*y]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] ConditionalExpression
Solve.js:1654:28
                     var lhs = rw[0];
                     var rhs = rw[1];
                     if(lhs.group === FN) {
-                        if(lhs.fname === 'abs') {
+                        if(true) {
                             add_to_result([rhs.clone(), rhs.negate()]);
                         }
killedBy: Solve should solve correctly
statusReason: Expected '[21+b,-21-b]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Survived] ConditionalExpression
Solve.js:1654:28
                     var lhs = rw[0];
                     var rhs = rw[1];
                     if(lhs.group === FN) {
-                        if(lhs.fname === 'abs') {
+                        if(false) {
                             add_to_result([rhs.clone(), rhs.negate()]);
                         }

[Killed] ConditionalExpression
Solve.js:1657:33
                         if(lhs.fname === 'abs') {
                             add_to_result([rhs.clone(), rhs.negate()]);
                         }
-                        else if(lhs.fname === 'sin') {
+                        else if(false) {
                             //asin
                             add_to_result(__.inverseFunctionSolve('asin', lhs, rhs));
killedBy: Solve should solve correctly
statusReason: Expected '[-4+3*sin(-b+a^2*x)]' to equal '[a^(-2)*asin(4/3)]'.

[Killed] ConditionalExpression
Solve.js:1657:33
                         if(lhs.fname === 'abs') {
                             add_to_result([rhs.clone(), rhs.negate()]);
                         }
-                        else if(lhs.fname === 'sin') {
+                        else if(true) {
                             //asin
                             add_to_result(__.inverseFunctionSolve('asin', lhs, rhs));
killedBy: Solve should solve correctly
statusReason: Expected '[a^(-1)*asin(21+b)]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1661:33
                             //asin
                             add_to_result(__.inverseFunctionSolve('asin', lhs, rhs));
                         }
-                        else if(lhs.fname === 'cos') {
+                        else if(true) {
                             //asin
                             add_to_result(__.inverseFunctionSolve('acos', lhs, rhs));
killedBy: Solve should solve correctly
statusReason: Expected '[a^(-1)*acos(21+b)]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[NoCoverage] BlockStatement
Solve.js:1661:54
                             //asin
                             add_to_result(__.inverseFunctionSolve('asin', lhs, rhs));
                         }
-                        else if(lhs.fname === 'cos') {
-                            //asin
-                            add_to_result(__.inverseFunctionSolve('acos', lhs, rhs));
-                        }
+                        else if(lhs.fname === 'cos') {}
                         else if(lhs.fname === 'tan') {
                             //asin

[Killed] ConditionalExpression
Solve.js:1665:33
                             //asin
                             add_to_result(__.inverseFunctionSolve('acos', lhs, rhs));
                         }
-                        else if(lhs.fname === 'tan') {
+                        else if(true) {
                             //asin
                             add_to_result(__.inverseFunctionSolve('atan', lhs, rhs));
killedBy: Solve should solve correctly
statusReason: Expected '[a^(-1)*atan(21+b)]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Survived] ConditionalExpression
Solve.js:1665:33
                             //asin
                             add_to_result(__.inverseFunctionSolve('acos', lhs, rhs));
                         }
-                        else if(lhs.fname === 'tan') {
+                        else if(false) {
                             //asin
                             add_to_result(__.inverseFunctionSolve('atan', lhs, rhs));

[NoCoverage] StringLiteral
Solve.js:1667:67
                         }
                         else if(lhs.fname === 'tan') {
                             //asin
-                            add_to_result(__.inverseFunctionSolve('atan', lhs, rhs));
+                            add_to_result(__.inverseFunctionSolve("", lhs, rhs));
                         }
                         else if(lhs.fname === core.Settings.LOG) {

[Killed] BlockStatement
Solve.js:1669:66
                             //asin
                             add_to_result(__.inverseFunctionSolve('atan', lhs, rhs));
                         }
-                        else if(lhs.fname === core.Settings.LOG) {
-                            //ax+b comes back as [a, x, ax, b];
-                            var parts = explode(lhs.args[0], solve_for);
-                            //check if x is by itself
-                            var x = parts[1];
-                            if(x.group === S) {
-                                rhs = _.divide(_.subtract(_.pow(lhs.args.length > 1 ? lhs.args[1] : new Symbol('e'), _.divide(rhs, _.parse(lhs.multiplier))), parts[3]), parts[0]);
-                                var eq = new Equation(x, rhs).toLHS();
-                                add_to_result(solve(eq, solve_for));
-                            }
-                        }
+                        else if(lhs.fname === core.Settings.LOG) {}
                         else
                             add_to_result(_.subtract(lhs, rhs));
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1669:33
                             //asin
                             add_to_result(__.inverseFunctionSolve('atan', lhs, rhs));
                         }
-                        else if(lhs.fname === core.Settings.LOG) {
+                        else if(false) {
                             //ax+b comes back as [a, x, ax, b];
                             var parts = explode(lhs.args[0], solve_for);
killedBy: Solve should solve correctly
statusReason: Expected '[-21-b+log(-c+a*x)]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] BlockStatement
Solve.js:1674:47
                             var parts = explode(lhs.args[0], solve_for);
                             //check if x is by itself
                             var x = parts[1];
-                            if(x.group === S) {
-                                rhs = _.divide(_.subtract(_.pow(lhs.args.length > 1 ? lhs.args[1] : new Symbol('e'), _.divide(rhs, _.parse(lhs.multiplier))), parts[3]), parts[0]);
-                                var eq = new Equation(x, rhs).toLHS();
-                                add_to_result(solve(eq, solve_for));
-                            }
+                            if(x.group === S) {}
                         }
                         else
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1675:65
                             //check if x is by itself
                             var x = parts[1];
                             if(x.group === S) {
-                                rhs = _.divide(_.subtract(_.pow(lhs.args.length > 1 ? lhs.args[1] : new Symbol('e'), _.divide(rhs, _.parse(lhs.multiplier))), parts[3]), parts[0]);
+                                rhs = _.divide(_.subtract(_.pow(true ? lhs.args[1] : new Symbol('e'), _.divide(rhs, _.parse(lhs.multiplier))), parts[3]), parts[0]);
                                 var eq = new Equation(x, rhs).toLHS();
                                 add_to_result(solve(eq, solve_for));
killedBy: Solve should solve correctly
statusReason: Expected '[-a^(-1)*c]' to equal '[-(-c-e^(21+b))*a^(-1)]'.

[Survived] ConditionalExpression
Solve.js:1675:65
                             //check if x is by itself
                             var x = parts[1];
                             if(x.group === S) {
-                                rhs = _.divide(_.subtract(_.pow(lhs.args.length > 1 ? lhs.args[1] : new Symbol('e'), _.divide(rhs, _.parse(lhs.multiplier))), parts[3]), parts[0]);
+                                rhs = _.divide(_.subtract(_.pow(false ? lhs.args[1] : new Symbol('e'), _.divide(rhs, _.parse(lhs.multiplier))), parts[3]), parts[0]);
                                 var eq = new Equation(x, rhs).toLHS();
                                 add_to_result(solve(eq, solve_for));
