[Killed] BlockStatement
Solve.js:1683:26
                         else
                             add_to_result(_.subtract(lhs, rhs));
                     }
-                    else {
-                        var neq = new Equation(lhs, rhs).toLHS(); //create a new equation
-
-                        if(neq.equals(eq))
-                            throw new Error('Stopping. No stop condition exists');
-                        add_to_result(solve(neq, solve_for));
-                    }
+                    else {}
                 }
                 catch(error) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Killed] ConditionalExpression
Solve.js:1686:28
                     else {
                         var neq = new Equation(lhs, rhs).toLHS(); //create a new equation
 
-                        if(neq.equals(eq))
+                        if(true)
                             throw new Error('Stopping. No stop condition exists');
                         add_to_result(solve(neq, solve_for));
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-1/2)*(-5+sqrt(-4*x+9)),(-1/2)*(-5-sqrt(-4*x+9))]'.

[Survived] ConditionalExpression
Solve.js:1686:28
                     else {
                         var neq = new Equation(lhs, rhs).toLHS(); //create a new equation
 
-                        if(neq.equals(eq))
+                        if(false)
                             throw new Error('Stopping. No stop condition exists');
                         add_to_result(solve(neq, solve_for));

[NoCoverage] StringLiteral
Solve.js:1687:45
                         var neq = new Equation(lhs, rhs).toLHS(); //create a new equation
 
                         if(neq.equals(eq))
-                            throw new Error('Stopping. No stop condition exists');
+                            throw new Error("");
                         add_to_result(solve(neq, solve_for));
                     }

[Killed] BlockStatement
Solve.js:1691:30
                         add_to_result(solve(neq, solve_for));
                     }
                 }
-                catch(error) {
-                    //Let's try this another way
-                    try {
-                        //1. if the symbol is in the form a*b*c*... then the solution is zero if 
-                        //either a or b or c is zero.
-                        if(eq.group === CB)
-                            add_to_result(0);
-                        else if(eq.group === CP) {
-                            var separated = separate(eq);
-                            var lhs = separated[0],
-                                    rhs = separated[1];
-
-                            //reduce the equation
-                            if(lhs.group === core.groups.EX && lhs.value === solve_for) {
-                                //change the base of both sides
-                                var p = lhs.power.clone().invert();
-                                add_to_result(_.pow(rhs, p));
-                            }
-                        }
-                    }
-                    catch(error) {
-                        ;
-                    }
-                }
+                catch(error) {}
             }
         }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] BlockStatement
Solve.js:1693:25
                 }
                 catch(error) {
                     //Let's try this another way
-                    try {
-                        //1. if the symbol is in the form a*b*c*... then the solution is zero if 
-                        //either a or b or c is zero.
-                        if(eq.group === CB)
-                            add_to_result(0);
-                        else if(eq.group === CP) {
-                            var separated = separate(eq);
-                            var lhs = separated[0],
-                                    rhs = separated[1];
-
-                            //reduce the equation
-                            if(lhs.group === core.groups.EX && lhs.value === solve_for) {
-                                //change the base of both sides
-                                var p = lhs.power.clone().invert();
-                                add_to_result(_.pow(rhs, p));
-                            }
-                        }
-                    }
+                    try {}
                     catch(error) {
                         ;
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1696:28
                     try {
                         //1. if the symbol is in the form a*b*c*... then the solution is zero if 
                         //either a or b or c is zero.
-                        if(eq.group === CB)
+                        if(true)
                             add_to_result(0);
                         else if(eq.group === CP) {
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(-8+a*b)^y^(-1)]'.

[Survived] ConditionalExpression
Solve.js:1696:28
                     try {
                         //1. if the symbol is in the form a*b*c*... then the solution is zero if 
                         //either a or b or c is zero.
-                        if(eq.group === CB)
+                        if(false)
                             add_to_result(0);
                         else if(eq.group === CP) {

[Killed] BlockStatement
Solve.js:1698:50
                         //either a or b or c is zero.
                         if(eq.group === CB)
                             add_to_result(0);
-                        else if(eq.group === CP) {
-                            var separated = separate(eq);
-                            var lhs = separated[0],
-                                    rhs = separated[1];
-
-                            //reduce the equation
-                            if(lhs.group === core.groups.EX && lhs.value === solve_for) {
-                                //change the base of both sides
-                                var p = lhs.power.clone().invert();
-                                add_to_result(_.pow(rhs, p));
-                            }
-                        }
+                        else if(eq.group === CP) {}
                     }
                     catch(error) {
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1698:33
                         //either a or b or c is zero.
                         if(eq.group === CB)
                             add_to_result(0);
-                        else if(eq.group === CP) {
+                        else if(false) {
                             var separated = separate(eq);
                             var lhs = separated[0],
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] BlockStatement
Solve.js:1704:89
                                     rhs = separated[1];
 
                             //reduce the equation
-                            if(lhs.group === core.groups.EX && lhs.value === solve_for) {
-                                //change the base of both sides
-                                var p = lhs.power.clone().invert();
-                                add_to_result(_.pow(rhs, p));
-                            }
+                            if(lhs.group === core.groups.EX && lhs.value === solve_for) {}
                         }
                     }
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[Killed] ConditionalExpression
Solve.js:1704:32
                                     rhs = separated[1];
 
                             //reduce the equation
-                            if(lhs.group === core.groups.EX && lhs.value === solve_for) {
+                            if(false) {
                                 //change the base of both sides
                                 var p = lhs.power.clone().invert();
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[(-8+a*b)^y^(-1)]'.

[NoCoverage] BlockStatement
Solve.js:1711:34
                             }
                         }
                     }
-                    catch(error) {
-                        ;
-                    }
+                    catch(error) {}
                 }
             }

[Killed] ConditionalExpression
Solve.js:1718:12
             }
         }
 
-        if(cfact) {
+        if(false) {
             solutions = solutions.map(function (x) {
                 return _.pow(x, new Symbol(cfact));
killedBy: Solve should solve correctly
statusReason: Expected '[0,279646901/490746101]' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1718:12
             }
         }
 
-        if(cfact) {
+        if(true) {
             solutions = solutions.map(function (x) {
                 return _.pow(x, new Symbol(cfact));
killedBy: Solve should solve correctly
statusReason: Expected '[1073228064103962^#*314146179365^(-#)*x^#]' to equal '[(1073228064103962/314146179365)*x]'.

[Killed] BlockStatement
Solve.js:1719:52
         }
 
         if(cfact) {
-            solutions = solutions.map(function (x) {
-                return _.pow(x, new Symbol(cfact));
-            });
+            solutions = solutions.map(function (x) {});
         }
 
killedBy: Solve should solve correctly
statusReason: Expected '' to equal '[0,78202389238903801/240831735646702201]'.

[Killed] ConditionalExpression
Solve.js:1726:12
 
         // Perform some cleanup but don't do it agains arrays, etc
         // Check it actually evaluates to zero
-        if(isSymbol(eqns)) {
+        if(true) {
             var knowns = {};
             solutions = solutions.filter(function (x) {
killedBy: Solve should solve correctly
statusReason: Expected '[0]' to equal '[(-5/14)*(2+sqrt(14))*sqrt(83)^(-1),0]'.

[Killed] BlockStatement
Solve.js:1726:28
 
         // Perform some cleanup but don't do it agains arrays, etc
         // Check it actually evaluates to zero
-        if(isSymbol(eqns)) {
-            var knowns = {};
-            solutions = solutions.filter(function (x) {
-                try {
-                    knowns[solve_for] = x;
-                    var zero = Number(evaluate(eqns, knowns));
-
-                    // Allow symbolic answers
-                    if(isNaN(zero)) {
-                        return true;
-                    }
-                    return true;
-                }
-                catch(e) {
-                    return false;
-                }
-            });
-        }
+        if(isSymbol(eqns)) {}
 
         return solutions;
killedBy: Solve should solve correctly
statusReason: Expected '[-10,(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.

[Killed] BlockStatement
Solve.js:1728:55
         // Check it actually evaluates to zero
         if(isSymbol(eqns)) {
             var knowns = {};
-            solutions = solutions.filter(function (x) {
-                try {
-                    knowns[solve_for] = x;
-                    var zero = Number(evaluate(eqns, knowns));
-
-                    // Allow symbolic answers
-                    if(isNaN(zero)) {
-                        return true;
-                    }
-                    return true;
-                }
-                catch(e) {
-                    return false;
-                }
-            });
+            solutions = solutions.filter(function (x) {});
         }
 
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-1]'.

[Killed] MethodExpression
Solve.js:1728:25
         // Check it actually evaluates to zero
         if(isSymbol(eqns)) {
             var knowns = {};
-            solutions = solutions.filter(function (x) {
-                try {
-                    knowns[solve_for] = x;
-                    var zero = Number(evaluate(eqns, knowns));
-
-                    // Allow symbolic answers
-                    if(isNaN(zero)) {
-                        return true;
-                    }
-                    return true;
-                }
-                catch(e) {
-                    return false;
-                }
-            });
+            solutions = solutions;
         }
 
killedBy: Solve should solve correctly
statusReason: Expected '[-10,(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.

[Killed] BlockStatement
Solve.js:1729:21
         if(isSymbol(eqns)) {
             var knowns = {};
             solutions = solutions.filter(function (x) {
-                try {
-                    knowns[solve_for] = x;
-                    var zero = Number(evaluate(eqns, knowns));
-
-                    // Allow symbolic answers
-                    if(isNaN(zero)) {
-                        return true;
-                    }
-                    return true;
-                }
+                try {}
                 catch(e) {
                     return false;
killedBy: Solve should solve correctly
statusReason: Expected '[]' to equal '[-1]'.

[Survived] ConditionalExpression
Solve.js:1734:24
                     var zero = Number(evaluate(eqns, knowns));
 
                     // Allow symbolic answers
-                    if(isNaN(zero)) {
+                    if(false) {
                         return true;
                     }

[Survived] ConditionalExpression
Solve.js:1734:24
                     var zero = Number(evaluate(eqns, knowns));
 
                     // Allow symbolic answers
-                    if(isNaN(zero)) {
+                    if(true) {
                         return true;
                     }

[Killed] BooleanLiteral
Solve.js:1735:32
 
                     // Allow symbolic answers
                     if(isNaN(zero)) {
-                        return true;
+                        return false;
                     }
                     return true;
killedBy: Solve should solve correctly
statusReason: Expected '[a^(-1)*i*sqrt(a)*sqrt(b)]' to equal '[a^(-1)*i*sqrt(a)*sqrt(b),-a^(-1)*i*sqrt(a)*sqrt(b)]'.

[Survived] BlockStatement
Solve.js:1739:26
                     }
                     return true;
                 }
-                catch(e) {
-                    return false;
-                }
+                catch(e) {}
             });
         }

[Killed] BooleanLiteral
Solve.js:1740:28
                     return true;
                 }
                 catch(e) {
-                    return false;
+                    return true;
                 }
             });
killedBy: Solve should solve correctly
statusReason: Expected '[-10,(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]' to equal '[(-1/2)*sqrt(110)-5,(1/2)*sqrt(110)-5]'.
